Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers.CodeFixes/xlf/CodeFixResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, zh_hans, zh_hant

# AddCallerInfoParametersFix
source: Add '[CallerFilePath]' and '[CallerLineNumber]' parameters
de: Fügen Sie die Parameter „[CallerFilePath]“ und „[CallerLineNumber]“ hinzu.
it: Aggiungere i parametri '[CallerFilePath]' e '[CallerLineNumber]'
ja: '[CallerFilePath]' パラメーターと '[CallerLineNumber]' パラメーターを追加する

# AddTestClassFix
source: Add '[TestClass]'
de: "[TestClass]" hinzufügen
it: Aggiungi '[TestClass]'
ja: '[TestClass]' の追加
ko: '[TestClass]' 추가
zh_hans: 添加 “[TestClass]”
zh_hant: 新增 '[TestClass]'

# AddTestMethodAttributeFix
source: Add '[TestMethod]'
cs: Přidat [TestMethod]
de: „[TestMethod]“ hinzufügen
es: Agregar '[TestMethod]'
fr: Ajouter « [TestMethod] »
it: Aggiungi '[TestMethod]'
ja: '[TestMethod]' の追加
ko: '[TestMethod]' 추가
pl: Dodaj „[TestMethod]”
pt_br: Adicionar ''[TestMethod]"
ru: Добавить "[TestMethod]"
zh_hans: 添加“[TestMethod]”
zh_hant: 新增 '[TestMethod]'

# AssertionArgsShouldAvoidConditionalAccessFix
source: Move conditional access in assertion to separate 'Assert.IsNotNull' check
de: Bedingten Zugriff in Assertion auf separate "Assert.IsNotNull"-Überprüfung verschieben
it: Sposta l'accesso condizionale nell'asserzione per separare il controllo 'Assert.IsNotNull'
ja: アサーション内の条件付きアクセスを個別の 'Assert.IsNotNull' チェックに移動します
ko: 어설션의 조건부 액세스를 'Assert.IsNotNull' 검사 구분하도록 이동합니다.
zh_hans: 将断言中的条件访问移动到分隔 “Assert.IsNotNull” 检查
zh_hant: 將判斷提示中的條件式存取移動到個別的 『Assert.IsNotNull』 檢查

# AvoidAssertAreSameWithValueTypesFix
source: Use '{0}'
de: „{0}“ verwenden
it: Usare ‘{0}’
ja: '{0}' を使用する
ko: '{0}' 사용
zh_hans: 使用“{0}”
zh_hant: 使用 '{0}'

# AvoidOutParameterOnAssertIsInstanceOfTypeFix
source: Use assignment instead of 'out' parameter
de: Verwenden Sie anstelle des „out“-Parameters die Zuweisung.
it: Usare l'assegnazione anziché il parametro 'out'
ja: 'out' パラメーターの代わりに代入を使用する

# ChangeMethodAccessibilityToPrivateFix
source: Change method accessibility to 'private'
cs: Změnit přístupnost metody na private
de: Methodenzugriff auf „privat“ ändern
es: Cambiar la accesibilidad del método a "private"
fr: Remplacer l’accessibilité de la méthode par « privé »
it: Modifica l'accessibilità del metodo in 'privato'
ja: メソッドのアクセシビリティを 'private' に変更する
ko: 메서드 접근성 '비공개'로 변경하기
pl: Zmień dostępność metody na „private” (prywatna)
pt_br: Alterar a acessibilidade do método para 'privado'
ru: Изменить доступность метода на "private"
zh_hans: 将方法可访问性更改为“private”
zh_hant: 將方法協助工具變更為 'private'

# ChangeStructToClassAndAddTestClassFix
source: Change to 'class' and add '[TestClass]'
de: Wechseln Sie zu „Klasse“, und fügen Sie „[Testklasse]“ hinzu
it: Cambia in 'class' e aggiungi '[TestClass]'
ja: 'class' に変更し、'[TestClass]' を追加します
ko: 'class'로 변경하고 '[TestClass]'를 추가합니다.
zh_hans: 更改为 "class" 并添加 "[TestClass]"
zh_hant: 變更為 'class'，並新增 '[TestClass]'

# FixAssertionArgsOrder
source: Fix actual/expected arguments order
cs: Opravit pořadí skutečných/očekávaných argumentů
de: Reihenfolge der tatsächlichen/erwarteten Argumente korrigieren
es: Corregir el orden de los argumentos reales o esperados
fr: Corriger l’ordre des arguments réels/attendus
it: Correggi l'ordine degli argomenti effettivi/previsti
ja: 実際の引数と予想される引数の順序を修正する
ko: 실제/예상 인수 순서 수정
pl: Napraw rzeczywistą/oczekiwaną kolejność argumentów
pt_br: Corrigir ordem de argumentos real/esperada
ru: Исправить порядок фактических и ожидаемых аргументов
zh_hans: 修复实际/预期参数顺序
zh_hant: 修正實際/預期的引數順序

# FixSignatureCodeFix
source: Fix signature
cs: Opravit podpis
de: Signatur korrigieren
es: Corregir firma
fr: Corriger la signature numérique
it: Correggi firma
ja: 署名の修正
ko: 서명 수정
pl: Popraw podpis
pt_br: Corrigir assinatura
ru: Исправить подпись
zh_hans: 修复签名
zh_hant: 修正簽章

# PassCancellationTokenFix
source: Pass 'TestContext.CancellationToken' argument to method call
de: Argument „TestContext.CancellationToken“ an den Methodenaufruf übergeben
it: Passare l'argomento 'TestContext.CancellationToken' alla chiamata al metodo
ja: 'TestContext.CancellationToken' 引数をメソッド呼び出しに渡す

# RemoveClassCleanupBehaviorArgumentFix
source: Remove 'ClassCleanupBehavior' argument
de: Entfernen Sie das Argument „ClassCleanupBehavior“.
it: Rimuovere l'argomento 'ClassCleanupBehavior'
ja: 'ClassCleanupBehavior' 引数を削除する

# RemoveDynamicDataSourceTypeFix
source: Remove 'DynamicDataSourceType' parameter to use default 'AutoDetect'
de: Entfernen Sie den Parameter „DynamicDataSourceType“, um die Standardeinstellung „AutoDetect“ zu verwenden.
it: Rimuovi il parametro ''DynamicDataSourceType'' per utilizzare il valore predefinito ''AutoDetect''
ja: 'DynamicDataSourceType' パラメーターを削除して、既定の 'AutoDetect' を使用します

# ReplaceDataTestMethodWithTestMethodTitle
source: Replace 'DataTestMethod' with 'TestMethod'
de: „DataTestMethod“ durch „TestMethod“ ersetzen
it: Sostituisci 'DataTestMethod' con 'TestMethod'
ja: 'DataTestMethod' を 'TestMethod' に置き換えます
ko: 'DataTestMethod'를 'TestMethod'로 바꾸기
zh_hans: 将 'DataTestMethod' 替换为 'TestMethod'
zh_hant: 將 'DataTestMethod' 取代為 'TestMethod'

# ReplaceWithConstructorFix
source: Replace TestInitialize method with constructor
cs: Nahradit metodu TestInitialize konstruktorem
de: TestInitialize-Methode durch Konstruktor ersetzen
es: Reemplazar el método TestInitialize por el constructor
fr: Remplacer la méthode TestInitialize par un constructeur
it: Sostituisci il metodo TestInitialize con il costruttore
ja: TestInitialize メソッドをコンストラクターに置き換える
ko: TestInitialize 메서드를 생성자로 바꾸기
pl: Zastąp metodę TestInitialize konstruktorem
pt_br: Substituir o método TestInitialize pelo construtor.
ru: Заменить метод TestInitialize конструктором
zh_hans: 将 TestInitialize 方法替换为构造函数
zh_hant: 以建構函式取代 TestInitialize 方法

# ReplaceWithDisposeFix
source: Replace TestCleanup with Dispose method
cs: Nahradit TestCleanup metodou Dispose
de: TestCleanup durch Dispose-Methode ersetzen
es: Reemplazar TestCleanup con el método Dispose
fr: Remplacez TestCleanup par la méthode Dispose
it: Sostituisci TestCleanup con il metodo Elimina
ja: TestCleanup を Dispose メソッドに置換する
ko: TestCleanup을 Dispose 메서드로 바꾸기
pl: Zamień TestCleanup na metodę Dispose
pt_br: Substituir TestCleanup pelo método Dispose
ru: Заменить TestCleanup методом Dispose
zh_hans: 将 TestCleanup 替换为 Dispose 方法
zh_hant: 以 Dispose 方法取代 TestCleanup

# ReplaceWithFailAssertionFix
source: Replace the assertion with 'Assert.Fail()'
cs: Nahradit kontrolní výraz za Assert.Fail()
de: Ersetzen Sie die Assertion durch „Assert.Fail()“.
es: Reemplazar la aserción por "Assert.Fail()"
fr: Remplacer l’assertion avec « Assert.Fail() »
it: Sostituire l'asserzione con 'Assert.Fail()'
ja: アサーションを 'Assert.Fail()' に置き換えます
ko: 어설션을 'Assert.Fail()'으로 바꾸기
pl: Zastąp asercję elementem „Assert.Fail()”
pt_br: Substituir a asserção por "Assert.Fail()"
ru: Заменить утверждение на "Assert.Fail()"
zh_hans: 将断言替换为 "Assert.Fail()"
zh_hant: 使用 'Assert.Fail()' 取代判斷提示

# ReplaceWithTestCleanuFix
source: Replace 'Dispose' with a TestCleanup method
cs: Nahradit metodu Dispose metodou TestCleanup
de: „Dispose“ durch eine TestCleanup-Methode ersetzen
es: Reemplazar 'Dispose' por un método TestCleanup
fr: Remplacez « Dispose » par une méthode TestCleanup
it: Sostituire "Dispose" con un metodo TestCleanup
ja: 'Dispose' を TestCleanup メソッドに置き換える
ko: 'Dispose'를 TestCleanup 메서드로 바꾸기
pl: Zastąp metodę „Dispose” metodą TestCleanup
pt_br: Substituir "Dispose" por um método TestCleanup
ru: Заменить "Dispose" методом TestCleanup
zh_hans: 将“Dispose”替换为 TestCleanup 方法
zh_hant: 以 TestCleanup 方法取代 'Dispose'

# ReplaceWithTestInitializeFix
source: Replace constructor with TestInitialize method
cs: Nahradit konstruktor metodou TestInitialize
de: Konstruktor durch TestInitialize-Methode ersetzen
es: Reemplazar constructor por el método TestInitialize
fr: Remplacer le constructeur par la méthode TestInitialize
it: Sostituisci costruttore con metodo TestInitialize
ja: コンストラクターを TestInitialize メソッドに置き換える
ko: 생성자를 TestInitialize 메서드로 바꾸기
pl: Zastąp konstruktor metodą TestInitialize
pt_br: Substitua o construtor pelo método TestInitialize.
ru: Заменить конструктор на метод TestInitialize
zh_hans: 将构造函数替换为 TestInitialize 方法
zh_hant: 使用 TestInitialize 方法取代建構函式

# StringAssertToAssertTitle
source: Use 'Assert.{0}' instead of 'StringAssert'
de: Verwenden Sie „Assert.{0}“ anstelle von „StringAssert“.
it: Usa 'Assert.{0}' invece di 'StringAssert'
ja: 'StringAssert' の代わりに 'Assert.{0}' を使用
ko: 'StringAssert' 대신 'Assert.{0}' 사용
zh_hans: 使用 'Assert.{0}' 而不是 'StringAssert'
zh_hant: 使用 'Assert.{0}' 而不是 'StringAssert'

# TestClassShouldBeValidFix
source: Fix test class signature
cs: Oprava podpisu testovací třídy
de: Testklassensignatur korrigieren
es: Corregir firma de clase de prueba
fr: Correction de la signature de classe de test
it: Correggi la firma della classe di test
ja: テスト クラスのシグネチャの修正
ko: 테스트 클래스 서명 수정
pl: Napraw podpis klasy testowej
pt_br: Correção da assinatura de classe do teste
ru: Исправить подпись класса теста
zh_hans: 修复测试类签名
zh_hant: 修正測試類別簽章

# TestContextShouldBeValidFix
source: Fix test context
cs: Oprava kontextu testu
de: Testkontext korrigieren
es: Corregir contexto de prueba
fr: Corriger le contexte de test
it: Correggi il contesto di test
ja: テスト コンテキストの修正
ko: 테스트 컨텍스트 수정
pl: Napraw kontekst testu
pt_br: Correção de contexto do teste
ru: Исправить контекст теста
zh_hans: 修复测试上下文
zh_hant: 修正測試內容

# TestMethodShouldBeValidFix
source: Fix test method signature
cs: Opravit podpis testovací metody
de: Korrektur der Signatur der Testmethode
es: Corregir firma del método de prueba
fr: Corriger la signature de la méthode de test
it: Correggi la firma del metodo di test
ja: テスト メソッドのシグネチャを修正する
ko: 테스트 메서드 시그니처 수정
pl: Napraw podpis metody testowej
pt_br: Corrigir a assinatura do método de teste
ru: Исправить подпись метода теста
zh_hans: 修复测试方法签名
zh_hant: 修正測試方法簽章

# TransformExecuteToExecuteAsyncFix
source: Transform 'Execute' override to 'ExecuteAsync'
de: Transformieren Sie die Überschreibung von „Execute“ in „ExecuteAsync“.
it: Trasformare l'override di 'Execute' in 'ExecuteAsync'
ja: 'Execute' オーバーライドを 'ExecuteAsync' に変換する

# UseAttributeOnTestMethodFix
source: Add '[TestMethod]'
cs: Přidat [TestMethod]
de: „[TestMethod]“ hinzufügen
es: Agregar '[TestMethod]'
fr: Ajouter « [TestMethod] »
it: Aggiungi '[TestMethod]'
ja: '[TestMethod]' の追加
ko: '[TestMethod]' 추가
pl: Dodaj „[TestMethod]”
pt_br: Adicionar ''[TestMethod]"
ru: Добавить "[TestMethod]"
zh_hans: 添加“[TestMethod]”
zh_hant: 新增 '[TestMethod]'

# UseContainsKeyInsteadOfContainsFix
source: Use 'ContainsKey' instead of 'Contains'
de: Verwenden Sie „ContainsKey“ anstelle von „Contains“.
it: Usare 'ContainsKey' invece di 'Contains'
ja: 'Contains' の代わりに 'ContainsKey' を使用する

# UseCancellationTokenPropertyFix
source: Use 'TestContext.CancellationToken' instead
de: Stattdessen „TestContext.CancellationToken“ verwenden
it: In alternativa, usare 'TestContext.CancellationToken'
ja: 代わりに 'TestContext.CancellationToken' を使用する

# UseCooperativeCancellationForTimeoutFix
source: Use 'CooperativeCancellation = true'
de: Verwenden Sie „CooperativeCancellation = true“.
ja: 'CooperativeCancellation = true' を使用する
ko: 'CooperativeCancellation = true'를 사용하세요.
zh_hans: 使用 'CooperativeCancellation = true'
zh_hant: 使用 'CooperativeCancellation = true'

# UseDisplayNamePropertyInsteadOfStringArgumentFix
source: Use 'DisplayName' property instead of string argument
de: Verwenden Sie die Eigenschaft „DisplayName“ anstelle eines Zeichenfolgenarguments.
it: Usare la proprietà 'DisplayName' invece di un argomento stringa
ja: 文字列引数の代わりに 'DisplayName' プロパティを使用する

# UseProperAssertMethodsFix
source: Use '{0}'
cs: Použít {0}
de: "{0}" verwenden
fr: Utiliser « {0} »
it: Usa '{0}'
ja: '{0}' を使用します
ko: '{0}' 사용
pl: Użyj „{0}”
ru: Использовать "{0}"
zh_hans: 使用“{0}”
zh_hant: 使用 '{0}'

# AssemblyInitializeShouldBeValidCodeFix
source: Fix signature
cs: Opravit podpis
es: Corregir firma
fr: Corriger la signature numérique
ko: 서명 수정
pl: Popraw podpis
pt_br: Corrigir assinatura
ru: Исправить подпись
zh_hans: 修复签名
zh_hant: 修正簽章

# PassCancellationTokenFix
source: Pass 'TestContext.CancellationTokenSource.Token' argument to method call
ko: 메서드 호출에 'TestContext.CancellationTokenSource.Token' 인수 전달
zh_hans: 将 'TestContext.CancellationTokenSource.Token' 参数传递给方法调用
zh_hant: 將 'TestContext.CancellationTokenSource.Token' 引數傳遞給方法呼叫

# UseAssertThrowsExceptionOnLastStatementFix
source: Use 'Assert.ThrowsException<T>' instead of '[ExpectedException]' attribute
cs: Místo atributu [ExpectedException] použijte assert.ThrowsException<T>.
es: Use "Assert.ThrowsException<T>" en lugar del atributo "[ExpectedException]"
fr: Utilisez l'attribut 'Assert.ThrowsException<T>' au lieu de l'attribut '[ExpectedException]'
ko: '[ExpectedException]' 특성 대신 'Assert.ThrowsException<T>'을 사용합니다.
pl: Użyj atrybutu „Assert.ThrowsException<T>” zamiast atrybutu „[ExpectedException]”
pt_br: Usar 'Assert.ThrowsException<T>' em vez do atributo '[ExpectedException]'
ru: Используйте "Assert.ThrowsException<T>" вместо атрибута "[ExpectedException]"
zh_hans: 使用“Assert.ThrowsException<T>”而不是“[ExpectedException]”属性
zh_hant: 使用 'Assert.ThrowsException<T>' 取代 '[ExpectedException]' 属性

# UseNewerAssertThrows
source: Use '{0}'
ko: '{0}' 사용
zh_hans: 使用“{0}”
zh_hant: 使用 '{0}'

# PublicTypeShouldBeTestClassFix
source: Add '[TestClass]'
cs: Přidat [TestClass]
es: Agregar '[TestClass]'
fr: Ajouter « [TestClass] »
pl: Dodaj element „[TestClass]”
pt_br: Adicionar '[TestClass]'
ru: Добавить '[TestClass]'
