Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Extensions.CrashDump/Resources/xlf/CrashDumpResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CannotFindExpectedCrashDumpFile
source: Expected crash dump file '{0}' could not be found, all files matching the '*.dmp' pattern will be copied to the result folder
cs: Nebyl nalezen očekávaný soubor výpisu stavu systému {0}. Všechny soubory odpovídající vzoru *.dmp budou zkopírovány do složky výsledků.
de: Die erwartete Absturzabbilddatei "{0}" wurde nicht gefunden. Alle Dateien, die dem Muster "*.dmp" entsprechen, werden in den Ergebnisordner kopiert
es: No se encontró el '{0}' de archivo de volcado esperado. Todos los archivos que coincidan con el patrón "*.dmp" se copiarán en la carpeta de resultados.
fr: Le fichier de vidage sur incident attendu « {0} » n'a pas été trouvé, tous les fichiers correspondant au modèle « *.dmp » seront copiés dans le dossier de résultats.
it: Il file di dump di arresto anomalo '{0}' previsto non è stato trovato. Tutti i file corrispondenti al criterio '*.dmp' verranno copiati nella cartella dei risultati.
ja: 予期されたクラッシュ ダンプ ファイル '{0}' が見つかりませんでした。'*.dmp' パターンに一致するすべてのファイルが結果フォルダーにコピーされます
ko: 필요한 크래시 덤프 파일 '{0}'을(를) 찾을 수 없습니다. '*.dmp' 패턴과 일치하는 모든 파일이 결과 폴더에 복사됩니다.
pl: Nie można odnaleźć oczekiwanego pliku zrzutu awaryjnego „{0}”. Wszystkie pliki zgodne ze wzorcem „*.dmp” zostaną skopiowane do folderu wyników
pt_br: O arquivo de despejo de memória ''{0}'' não pôde ser encontrado. Todos os arquivos correspondentes ao padrão ''*.dmp'' serão copiados para a pasta de resultados
ru: Не удалось найти ожидаемый файл аварийного дампа "{0}". Все файлы, соответствующие шаблону "*.dmp", будут скопированы в папку результатов.
tr: Beklenen kilitlenme dökümü dosyası '{0}' bulunamadı, '*.dmp' düzeniyle eşleşen tüm dosyalar sonuç klasörüne kopyalanacak
zh_hans: 找不到预期的故障转储文件“{0}”，与“*.dmp”模式匹配的所有文件都将复制到结果文件夹
zh_hant: 找不到預期的損毀傾印檔案 '{0}'，符合 '*.dmp' 模式的所有檔案都將複製到結果資料夾

# CrashDumpArtifactDescription
source: The testhost process crash dump file
cs: Soubor výpisu stavu systému procesu testhost
de: Die Absturzabbilddatei für den Testhostprozess
es: Archivo de volcado de memoria del proceso del host de pruebas
fr: Le fichier de vidage sur incident du processus testhost
it: File di dump di arresto anomalo del processo testhost
ja: testhost プロセスのクラッシュ ダンプ ファイル
ko: testhost 프로세스 크래시 덤프 파일
pl: Plik zrzutu awaryjnego procesu testhost
pt_br: O arquivo de despejo de memória do processo testhost
ru: Файл аварийного дампа тестового хост-процесса
tr: Test ana bilgisayarı işlemi kilitlenme bilgi dökümü dosyası
zh_hans: testhost 进程故障转储文件
zh_hant: testhost 處理常式損毀傾印檔案

# CrashDumpArtifactDisplayName
source: Crash dump file
cs: Soubor výpisu stavu systému
de: Absturzabbilddatei
es: Archivo de volcado de memoria
fr: Fichier de vidage sur incident
it: File di dump di arresto anomalo del sistema
ja: クラッシュ ダンプ ファイル
ko: 크래시 덤프 파일
pl: Plik zrzutu awaryjnego
pt_br: Arquivo de despejo de memória
ru: Файл аварийного дампа
tr: Kilitlenme bilgi dökümü dosyası
zh_hans: 故障转储文件
zh_hant: 損毀傾印檔案

# CrashDumpDescription
source: [net6.0+ only] Produce crash dump files when the test execution process crashes unexpectedly
cs: [Pouze net6.0+ ] Vytvořit soubory výpisu stavu systému při neočekávaném chybovém ukončení procesu provádění testu
de: [nur net6.0+] Erstellen von Absturzabbilddateien, wenn der Testausführungsprozess unerwartet abstürzt
es: [solo net6.0+ ] Generar archivos de volcado de memoria cuando el proceso de ejecución de pruebas se bloquea inesperadamente
fr: [net6.0+ uniquement] Produire des fichiers de vidage sur incident lorsque le processus d’exécution des tests se bloque de manière inattendue
it: [solo net6.0+] Generazione di file di dump di arresto anomalo quando il processo di esecuzione del test si arresta in modo imprevisto
ja: [net6.0+ のみ] テストの実行プロセスが予期せずクラッシュしたときにクラッシュ ダンプ ファイルを生成する
ko: [net6.0 이상만] 테스트 실행 프로세스가 예기치 않게 충돌할 때 크래시 덤프 파일 생성
pl: [tylko net6.0+ ] Tworzenie plików zrzutu awaryjnego w przypadku nieoczekiwanej awarii procesu wykonywania testu
pt_br: [somente net6.0+] Produzir arquivos de despejo de memória quando o processo de execução de teste falhar inesperadamente
ru: [только net6.0 и выше] Создавать файлы аварийного дампа при неожиданном сбое процесса выполнения теста
tr: [yalnızca net6.0+] Test yürütme işlemi beklenmedik bir şekilde çöktüğünde kilitlenme dökümü dosyaları oluştur
zh_hans: [仅限 net6.0+]在测试执行进程意外崩溃时生成故障转储文件
zh_hant: [net6.0+ only] 測試執行流程意外損毀時會產生損毀傾印檔案

# CrashDumpDisplayName
source: Crash dump
cs: Výpis stavu systému
de: Absturzspeicherabbild
es: Volcado de memoria
fr: Vidage sur incident
it: Dump di arresto anomalo del sistema
ja: クラッシュ ダンプ
ko: 크래시 덤프
pl: Zrzut awaryjny
pt_br: Despejo de memória
ru: Аварийный дамп
tr: Kilitlenme bilgi dökümü
zh_hans: 故障转储
zh_hant: 損毀傾印

# CrashDumpFileNameOptionDescription
source: Specify the name of the dump file
cs: Zadejte název souboru výpisu paměti.
de: Namen der Speicherabbilddatei angeben
es: Especificar el nombre del archivo de volcado
fr: Spécifier le nom du fichier de vidage
it: Specificare il nome del file di dump
ja: ダンプ ファイルの名前を指定する
ko: 덤프 파일의 이름 지정
pl: Określ nazwę pliku zrzutu
pt_br: Especifique o nome do arquivo de despejo
ru: Укажите имя файла дампа зависания
tr: Döküm dosyasının adını belirtin
zh_hans: 指定转储文件的名称
zh_hant: 指定傾印檔案的名稱

# CrashDumpInvalidEnvironmentVariableValueErrorMessage
source: Environment variable '{0}' should have been set to '{1}' but value is '{2}'
cs: Proměnná prostředí {0} by měla být nastavená na {1}, ale hodnota je {2}.
de: Die Umgebungsvariable "{0}" hätte auf "{1}" festgelegt werden sollen, aber der Wert ist "{2}"
es: La variable de entorno '{0}' debe haberse establecido en '{1}' pero el valor es '{2}'
fr: La variable d’environnement «{0}» doit avoir la valeur «{1}», mais la valeur est «{2}»
it: La variabile di ambiente '{0}' avrebbe dovuto essere impostata su '{1}' ma il valore è '{2}'
ja: 環境変数 '{0}' は '{1}' に設定する必要がありますが、値は '{2}' です
ko: 환경 변수 '{0}'은(는) '{1}'로 설정해야 하지만 값이 '{2}'입니다.
pl: Zmienna środowiskowa „{0}” powinna być ustawiona na „{1}”, ale wartość to „{2}”
pt_br: A variável de ambiente ''{0}'' deveria ter sido definida como ''{1}'', mas o valor é ''{2}''
ru: Для переменной среды "{0}" должно быть задано значение "{1}", но задано значение "{2}"
tr: Ortam değişkeni '{0}', '{1}' olarak ayarlanmalıydı ancak değer '{2}'
zh_hans: 环境变量“{0}”应设置为“{1}”，但值为“{2}”
zh_hant: 環境變數 '{0}' 應該設定為 '{1}' 但值為 '{2}'

# CrashDumpNotSupportedInNonNetCoreErrorMessage
source: Crash dump feature is only available in .NET (Core)
cs: Funkce výpisu stavu systému je k dispozici pouze v rozhraní .NET (Core).
de: Das Absturzabbildfeature ist nur in .NET (Core) verfügbar
es: La característica de volcado de memoria solo está disponible en .NET (Core)
fr: La fonctionnalité de vidage sur incident est disponible uniquement dans .NET (Core)
it: La funzionalità dump di arresto anomalo del sistema è disponibile solo in .NET (Core)
ja: クラッシュ ダンプ機能は .NET (Core) でのみ使用できます
ko: 크래시 덤프 기능은 .NET(Core)에서만 사용할 수 있습니다.
pl: Funkcja zrzutu awaryjnego jest dostępna tylko na platformie .NET (Core)
pt_br: O recurso de despejo de memória só está disponível no .NET (Core)
ru: Функция аварийного дампа доступна только в .NET (Core)
tr: Kilitlenme dökümü özelliği yalnızca .NET'te (Core) mevcuttur
zh_hans: 故障转储功能仅在 .NET (Core) 中可用
zh_hant: 只有 .NET (Core) 才可使用損毀傾印功能

# CrashDumpOptionDescription
source: [net6.0+ only] Generate a dump file if the test process crashes
cs: [Pouze net6.0+ ] Vygenerovat soubor výpisu paměti v případě chybového ukončení procesu testu
de: [nur net6.0+] Speicherabbilddatei generieren, wenn der Testprozess abstürzt
es: [solo net6.0+ ] Generar un archivo de volcado si el proceso de prueba se bloquea
fr: [net6.0+ uniquement] Générer un fichier de vidage si le processus de test se bloque
it: [solo net6.0+ ] Generazione di un file di dump in caso di arresto anomalo del processo di test
ja: [net6.0+ のみ] テスト プロセスがクラッシュした場合にダンプ ファイルを生成する
ko: [net6.0 이상만] 테스트 프로세스가 충돌하는 경우 덤프 파일 생성
pl: [tylko net6.0+ ] Wygeneruj plik zrzutu w przypadku awarii procesu testowego
pt_br: [somente net6.0+] Gerar um arquivo de despejo se o processo de teste falhar
ru: [только net6.0 и выше] Создавать файл дампа в случае сбоя тестового процесса
tr: [yalnızca net6.0+] Test işlemi çökerse bir döküm dosyası oluşturun
zh_hans: [仅限 net6.0+]如果测试进程崩溃，则生成转储文件
zh_hant: [net6.0+ only] 如果測試流程損毀，則產生傾印檔案

# CrashDumpProcessCrashedDumpFileCreated
source: Test host process with PID '{0}' crashed, a dump file was generated
cs: Hostitelský proces testu s identifikátorem PID {0} byl chybově ukončen. Byl vygenerován soubor výpisu paměti.
de: Der Testhostprozess mit PID "{0}" ist abgestürzt. Es wurde eine Abbilddatei generiert
es: Se bloqueó el proceso de host de prueba con PID '{0}' y se generó un archivo de volcado
fr: Le processus hôte de test avec le PID «{0}» s’est arrêté, un fichier de vidage a été généré
it: Il processo host di test con PID '{0}' si è arrestato in modo anomalo. È stato generato un file di dump
ja: PID '{0}' のテスト ホスト プロセスがクラッシュしました。ダンプ ファイルが生成されました
ko: PID가 '{0}'인 테스트 호스트 프로세스가 충돌했습니다. 덤프 파일이 생성되었습니다.
pl: Proces hosta testowego o identyfikatorze PID „{0}{0}” uległ awarii, wygenerowano plik zrzutu
pt_br: O processo de host de teste com PID ''{0}'' falhou e um arquivo de despejo foi gerado
ru: Произошло аварийное завершение тестового хост-процесса с идентификатором процесса "{0}". Создан файл дампа
tr: PID'li test ana işlemi ‘{0}' kilitlendi, bir döküm dosyası oluşturuldu
zh_hans: PID 为“{0}”的测试主机进程崩溃，生成了转储文件
zh_hant: PID '{0}' 損毀的測試主機處理常式，已產生傾印檔案

# CrashDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' or 'Full'. Default type is 'Full'. For more information visit https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
cs: Zadejte typ výpisu paměti. Platné hodnoty jsou Mini, Heap, Triage nebo Full. Výchozí typ je Full. Další informace najdete na https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
es: Especifique el tipo de volcado. Los valores válidos son "Mini", "Heap", "Evaluación de prioridades" o "Completo". El tipo predeterminado es 'Completo'. Para obtener más información, visite https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps

# CrashDumpTypeOptionInvalidType
source: '{0}' is not a valid dump type. Valid options are 'Mini', 'Heap', 'Triage' and 'Full'
cs: {0} není platný typ výpisu paměti. Platné možnosti jsou Mini, Heap, Triage a Full.
de: "{0}" ist kein gültiger Speicherabbildtyp. Gültige Optionen sind "Mini", "Heap", "Triage" und "Full"
es: '{0}' no es un tipo de volcado válido. Las opciones válidas son "Mini", "Montón", "Evaluación de prioridades" y "Completa"
fr: '{0}' n’est pas un type de vidage valide. Les options valides sont « Mini », « Heap », « Triage » et « Full »
it: '{0}' non è un tipo di dump valido. Le opzioni valide sono 'Mini', 'Heap', 'Triage' e 'Full'
ja: '{0}' は有効なダンプの種類ではありません。有効なオプションは、'Mini'、'Heap'、'Triage'、'Full' です
ko: '{0}'은(는) 올바른 덤프 유형이 아닙니다. 유효한 옵션은 'Mini', 'Heap', 'Triage' 및 'Full'입니다.
pl: Typ „{0}” nie jest prawidłowym typem zrzutu. Prawidłowe opcje to „Mini”, „Sterta”, „Klasyfikacja” i „Pełne”
pt_br: ''{0}'' não é um tipo de despejo válido. As opções válidas são ''Mini'', ''Heap'', ''Triage'' e ''Full''
ru: "{0}" не является допустимым типом дампа. Допустимые параметры: "Mini", "Heap", "Triage" и "Full"
tr: '{0}' geçerli bir döküm türü değil. Geçerli seçenekler 'Mini', 'Heap', 'Triage' ve 'Full’dur
zh_hans: “{0}”不是有效的转储类型。有效选项为“Mini”、“Heap”、“Triage”和“Full”
zh_hant: '{0}' 不是有效的傾印類型。有效的選項為 'Mini'、'Heap'、'Triage' 和 'Full'

# CrashDumpTypeOptionTooManyArguments
source: '--crashdump-type' expects a single dump type as argument (e.g. '--crashdump-type Heap')
cs: --hangdump-type očekává jako argument jeden typ výpisu paměti (například --hangdump-type Heap).
de: "--crashdump-type" erwartet einen einzelnen Speicherabbildtyp als Argument (z. B. "--crashdump-type Heap")
es: '--crashdump-type' espera un único tipo de volcado como argumento (por ejemplo, '--crashdump-type Heap')
fr: '--crashdump-type' attend un seul type de dump comme argument (par exemple '--crashdump-type Heap')
it: '--crashdump-type' prevede un singolo tipo di dump come argomento (ad esempio '--crashdump-type Heap')
ja: '--crashdump-type' には、引数として 1 つのダンプの型が必要です (例: '--crashdump-type Heap')
ko: '--crashdump-type'에는 단일 덤프 유형이 인수로 필요합니다(예: '--crashdump-type Heap').
pl: Element „--crashdump-type” oczekuje pojedynczego typu zrzutu jako argumentu (np. „--crashdump-type Heap”)
pt_br: ''--crashdump-type'' espera um único tipo de despejo como argumento (por exemplo, ''--crashdump-type Heap'')
ru: "--hangdump-type" ожидает в качестве аргумента один тип дампа (например, "--crashdump-type Heap")
tr: '--crashdump-type' argüman olarak tek bir döküm tipini bekler (örneğin, '--crashdump-type Heap')
zh_hans: “--crashdump-type”需要将单一转储类型作为参数(例如“--crashdump-type Heap”)
zh_hant: '--crashdump-type' 需要單一傾印類型做為引數 (例如 '--crashdump-type Heap')

# UnsupportedRequestTypeErrorMessage
source: Requests of type '{0}' is not supported
cs: Žádosti typu {0} nejsou podporovány.
de: Anforderungen vom Typ "{0}" werden nicht unterstützt
es: No se admiten solicitudes de tipo '{0}'
fr: Les demandes de type «{0}» ne sont pas prises en charge
it: Le richieste di tipo '{0}' non sono supportate
ja: 型 '{0}' の要求はサポートされていません
ko: '{0}' 유형의 요청은 지원되지 않습니다.
pl: Żądania typu „{0}” nie są obsługiwane
pt_br: Não há suporte para solicitações de tipo ''{0}''
ru: Запросы типа "{0}" не поддерживаются
tr: '{0}' türündeki istek desteklenmiyor
zh_hans: 不支持类型为“{0}”的请求
zh_hant: 不支援類型 '{0}' 的要求

# CrashDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' or 'Full'. Default type is 'Full'. For more information visit https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
de: Geben Sie den Typ des Speicherabbilds an. Gültige Werte sind „Mini“, „Heap“, „Triage“ oder „Full“. Der Standardtyp ist „Full“. Weitere Informationen finden Sie unter https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
fr: Spécifiez le type de l’image mémoire. Les valeurs valides sont « Mini », « Heap », « Triage » ou « Full ». Le type par défaut est « Full ». Pour plus d’informations, visitez https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
it: Specificare il tipo di dump. I valori validi sono "Mini", "Heap", "Valutazione" o "Completo". Il tipo predefinito è "Completo". Per altre informazioni, visitare https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
pl: Określ typ zrzutu. Prawidłowe wartości to „Mini”, „Sterta”, „Klasyfikacja” i „Pełne”. Typ domyślny to „Pełne”. Aby uzyskać więcej informacji, odwiedź stronę https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
pt_br: Especifique o tipo de despejo. Os valores válidos são ''Mini'', ''Heap'', ''Triage'' ou ''Full''. O tipo padrão é ''Full''. Para obter mais informações, visite https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
tr: Dökümün türünü belirtin. Geçerli değerler: 'Mini', 'Heap', 'Triage' veya 'Full'. Varsayılan tür: 'Full'. Daha fazla bilgi için https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps adresini ziyaret edin
zh_hant: 指定傾印的類型。有效值為 'Mini'、'Heap'、'Triage' 或 'Full'。預設類型為 'Full'。 如需詳細資訊，請瀏覽 https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps

# CrashDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' or 'Full'. Default type is 'Full'. For more information visit https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
ja: ダンプの型を指定します。有効な値は、'Mini'、'Heap'、'Triage'、または 'Full' です。既定の型は 'Full' です。 詳細については、https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps を参照してください

# CrashDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' or 'Full'. Default type is 'Full'. For more information visit https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
ru: Укажите тип дампа. Допустимые значения: "Mini", "Heap", "Triage" или "Full". Тип по умолчанию — "Full". Дополнительные сведения см. на странице https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps

# CrashDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' or 'Full'. Default type is 'Full'. For more information visit https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
zh_hans: 指定转储的类型。有效值为 "Mini"、"Heap"、"Triage" 或 "Full"。默认类型为 "Full"。有关详细信息，请访问 https://learn.microsoft.com/dotnet/core/diagnostics/collect-dumps-crash#types-of-mini-dumps
