Repository: microsoft/testfx
Catalog: src/Adapter/MSTest.CoreAdapter/Resources/xlf/Resource.*.xlf
Languages: de, es, fr, tr

# Execution_Test_Timeout
source: Test '{0}' exceeded execution timeout period.
de: Der Test "{0}" hat das Ausführungstimeout überschritten.
es: La prueba '{0}' superó el tiempo de espera de ejecución.
fr: Le test '{0}' a dépassé le délai d'attente de l'exécution.
tr: '{0}' testi yürütme zaman aşımı süresini aştı.

# SourcesNotSupported
source: Running tests in any of the provided sources is not supported for the selected platform
de: Das Ausführen von Tests in einer der angegebenen Quellen wird für die ausgewählte Plattform nicht unterstützt.
es: La ejecución de pruebas en las fuentes proporcionadas no se admite para la plataforma seleccionada
fr: L'exécution de tests dans l'une des sources fournies n'est pas prise en charge pour la plateforme sélectionnée
tr: Testlerin sağlanan kaynakların herhangi birinde çalıştırılması seçili platformda desteklenmiyor

# UTA_CleanupMethodThrows
source: TestCleanup method {0}.{1} threw exception. {2}: {3}.
de: Die TestCleanup-Methode "{0}.{1}" hat eine Ausnahme ausgelöst. {2}: {3}.
es: El método TestCleanup {0}.{1} devolvió una excepción. {2}: {3}.
fr: La méthode TestCleanup {0}.{1} a levé une exception. {2}: {3}.
tr: TestCleanup metodu ({0}.{1}) özel durum oluşturdu. {2}: {3}.

# UTA_EndOfInnerExceptionTrace
source: --- End of inner exception stack trace ---
de: --- Ende der internen Ausnahmestapelüberwachung ---
es: --- Fin del seguimiento de la pila de excepción interna ---
fr: --- Fin de la trace de la pile d'exception interne ---
tr: --- İç özel durum yığın izlemesinin sonu ---

# UTA_ErrorMultiAssemblyClean
source: UTA014: {0}: Cannot define more than one method with the AssemblyCleanup attribute inside an assembly.
de: UTA014: {0}: Es darf nur eine Methode mit dem Attribut 'AssemblyCleanup' innerhalb einer Assembly definiert werden.
es: UTA014: {0}: No se puede definir más de un método con el atributo AssemblyCleanup dentro de un ensamblado.
fr: UTA014 : {0} : impossible de définir plus d'une méthode avec l'attribut AssemblyCleanup à l'intérieur d'un assembly.
tr: UTA014: {0}: Bir bütünleştirilmiş kod içinde AssemblyCleanup özniteliği ile birden fazla metot tanımlanamaz.

# UTA_ErrorMultiAssemblyInit
source: UTA013: {0}: Cannot define more than one method with the AssemblyInitialize attribute inside an assembly.
de: UTA013: {0}: Es darf nur eine Methode mit dem Attribut 'AssemblyInitialize' innerhalb einer Assembly definiert werden.
es: UTA013: {0}: No se puede definir más de un método con el atributo AssemblyInitialize dentro de un ensamblado.
fr: UTA013 : {0} : impossible de définir plus d'une méthode avec l'attribut AssemblyInitialize à l'intérieur d'un assembly.
tr: UTA013: {0}: Bir bütünleştirilmiş kod içinde AssemblyInitialize özniteliği ile birden fazla metot tanımlanamaz.

# UTA_ErrorMultiClassClean
source: UTA026: {0}: Cannot define more than one method with the ClassCleanup attribute inside a class.
de: UTA026: {0}: Es darf nur eine Methode mit dem Attribut 'ClassCleanup' innerhalb einer Klasse definiert werden.
es: UTA026: {0}: No se puede definir más de un método con el atributo ClassCleanup dentro de una clase.
fr: UTA026 : {0} : impossible de définir plus d'une méthode avec l'attribut ClassCleanup à l'intérieur d'une classe.
tr: UTA026: {0}: Bir sınıf içinde ClassCleanup özniteliği ile birden fazla metot tanımlanamaz.

# UTA_ErrorMultiClassInit
source: UTA025: {0}: Cannot define more than one method with the ClassInitialize attribute inside a class.
de: UTA025: {0}: Es darf nur eine Methode mit dem Attribut 'ClassInitialize' innerhalb einer Klasse definiert werden.
es: UTA025: {0}: No se puede definir más de un método con el atributo ClassInitialize dentro de una clase.
fr: UTA025 : {0} : impossible de définir plus d'une méthode avec l'attribut ClassInitialize à l'intérieur d'une classe.
tr: UTA025: {0}: Bir sınıf içinde ClassInitialize özniteliği ile birden fazla metot tanımlanamaz.

# UTA_ErrorMultiClean
source: UTA024: {0}: Cannot define more than one method with the TestCleanup attribute.
de: UTA024: {0}: Es darf nur eine Methode mit dem Attribut 'TestCleanup' definiert werden.
es: UTA024: {0}: No se puede definir más de un método con el atributo TestCleanup.
fr: UTA024 : {0} : impossible de définir plus d'une méthode avec l'attribut TestCleanup.
tr: UTA024: {0}: TestCleanup özniteliği ile birden fazla metot tanımlanamaz.

# UTA_ErrorMultiInit
source: UTA018: {0}: Cannot define more than one method with the TestInitialize attribute.
de: UTA018: {0}: Es darf nur eine Methode mit dem Attribut 'TestInitialize' definiert werden.
es: UTA018: {0}: No se puede definir más de un método con el atributo TestInitialize.
fr: UTA018 : {0} : impossible de définir plus d'une méthode avec l'attribut TestInitialize.
tr: UTA018: {0}: TestInitialize özniteliği ile birden fazla metot tanımlanamaz.

# UTA_InitMethodThrows
source: Initialization method {0}.{1} threw exception. {2}.
de: Die Initialisierungsmethode '{0}.{1}' hat eine Ausnahme ausgelöst. {2}.
es: El método de inicialización {0}.{1} devolvió una excepción. {2}.
fr: La méthode Initialization {0}.{1} a levé une exception. {2}.
tr: Başlatma metodu {0}.{1} özel durum oluşturdu. {2}.

# UTA_InstanceCreationError
source: Unable to create instance of class {0}. Error: {1}.
de: Es kann keine Instanz der Klasse '{0}' erstellt werden. Fehler: {1}.
es: No se puede crear una instancia de la clase {0}. Error: {1}.
fr: Impossible de créer une instance de la classe {0}. Erreur : {1}.
tr: {0} sınıfının örneği oluşturulamıyor. Hata: {1}.

# UTA_TestContextSetError
source: Unable to set TestContext property for the class {0}. Error: {1}.
de: Die Eigenschaft 'TestContext' für die Klasse '{0}' kann nicht festgelegt werden. Fehler: {1}.
es: No se puede establecer la propiedad TestContext para la clase {0}. Error: {1}.
fr: Impossible de définir la propriété TestContext pour la classe {0}. Erreur : {1}.
tr: {0} sınıfı için TestContext özelliği ayarlanamıyor. Hata: {1}.

# UTF_FailedToGetExceptionMessage
source: (Failed to get the message for an exception of type {0} due to an exception.)
de: (Fehler beim Abrufen der Meldung für eine Ausnahme vom Typ "{0}" aufgrund einer Ausnahme.)
es: (No se pudo obtener el mensaje para una excepción del tipo {0} debido a una excepción.)
fr: (Échec de la réception du message pour une exception de type {0} en raison d'une exception.)
tr: (Bir özel durum nedeniyle, {0} türündeki özel durum iletisi alınamadı.)

# UTA_ErrorInValidTestContextSignature
source: UTA031: class {0} does not have valid TestContext property. TestContext must be of type TestContext, must be non-static, public and must not be read-only. For example: public TestContext TestContext.
de: UTA031: Die Klasse '{0}' weist keine gültige Eigenschaft 'TestContext' auf. 'TestContext' muss vom Typ 'TestContext', nicht statisch und öffentlich sein und darf nicht schreibgeschützt sein. Beispiel: 'public TestContext TestContext'.
es: UTA031: la clase {0} no tiene la propiedad TestContext válida. TestContext debe ser de tipo TestContext, debe ser no estática, pública y no debe ser de solo lectura. Por ejemplo: public TestContext TestContext.
fr: UTA031 : la classe {0} ne possède pas une propriété TestContext valide. TestContext doit être de type TestContext, doit être non statique, publique, et ne doit pas être en lecture seule. Par exemple : public TestContext TestContext.
tr: UTA031: {0} sınıfı geçerli bir TestContext özelliğine sahip değil. TestContext, TestContext türünde olmalı, statik olmamalı, genel olmalı ve salt okunur olmamalı. Örnek: public TestContext TestContext.

# UTA_ErrorNonPublicTestClass
source: UTA001: TestClass attribute defined on non-public class {0}
de: UTA001: Für die nicht öffentliche Klasse '{0}' definiertes Attribut 'TestClass'.
es: UTA001: se ha definido el atributo TestClass en la clase no pública {0}
fr: UTA001 : attribut TestClass défini sur la classe non publique {0}
tr: UTA001: TestClass özniteliği genel olmayan {0} sınıfında tanımlanmış

# CouldNotInspectTypeDuringDiscovery
source: MSTestAdapter failed to discover tests in class '{0}' of assembly '{1}' because {2}.
de: Fehler von 'MSTestAdapter' beim Ermitteln von Tests in der Klasse "{0}" der Assembly "{1}". Ursache: {2}.
es: MSTestAdapter no detectó pruebas en la clase '{0}' del ensamblado '{1}' porque {2}.
fr: MSTestAdapter n'a pas découvert de tests dans la classe '{0}' de l'assembly '{1}', car {2}.
tr: MSTestAdapter, '{1}' bütünleştirilmiş kodunun '{0}' sınıfındaki testleri bulamadı. Nedeni: {2}.

# TypeLoadFailed
source: Unable to load types from the test source '{0}'. Some or all of the tests in this source may not be discovered.
de: Fehler beim Laden von Typen aus der Testquelle '{0}'. Möglicherweise werden einige oder alle Tests in dieser Quelle nicht ermittelt.
es: No se pueden cargar tipos del origen de pruebas '{0}'. Puede que no se detecten algunas o ninguna de las pruebas de este origen.
fr: Impossible de charger les types de la source de test '{0}'. Tout ou partie des tests contenus dans cette source n'ont pas pu être détectés.
tr: '{0}' test kaynağından türler yüklenemedi. Bu kaynaktaki testlerin tümü veya bir bölümü bulunamıyor olabilir.

# UTA_ErrorGenericTestMethod
source: UTA015: A generic method cannot be a test method. {0}.{1} has invalid signature
de: UTA015: Eine generische Methode kann keine Testmethode sein. '{0}.{1}' weist eine ungültige Signatur auf.
es: UTA015: Un método genérico no puede ser un método de prueba. {0}.{1} tiene una firma no válida
fr: UTA015 : une méthode générique ne peut pas être une méthode de test. {0}.{1} a une signature non valide
tr: UTA015: Genel metot bir test metodu olamaz. {0}.{1} geçersiz imzaya sahip

# Common_CannotBeNullOrEmpty
source: The parameter should not be null or empty.
de: Der Parameter darf nicht NULL oder leer sein.
es: El parámetro no debe ser NULL ni estar vacío.
fr: Le paramètre ne doit pas être une valeur Null ou être vide.
tr: Parametre null veya boş olmamalıdır.

# Common_MustBeGreaterThanZero
source: The parameter must be greater than zero.
de: Der Parameter muss größer als Null sein.
es: El parámetro debe ser mayor que cero.
fr: Le paramètre doit être supérieur à zéro.
tr: Parametre sıfırdan büyük olmalıdır.

# CouldNotInspectTypeDuringDiscovery1
source: MSTestAdapter failed to discover tests in class '{0}' of assembly '{1}'. Reason {2}.
de: Fehler von 'MSTestAdapter' beim Ermitteln von Tests in der Klasse "{0}" der Assembly "{1}". Ursache {2}.
es: MSTestAdapter no detectó pruebas en la clase '{0}' del ensamblado '{1}'. Motivo: {2}.
fr: MSTestAdapter n'a pas découvert de tests dans la classe '{0}' de l'assembly '{1}'. Raison {2}.
tr: MSTestAdapter, '{1}' bütünleştirilmiş kodunun '{0}' sınıfında testleri bulamadı. Nedeni: {2}.

# TestAssembly_FileDoesNotExist
source: File does not exist: {0}
de: Die Datei ist nicht vorhanden: {0}
es: El archivo no existe: {0}
fr: Fichier inexistant : {0}
tr: Dosya yok: {0}

# UTA_ErrorIncorrectTestMethodSignature
source: UTA007: Method {1} defined in class {0} does not have correct signature. Test method marked with the [TestMethod] attribute must be non-static, public, return-type as void and should not take any parameter. Example: public void Test.Class1.Test(). Additionally, if you are using async-await in test method then return-type must be Task. Example: public async Task Test.Class1.Test2()
de: UTA007: Die in der Klasse {0} definierte Methode {1} weist nicht die richtige Signatur auf. Die mit dem [TestMethod]-Attribut markierte Testmethode muss nicht statisch und öffentlich sein, muss den Rückgabetyp "void" aufweisen und darf keine Parameter annehmen. Beispiel: "public void Test.Class1.Test()". Wenn Sie "async-await" in der Testmethode verwenden, muss der Rückgabetyp außerdem "Task" sein. Beispiel: "public async Task Test.Class1.Test2()"
es: UTA007: El método {1} definido en la clase {0} no tiene una signatura correcta. El método de prueba marcado con el atributo [TestMethod] debe ser no estático, público, con el tipo devuelto void y no debe tomar ningún parámetro. Ejemplo: public void Test.Class1.Test(). Además, si está usando async-await en el método de prueba, el tipo devuelto debe ser Task. Ejemplo: public async Task Test.Class1.Test2()
fr: UTA007 : la méthode {1} définie dans la classe {0} ne dispose pas d'une signature correcte. Une méthode de test marquée avec l'attribut [TestMethod] doit être non statique, doit utiliser void pour return-type et ne doit pas accepter aucun paramètre. Exemple : public void Test.Class1.Test(). En outre, si vous utilisez async-await dans la méthode de test, return-type doit être Task. Exemple : public async Task Test.Class1.Test2()
tr: UTA007: {0} sınıfında tanımlanan {1} metodunun imzası doğru değil. [TestMethod] özniteliğiyle işaretlenen test metodu statik olmamalı, genel olmalı, return-type değeri void olmalı ve hiçbir parametre almamalıdır. Örnek: public void Test.Class1.Test(). Bunlara ek olarak, test metodunda async-await kullanıyorsanız return-type değeri Task olmalıdır. Örnek: public async Task Test.Class1.Test2()

# TestContextIsNull
source: TestContext cannot be Null.
de: "TestContext" darf nicht NULL sein.
es: TestContext no será null.
fr: TestContext ne peut pas être null.
tr: TestContext, Null olamaz.

# UTA_AssemblyCleanupMethodWasUnsuccesful
source: Assembly Cleanup method {0}.{1} failed. Error Message: {2}. StackTrace: {3}
de: Fehler bei der Methode "{0}.{1}" für die Assemblybereinigung. Fehlermeldung: {2}. "StackTrace": {3}
es: Error de método Cleanup de ensamblado {0}.{1}. Mensaje de error: {2}. StackTrace: {3}
fr: La méthode Cleanup d'assembly {0}.{1} a échoué. Message d'erreur : {2}. StackTrace : {3}
tr: Bütünleştirilmiş Kod Temizleme metodu ({0}.{1}) başarısız oldu. Hata İletisi: {2}. StackTrace: {3}

# UTA_AssemblyInitMethodThrows
source: Assembly Initialization method {0}.{1} threw exception. {2}: {3}. Aborting test execution.
de: Die Methode "{0}.{1}" für die Assemblyinitialisierung hat eine Ausnahme ausgelöst. {2}: {3}. Die Ausführung des Tests wird abgebrochen.
es: Excepción método inicialización ensamblado {0}.{1}. {2}: {3}. Anulada ejecución de prueba.
fr: La méthode d'assembly Initialization {0}.{1} a levé une exception. {2} : {3}. Abandon de l'exécution de tests.
tr: Bütünleştirilmiş Kod Başlatma metodu ({0}.{1}) özel durum oluşturdu. {2}: {3}. Test yürütmesi durduruluyor.

# UTA_ClassCleanupMethodWasUnsuccesful
source: Class Cleanup method {0}.{1} failed. Error Message: {2}. Stack Trace: {3}
de: Fehler bei der Methode "{0}.{1}" für die Klassenbereinigung. Fehlermeldung: {2}. Stapelüberwachung: {3}
es: Error de método Cleanup de clase {0}.{1}. Mensaje error: {2}. Seguimiento de pila: {3}
fr: La méthode de classe Cleanup {0}.{1} a échoué. Message d'erreur : {2}. Trace de la pile : {3}
tr: Sınıf Temizleme metodu ({0}.{1}) başarısız oldu. Hata İletisi: {2}. Yığın İzlemesi: {3}

# UTA_ClassInitMethodThrows
source: Class Initialization method {0}.{1} threw exception. {2}: {3}.
de: Die Methode "{0}.{1}" für die Klasseninitialisierung hat eine Ausnahme ausgelöst. {2}: {3}.
es: Excepción del método inicialización clase {0}. {1}. {2}: {3}.
fr: La méthode de classe Initialization {0}.{1} a levé une exception. {2} : {3}.
tr: Sınıf Başlatma metodu ({0}.{1}) özel durum oluşturdu. {2}: {3}.

# UTA_ExecuteThrewException
source: Exception thrown while executing test. If using extension of TestMethodAttribute then please contact vendor. Error message: {0}
de: Während der Ausführung des Tests wurde eine Ausnahme ausgelöst. Wenn Sie eine Extension von "TestMethodAttribute" verwenden, wenden Sie sich bitte an den Anbieter. Fehlermeldung: {0}
es: Se inició una excepción al ejecutar la prueba. Si usa la extensión de TestMethodAttribute, póngase en contacto con el proveedor. Mensaje de error: {0}
fr: Exception levée pendant l'exécution du test. Si vous utilisez l'extension de TestMethodAttribute, contactez le fournisseur. Message d'erreur : {0}
tr: Test yürütülürken özel durum oluşturuldu. TestMethodAttribute uzantısı kullanılıyorsa, lütfen satıcıya başvurun. Hata iletisi: {0}

# UTA_NoTestResult
source: Error in executing test. No result returned by extension. If using extension of TestMethodAttribute then please contact vendor.
de: Fehler beim Ausführen des Tests. Von der Extension wurde kein Ergebnis zurückgegeben. Wenn Sie eine Extension von "TestMethodAttribute" verwenden, wenden Sie sich bitte an den Anbieter.
es: No se pudo ejecutar prueba. Extensión no devolvió resultados. Si usa extensión TestMethodAttribute, contacte con el proveedor.
fr: Erreur lors de l'exécution du test. L'extension n'a retourné aucun résultat. Si vous utilisez l'extension de TestMethodAttribute, contactez le fournisseur.
tr: Test yürütülürken hata oluştu. Uzantı tarafından hiç sonuç döndürülmedi. TestMethodAttribute uzantısı kullanılıyorsa, lütfen satıcıya başvurun.

# UTA_ClassOrAssemblyCleanupMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be static, public, does not return a value and should not take any parameter. Additionally, if you are using async-await in method then return-type must be Task.
de: Die Methode "{0}.{1}" weist eine falsche Signatur auf. Die Methode muss statisch und öffentlich sein, gibt keinen Wert zurück und sollte keinen Parameter annehmen. Wenn Sie außerdem in der Methode "async-await" verwenden, muss der Rückgabetyp "Task" sein.
es: Método {0}.{1} tiene firma incorrecta. El método debe ser estático, público, no devolver un valor y no aceptar ningún parámetro. Además, si usa async-esperan en método de tipo de valor devuelto debe ser una tarea.
fr: La méthode {0}.{1} possède une signature incorrecte. La méthode doit être statique, publique et ne doit retourner aucune valeur ni accepter aucun paramètre. En outre, si vous utilisez async-await dans la méthode, return-type doit être Task.
tr: {0}.{1} metodunun imzası yanlış. Metot statik, genel, değer döndürmeyen bir metot olmalı, hiçbir parametre almamalıdır. Bunlara ek olarak, metotta async-await kullanıyorsanız return-type değeri Task olmalıdır.

# UTA_ClassOrAssemblyInitializeMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be static, public, does not return a value and should take a single parameter of type TestContext. Additionally, if you are using async-await in method then return-type must be Task.
de: Die Methode {0}.{1} weist eine falsche Signatur auf. Die Methode muss statisch und öffentlich sein, gibt keinen Wert zurück und sollte einen einzigen Parameter vom Typ "TestContext" annehmen. Wenn Sie außerdem in der Methode "async-await" verwenden, muss der Rückgabetyp "Task" sein.
es: Método {0}.{1} tiene firma incorrecta. El método debe ser estático y público, no devolver ningún valor y debe aceptar un solo parámetro tipo TestContext. Además, si está usando async-await en el método, el tipo devuelto debe ser Task.
fr: La méthode {0}.{1} possède une signature incorrecte. La méthode doit être statique, publique et ne doit retourner aucune valeur et accepter un seul paramètre de type TestContext. En outre, si vous utilisez async-await dans la méthode, return-type doit être Task.
tr: {0}.{1} metodunun imzası yanlış. Metot statik, genel, değer döndürmeyen bir metot olmalı ve TestContext türünde tek bir parametre almalıdır. Bunlara ek olarak, metotta async-await kullanıyorsanız return-type değeri Task olmalıdır.

# UTA_ErrorInvalidTimeout
source: UTA054: {0}.{1} has invalid Timeout attribute. The timeout must be a valid integer value and cannot be less than 0.
de: UTA054: "{0}.{1}" weist ein ungültiges Attribut "Timeout" auf. Das Timeout muss ein gültiger ganzzahliger Wert sein und darf nicht kleiner als 0 sein.
es: UTA054: atributo tiempo espera {0}.{1} no válido. Valor tiempo de espera debe ser entero válido y no menor que 0.
fr: UTA054 : {0}.{1} possède un attribut Timeout non valide. Timeout doit être une valeur entière valide, qui ne doit pas être inférieure à 0.
tr: UTA054: {0}.{1} geçersiz Timeout özniteliğine sahip. Zaman aşımı geçerli bir tamsayı değer olmalıdır ve 0'dan küçük olamaz.

# UTA_ErrorPredefinedTestProperty
source: UTA023: {0}: Cannot define predefined property {2} on method {1}.
de: UTA023: {0}: Die vordefinierte Eigenschaft "{2}" kann nicht für die Methode "{1}" definiert werden.
es: UTA023: {0}: no se puede definir la propiedad predefinida {2} en el método {1}.
fr: UTA023 : {0} : Impossible de définir la propriété prédéfinie {2} sur la méthode {1}.
tr: UTA023: {0}: Önceden tanımlanmış {2} özelliği {1} metodunda tanımlanamaz.

# UTA_ErrorTestPropertyAlreadyDefined
source: UTA022: {0}.{1}: The custom property "{2}" is already defined. Using "{3}" as value.
de: UTA022: {0}.{1}: Die benutzerdefinierte Eigenschaft "{2}" ist bereits definiert. "{3}" wird als Wert verwendet.
es: UTA022: {0}.{1}: ya definida propiedad personalizada "{2}". Usando "{3}" como valor.
fr: UTA022 : {0}.{1} : La propriété personnalisée "{2}" est déjà définie. Utilisation de "{3}" comme valeur.
tr: UTA022: {0}.{1}: "{2}" özel özelliği zaten tanımlanmış. Değer olarak "{3}" kullanılıyor.

# UTA_ErrorTestPropertyNullOrEmpty
source: UTA021: {0}: Null or empty custom property defined on method {1}. The custom property must have a valid name.
de: UTA021: {0}: Für die Methode "{1}" wurde eine benutzerdefinierte Eigenschaft mit dem Wert NULL oder eine benutzerdefinierte leere Eigenschaft definiert. Die benutzerdefinierte Eigenschaft muss einen gültigen Namen aufweisen.
es: UTA021: {0}: se ha definido una propiedad personalizada nula o vacía en el método {1}. La propiedad personalizada debe tener un nombre válido.
fr: UTA021 : {0} : Une propriété null ou vide personnalisée est définie sur la méthode {1}. La propriété personnalisée doit posséder un nom valide.
tr: UTA021: {0}: {1} metodunda null veya boş özel özellik tanımlanmış. Özel özellik geçerli bir ada sahip olmalıdır.

# UTA_MethodDoesNotExists
source: Method {0}.{1} does not exist.
de: Die Methode "{0}.{1}" ist nicht vorhanden.
es: El método {0}.{1} no existe.
fr: La méthode {0}.{1} n'existe pas.
tr: {0}.{1} metodu yok.

# UTA_NoDefaultConstructor
source: Unable to get default constructor for class {0}.
de: Der Standardkonstruktor für die Klasse "{0}" kann nicht abgerufen werden.
es: No se puede obtener el constructor predeterminado para la clase {0}.
fr: Impossible d'obtenir le constructeur par défaut de la classe {0}.
tr: {0} sınıfı için varsayılan oluşturucu alınamıyor.

# UTA_TestContextLoadError
source: Unable to find property {0}.TestContext. Error:{1}.
de: Die Eigenschaft "{0}.TestContext" wurde nicht gefunden. Fehler: {1}.
es: No se puede encontrar la propiedad {0}.TestContext. Error:{1}.
fr: Propriété {0}.TestContext introuvable. Erreur :{1}.
tr: {0}.TestContext özelliği bulunamıyor. Hata:{1}.

# UTA_TestContextTypeMismatchLoadError
source: The {0}.TestContext has incorrect type.
de: "{0}.TestContext" weist einen falschen Typ auf.
es: Tipo {0}.TestContext no es correcto.
fr: {0}.TestContext possède un type incorrect.
tr: {0}.TestContext yanlış türe sahip.
