Repository: microsoft/testfx
Catalog: src/Adapter/MSTest.CoreAdapter/Resources/xlf/Resource.*.xlf
Languages: de, es, fr, tr

# UTA_TestInitializeAndCleanupMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be non-static, public, does not return a value and should not take any parameter. Additionally, if you are using async-await in method then return-type must be Task.
de: Die Methode "{0}.{1}" weist eine falsche Signatur auf. Die Methode muss nicht statisch und öffentlich sein, gibt keinen Wert zurück und sollte keinen Parameter annehmen. Wenn Sie außerdem in der Methode "async-await" verwenden, muss der Rückgabetyp "Task" sein.
es: Método {0}.{1} tiene firma incorrecta. Debe ser un método no estático, público, no devolver ningún valor y no debe aceptar parámetros. Además, si está usando async-await en el método, el tipo devuelto debe ser Task.
fr: La méthode {0}.{1} possède une signature incorrecte. La méthode doit être non statique, publique et ne doit retourner aucune valeur ni accepter aucun paramètre. En outre, si vous utilisez async-await dans la méthode, return-type doit être Task.
tr: {0}.{1} metodunun imzası yanlış. Metot statik olmayan, genel, değer döndürmeyen bir metot olmalı, hiçbir parametre almamalıdır. Bunlara ek olarak, metotta async-await kullanıyorsanız return-type değeri Task olmalıdır.

# UTA_TypeLoadError
source: Unable to get type {0}. Error: {1}.
de: Der Typ "{0}" kann nicht abgerufen werden. Fehler: {1}.
es: No se puede obtener el tipo {0}. Error: {1}.
fr: Impossible d'obtenir le type {0}. Erreur : {1}.
tr: {0} türü alınamıyor. Hata: {1}.

# TestNotFound
source: Test method {0} was not found.
de: Die Testmethode "{0}" wurde nicht gefunden.
es: No encontrado método prueba {0}.
fr: Méthode de test {0} introuvable.
tr: {0} test metodu bulunamadı.

# DebugTraceBanner
source: Debug Trace:
de: Debugablaufverfolgung:
es: Seguimiento de depuración:
fr: Trace du débogage :
tr: Hata Ayıklama İzleyici:

# UTA_FailedToGetTestMethodException
source: Failed to obtain the exception thrown by test method {0}.{1}.
de: Fehler beim Abrufen der von der Testmethode "{0}.{1}" ausgelösten Ausnahme.
es: No se pudo obtener la excepción iniciada por el método de prueba {0}.{1}.
fr: Échec de l'obtention de l'exception levée par la méthode de test {0}.{1}.
tr: {0}.{1} metodu tarafından oluşturulan özel durum alınamadı.

# UTA_TestMethodThrows
source: Test method {0}.{1} threw exception: {2}
de: Die Testmethode "{0}.{1}" hat eine Ausnahme ausgelöst: {2}
es: Excepción método de prueba {0}.{1}: {2}
fr: La méthode de test {0}.{1} a levé une exception : {2}
tr: {0}.{1} test metodu özel durum oluşturdu: {2}

# UTA_WrongThread
source: {0}. If you are using UI objects in test consider using [UITestMethod] attribute instead of [TestMethod] to execute test in UI thread.
de: {0}. Wenn Sie UI-Objekte im Test verwenden, sollten Sie ggf. das [UITestMethod]-Attribut anstelle von "[TestMethod]" verwenden, um den Test im UI-Thread auszuführen.
es: {0}. Si usa objetos de interfaz de usuario en la prueba, podría usar el atributo [UITestMethod] en lugar de [TestMethod] para ejecutar la prueba en el subproceso de interfaz de usuario.
fr: {0}. Si vous utilisez des objets d'interface utilisateur dans un test, vous pouvez utiliser l'attribut [UITestMethod] au lieu de [TestMethod] pour exécuter le test dans le thread d'interface utilisateur.
tr: {0}. Teste UI nesneleri kullanıyorsanız, testi UI iş parçacığında yürütmek için [TestMethod] yerine [UITestMethod] özniteliğini kullanmayı deneyin.

# InvalidSettingsXmlAttribute
source: Invalid settings '{0}'. Unexpected XmlAttribute: '{1}'.
de: Ungültige Einstellungen "{0}". Unerwartetes XmlAttribute: "{1}".
es: Valor no válido '{0}'. XmlAttribute no esperado: '{1}'.
fr: Paramètres non valides '{0}'. XmlAttribute inattendu : '{1}'.
tr: Geçersiz '{0}' ayarları. Beklenmeyen XmlAttribute: '{1}'.

# InvalidSettingsXmlElement
source: Invalid settings '{0}'. Unexpected XmlElement: '{1}'.
de: Ungültige Einstellungen "{0}". Unerwartetes XmlElement: "{1}".
es: Valor no válido '{0}'. XmlElement no esperado: '{1}'.
fr: Paramètres non valides '{0}'. XmlElement inattendu : '{1}'.
tr: Geçersiz '{0}' ayarları. Beklenmeyen XmlElement: '{1}'.

# DataDrivenResultDisplayName
source: {0} (Data Row {1})
de: {0} (Datenzeile {1})
es: {0} (Fila de datos {1})
fr: {0} (ligne de données {1})
tr: {0} (Veri Satırı {1})

# UTA_ExpectedExceptionAttributeConstructionException
source: The ExpectedException attribute defined on test method {0}.{1} threw an exception during construction. {2}
de: Das für die Testmethode "{0}.{1}" definierte ExpectedException-Attribut hat während der Konstruktion eine Ausnahme ausgelöst. {2}
es: El atributo ExpectedException definido en el método de prueba {0}.{1} inició una excepción durante la construcción. {2}
fr: L'attribut ExpectedException défini dans la méthode de test {0}.{1} a levé une exception durant la construction. {2}
tr: {0}.{1} test yöntemi üzerinde tanımlanan ExpectedException özniteliği, oluşturma sırasında bir özel durum oluşturdu. {2}

# UTA_MultipleExpectedExceptionsOnTestMethod
source: The test method {0}.{1} has multiple attributes derived from ExpectedExceptionBaseAttribute defined on it. Only one such attribute is allowed.
de: Für die Testmethode "{0}.{1}" sind mehrere Attribute definiert, die von ExpectedExceptionBaseAttribute abgeleitet werden. Nur ein einziges solches Attribut ist zulässig.
es: El método de prueba {0}.{1} tiene definidos varios atributos derivados de ExpectedExceptionBaseAttribute. Solo se permite uno de estos atributos.
fr: Plusieurs attributs dérivés de ExpectedExceptionBaseAttribute sont définis dans la méthode de test {0}.{1}. Un seul attribut de ce type est autorisé.
tr: {0}.{1} test yöntemi, üzerinde tanımlanan ExpectedExceptionBaseAttribute öğesinden türetilmiş birden fazla öznitelik içeriyor. Bu türde yalnızca bir tane özniteliğe izin verilir.

# LegacyScenariosNotSupportedWarning
source: Warning : A testsettings file, a runsettings file with a ForcedLegacyMode set to true or a vsmdi file is not supported with the MSTest V2 Adapter.
de: Warnung: Eine testsettings-Datei, eine runsettings-Datei, für die ForcedLegacyMode auf TRUE festgelegt ist, oder eine VSMDI-Datei werden vom MSTest-V2-Adapter nicht unterstützt.
es: Advertencia: Un archivo testsettings o runsettings con el modo ForcedLegacyMode establecido en true o un archivo vsmdi no es compatible con el adaptador de MSTest V2.
fr: Avertissement : L'adaptateur MSTest V2 ne prend pas en charge les fichiers testsettings, les fichiers runsettings dans lequel ForcedLegacyMode a la valeur true, ou les fichiers vsmdi.
tr: Uyarı: Testsettings dosyaları, ForcedLegacyMode ayarı true olarak belirlenmiş runsettings dosyaları veya vsmdi dosyaları, MSTest V2 Bağdaştırıcısı ile desteklenmez.

# TestContextMessageBanner
source: TestContext Messages:
de: TestContext-Meldungen:
es: Mensajes de TestContext:
fr: Messages TestContext :
tr: TestContext İletileri:

# UTA_CleanupMethodThrowsGeneralError
source: Error calling Test Cleanup method for test class {0}: {1}
de: Fehler beim Aufruf der Testbereinigungsmethode für die Testklasse "{0}": {1}
es: Error al llamar al método Test Cleanup para la clase de prueba {0}: {1}
fr: Erreur lors de l'appel de la méthode Test Cleanup pour la classe de test {0} : {1}
tr: {0} test sınıfı için Test Temizleme metodu çağrılırken hata oluştu: {1}

# UTA_CleanupStackTrace
source: TestCleanup Stack Trace
de: TestCleanup-Stapelüberwachung
es: Seguimiento de pila de TestCleanup
fr: Trace de la pile TestCleanup
tr: TestCleanup Yığın İzleme

# TestParallelizationBanner
source: MSTest Executor: Test Parallelization enabled for {0} (Workers: {1}, Scope: {2}).
de: MSTest-Executor: Testparallelisierung für "{0}" aktiviert (Worker: {1}, Bereich: {2}).
es: Ejecutor de MSTest Executor: paralelización de prueba habilitada para {0} (Trabajadores: {1}, Ámbito: {2}).
fr: Exécuteur MSTest : parallélisation des tests activée pour {0} (threads de travail : {1}, portée : {2}).
tr: MSTest Yürütücü: {0} için Test Paralelleştirme etkin (Workers: {1}, Scope: {2}).

# InvalidParallelScopeValue
source: Invalid value '{0}' specified for 'Scope'. Supported scopes are {1}.
de: Ungültiger Wert "{0}" für "Scope" angegeben. Unterstützte Bereiche: {1}.
es: Valor no válido "{0}" especificado para "Ámbito". Los ámbitos admitidos son {1}.
fr: Valeur non valide '{0}' spécifiée pour la 'Portée'. Les portées prises en charge sont {1}.
tr: 'Scope' için geçersiz '{0}' değeri belirtildi. Desteklenen kapsamlar {1}.

# InvalidParallelWorkersValue
source: Invalid value '{0}' specified for 'Workers'. The value should be a non-negative integer.
de: Ungültiger Wert "{0}" für "Workers" angegeben. Der Wert muss eine nicht negative Ganzzahl sein.
es: Valor no válido "{0}" especificado para "Trabajadores". El valor debe ser un entero no negativo.
fr: Valeur non valide '{0}' spécifiée pour 'Workers'. La valeur doit être un entier non négatif.
tr: 'Workers' için geçersiz '{0}' değeri belirtildi. Değer negatif olmayan bir tamsayı olmalıdır.

# TestAssembly_AssemblyDiscoveryFailure
source: Failed to discover tests from assembly {0}. Reason:{1}
de: Fehler beim Ermitteln von Tests aus der Assembly "{0}". Ursache:{1}
es: No se pudieron detectar pruebas desde el ensamblado {0}. Motivo:{1}
fr: Échec de la découverte de tests à partir de l'assembly {0}. Raison :{1}
tr: {0} bütünleştirilmiş kodundan testler bulunamadı. Neden:{1}

# UTA_TestMethodExpectedParameters
source: Only data driven test methods can have parameters. Did you intend to use [DataRow] or [DynamicData]?
de: Nur datengesteuerte Testmethoden können Parameter aufweisen. Wollten Sie [DataRow] oder [DynamicData] verwenden?
es: Solo los métodos de pruebas controladas por datos pueden tener parámetros. ¿Quería usar [DataRow] o [DynamicData]?
fr: Seules les méthodes de test basées sur les données peuvent avoir des paramètres. Souhaitiez-vous utiliser [DataRow] ou [DynamicData] ?
tr: Yalnızca veri temelli test metotları parametrelere sahip olabilir. [DataRow] veya [DynamicData] kullanmak mı istediniz?
