Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TestInitializeShouldBeValidDescription
source: Methods marked with '[TestInitialize]' should follow the following layout to be valid: -it should be 'public' -it should not be 'abstract' -it should not be 'async void' -it should not be 'static' -it should not be a special method (finalizer, operator...). -it should not be generic -it should not take any parameter -return type should be 'void', 'Task' or 'ValueTask' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -If the class is 'sealed', it should be marked with '[TestClass]' (or a derived attribute).
cs: Aby byly metody s označením [TestInitialize] platné, musí se řídit následujícím rozložením: – Musí být public. – Nesmí být abstract. – Nesmí být async void. – Nesmí být static. – Nesmí být speciální metodou (finalizační metoda, operátor...). – Nesmí být obecné. – Nesmí přijímat žádný parametr. – Návratový typ musí být void, Task nebo ValueTask. Typ deklarující tyto metody by měl také respektovat následující pravidla: – Typ by měl být třída. – Třída by měla být public nebo internal (pokud testovací projekt používá atribut [DiscoverInternals]). – Třída by neměla být static. – Pokud je třída sealed, měla by být označena atributem [TestClass] (nebo odvozeným atributem).
de: Methoden, die mit „[TestInitialize]“ gekennzeichnet sind, müssen dem folgenden Layout folgen, um gültig zu sein: – muss „public“ sein – darf nicht „abstract“ sein – darf nicht „async void“ sein – darf nicht „static“ sein – darf keine spezielle Methode sein (Finalizer, Operator...) – darf nicht „generic“ sein – darf keinen Parameter annehmen – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein Der Typ, der diese Methoden deklariert, sollte auch die folgenden Regeln beachten: – Der Typ sollte eine Klasse sein. – Die Klasse muss „public“ oder „internal“ sein (wenn das Testprojekt das Attribut „[DiscoverInternals]“ verwendet) – Die Klasse darf nicht „static“ sein. – Wenn die Klasse „sealed“ ist, sollte sie mit „[TestClass]“ (oder einem abgeleiteten Attribut) markiert werden.
es: Los métodos marcados con '[TestInitialize]' deben seguir el siguiente diseño para ser válidos: - debería ser 'público' -no debe ser 'abstracta' - no debería ser 'async void' -no debe ser 'statico' -no debe ser un método especial (finalizador, operador...). -no debe ser genérico -no debe tomar ningún parámetro - El tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' El tipo que declara estos métodos también debe respetar las reglas siguientes: -El tipo debe ser una clase -La clase debe ser 'public' o 'internal' (si el proyecto de prueba usa el atributo '[DiscoverInternals]') -La clase no debe ser 'statico' -Si la clase es 'sealed', debe marcarse con '[TestClass]' (o un atributo derivado).
fr: Les méthodes marquées par [TestInitialize] doivent respecter le schéma suivant pour être valides : – il doit être « public » – il ne doit pas être « abstract » – il ne doit pas être « async void » – il ne devrait pas être « static » – Il ne doit pas s’agir d’une méthode spéciale (finaliseur, opérateur...). – il ne doit pas être générique – il ne doit accepter aucun paramètre - le type de retour doit être « vide », « Task » ou « ValueTask » Le type déclarant ces méthodes doit également respecter les règles suivantes : Le type doit être une classe -La classe doit être « public » ou « internal » (si le projet de test utilise l’attribut ’[DiscoverInternals]’) -La classe ne doit pas être» ’static » -Si la classe est « sealed », elle doit être marquée avec « [TestClass] » (ou un attribut dérivé).
it: I metodi contrassegnati con ‘[TestInitialize]’ devono seguire il layout seguente per essere validi: - Deve essere 'public' - Non deve essere 'abstract' - Non deve essere 'async void' - Non deve essere 'static' - Non deve essere un metodo speciale (finalizzatore, operatore...). - Non deve essere generico - Non deve accettare alcun parametro - il tipo restituito deve essere 'void', 'Task' o 'ValueTask' Anche il tipo che dichiara questi metodi deve rispettare le regole seguenti: -Il tipo deve essere una classe -La classe deve essere 'public' o 'internal' (se il progetto di test usa l'attributo '[DiscoverInternals]') -La classe non deve essere 'static' -Se la classe è 'sealed', deve essere contrassegnata con '[TestClass]' (o un attributo derivato).
ja: '[TestInitialize]' でマークされたメソッドを有効にするには、次のレイアウトに従う必要があります: - 'public' である必要があります - 'abstract' にすることはできません - 'async void' にすることはできません - 'static' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。 - ジェネリックにすることはできません - パラメーターを受け取ることができません - 戻り値の型が 'void'、'Task'、または 'ValueTask' である必要があります これらのメソッドを宣言する型も、次の規則に従う必要があります: - 型はクラスである必要があります - クラスは 'public' または 'internal' である必要があります (テスト プロジェクトが '[DiscoverInternals]' 属性を使用している場合) - クラスを 'static' にすることはできません -クラスが 'sealed' の場合は、'[TestClass]' (または派生属性) でマークする必要があります。
ko: '[TestInitialize]'로 표시된 메서드가 유효하려면 다음 레이아웃을 따라야 합니다. - 'public'이어야 합니다. - 'abstract'가 아니어야 합니다. - 'async void'가 아니어야 합니다. - 'static'이 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다. - 제네릭이 아니어야 합니다. - 매개 변수를 사용하지 않아야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. 이러한 메서드를 선언하는 형식은 다음 규칙도 준수해야 합니다. -형식은 클래스여야 합니다. -클래스는 'public' 또는 'internal'이어야 합니다(테스트 프로젝트에서 '[DiscoverInternals]' 특성을 사용하는 경우). -클래스는 'static'이 되어서는 안 됩니다. -클래스가 'sealed'인 경우 '[TestClass]'(또는 파생 특성)로 표시되어야 합니다.
pl: Metody oznaczone znakiem „[TestInitialize]” powinny być zgodne z następującym układem, aby były prawidłowe: — powinna być typu „public” — nie powinna być typu „abstract” — nie powinna to być wartość „async void” — nie powinna być typu „static” — nie powinna to być metoda specjalna (finalizator, operator...). — nie powinna być ogólna — nie powinna przyjmować żadnego parametru — zwracany typ powinien mieć wartość „void”, „Taks” lub „ValueTask” Typ deklarujący te metody powinien również przestrzegać następujących reguł: — Typ powinien być klasą — Klasa powinna mieć wartość „public” lub „internal” (jeśli projekt testowy używa atrybutu „[DiscoverInternals]”) — Klasa nie powinna mieć wartości „static” — Jeśli klasa jest zapieczętowana, powinna być oznaczona znakiem „[TestClass]” (lub atrybutem pochodnym).
pt_br: Os métodos marcados com '[TestInitialize]' devem seguir o seguinte layout para serem válidos: -devem ser "públicos" -não devem ser “abstratos” -não devem ser "nulos assíncronos" -não devem ser "estáticos" -não devem ser um método especial (finalizador, operador...). -não devem ser genéricos -não devem usar nenhum parâmetro -o tipo de retorno deve ser “nulo”, “Tarefa” ou “ValueTask” O tipo que declara esses métodos também deve respeitar as seguintes regras: -O tipo deve ser uma classe -A classe deve ser “público” ou '”interno” (se o projeto de teste estiver usando o atributo “[DiscoverInternals]”) -A classe não deve ser “estático” -Se a classe for “selado”, ela deverá ser marcada com “[TestClass]” (ou um atributo derivado).
ru: Чтобы метод, помеченный "[TestInitialize]", был допустимым, он должен соответствовать следующим правилам: – быть общедоступным ("public") ; – не быть абстрактным ("abstract") ; – не быть асинхронным и не возвращающим значения ("async void") – не быть статическим ("static") – не быть специальным (метод завершения, оператор…). – не быть общим ("generic") ; – не принимать никаких параметров; – тип возвращаемого значения должен быть "void", "Task" или "ValueTask"; Тип, объявляющий такие методы, также должен соответствовать следующим правилам: – должен быть классом; – класс должен быть объявлен как "public" или "internal" (если тестовый проект использует атрибут "[DiscoverInternals]"); – не должен быть статическим ("static"); – если класс запечатанный, его следует пометить как "[TestClass]" (или производный атрибут).
tr: '[TestInitialize]' ile işaretlenen yöntemlerin geçerli olması için aşağıdaki düzeni izlemesi gerekir: -'public' olmalıdır - 'abstract' olmamalıdır -'async void' olmamalıdır -'static' olmamalıdır -özel bir yöntem (sonlandırıcı, işleç...) olmamalıdır. - genel olmamalıdır - herhangi bir parametre almamalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalı Bu yöntemleri bildiren tipin ayrıca aşağıdaki kurallara uyması gerekir: -Tür bir sınıf olmalıdır --Sınıf 'public' veya 'internal' olmalıdır (test projesi '[DiscoverInternals]' niteliğini kullanıyorsa) -Sınıf 'static' olmamalıdır -Sınıf 'sealed' ise '[TestClass]' (veya türetilmiş bir öznitelik) ile işaretlenmelidir.
zh_hans: 标记有“[TestInitialize]”的方法应遵循以下布局才会有效: - 它应为“public” - 它不应为“abstract” - 它不应为“async void” - 它不应为“static” - 它不应是特殊方法(终结器、运算符...)。 - 它不应是泛型的 - 它不应采用任何参数 - 返回类型应为“void”、“Task”或“ValueTask” 声明这些方法的类型还应遵循以下规则: -类型应为类 -类应为“public”或“internal”(如果测试项目正在使用“[DiscoverInternals]”属性) -类不应为“static” -如果类为“sealed”，则应使用“[TestClass]”(或派生属性)标记该类。
zh_hant: 標示為 '[TestInitialize]' 的方法應該遵循下列配置才能有效: - 其應為 'public' - 其不應為 'abstract' - 其不應為 'async void' - 其不應為 'static' - 其不應為特殊方法 (完成項、運算子...)。 - 其不應為泛型 - 其不應接受任何參數 - 傳回類型應為 'void'、'Task' 或 'ValueTask' 宣告這些方法的類型還應遵循以下規則: -類型應為類別 -類別應為 'public' 或 'internal' (如果測試專案使用 '[DiscoverInternals]' 屬性) -類別不應為 'static' -如果類別是 'sealed'，則應標示為 '[TestClass]' (或衍生屬性)。

# TestInitializeShouldBeValidMessageFormat
source: TestInitialize method '{0}' signature is invalid
cs: Signatura „{0}“ metody TestInitialize je neplatná
de: Signatur der TestInitialize-Methode "{0}" ist ungültig
es: La signatura "{0}" del método TestInitialize no es válida
fr: La signature de la méthode TestInitialize '{0}' n’est pas valide
it: La firma del metodo TestInitialize '{0}' non è valida
ja: TestInitialize メソッド '{0}' シグネチャが無効です
ko: TestInitialize 메서드 '{0}' 시그니처가 잘못되었습니다.
pl: Podpis metody TestInitialize „{0}” jest nieprawidłowy
pt_br: A assinatura do método TestInitialize "{0}" é inválida
ru: Подпись метода TestInitialize "{0}" недопустима
tr: TestInitialize yöntemi '{0}' imzası geçersiz
zh_hans: TestInitialize 方法“{0}”签名无效
zh_hant: TestInitialize 方法 '{0}' 簽章無效

# TestInitializeShouldBeValidTitle
source: TestInitialize method should have valid layout
cs: Metoda TestInitialize by měla mít platné rozložení
de: Die TestInitialize-Methode muss über ein gültiges Layout verfügen.
es: El método TestInitialize debería tener un diseño válido
fr: La méthode TestInitialize doit avoir une disposition valide
it: Il metodo TestInitialize deve avere un layout valido
ja: TestInitialize メソッドには有効なレイアウトが必要です
ko: TestInitialize 메서드에는 유효한 레이아웃이 있어야 합니다.
pl: Metoda TestInitialize powinna mieć prawidłowy układ
pt_br: O método de TestInitialize deve ter um layout válido
ru: Метод TestInitialize должен использовать допустимый макет
tr: TestInitialize yöntemi geçerli bir düzene sahip olmalıdır
zh_hans: TestInitialize 方法应具有有效的布局
zh_hant: TestInitialize 方法應具備有效的配置

# TestMethodShouldBeValidDescription
source: Test methods, methods marked with the '[TestMethod]' attribute, should respect the following layout to be considered valid by MSTest: - it should be 'public' (or 'internal' if '[assembly: DiscoverInternals]' attribute is set) - it should not be 'static' - it should may be generic as long as type parameters can be inferred and argument types are compatible - it should not be 'abstract' - return type should be 'void', 'Task' or 'ValueTask' - it should not be 'async void' - it should not be a special method (finalizer, operator...).
cs: Testovací metody (metody označené atributem [TestMethod]) by měly respektovat následující rozložení, které MSTest považuje za platné: – musí být public (nebo internal, pokud je nastaven atribut [assembly: DiscoverInternals]), – musí být static, – můžou být obecné, pokud lze odvodit parametry typu a typy argumentů jsou kompatibilní – nesmí být abstract, – návratový typ by měl být void, Task nebo ValueTask, – nesmí být async void, – nesmí být speciální metodou (finalizační metoda, operátor...).
de: Testmethoden, Methoden, die mit dem Attribut „[TestMethod]“ gekennzeichnet sind, sollten das folgende Layout berücksichtigen, um von MSTest als gültig angesehen zu werden: – es darf „public“ (oder „internal“ sein, wenn das Attribut „[assembly: DiscoverInternals]“ festgelegt ist) – es darf nicht „static“ sein – es kann generisch sein, solange Typparameter abgeleitet werden können und Argumenttypen kompatibel sind – es darf nicht „abstract“ sein – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein – es darf nicht „async void“ sein – es darf keine spezielle Methode (Finalizer, Operator...) sein.
es: Los métodos de prueba, los métodos marcados con el atributo '[TestMethod]', deben respetar el siguiente diseño para que MSTest lo considere válido: - debe ser 'public' (o 'internal' si se establece el atributo '[assembly: DiscoverInternals]') - no debe ser 'static' - puede ser genérico siempre y cuando se puedan inferir parámetros de tipo y los tipos de argumento sean compatibles - no debe ser 'abstract' - el tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' - no debe ser 'async void' - no debe ser un método especial (finalizador, operador...).
fr: Les méthodes de test, c’est-à-dire les méthodes marquées de l’attribut « [TestMethod] », doivent respecter la disposition suivante pour être considérées comme valides par MSTest : – elle doit être « publique » (ou « interne » si l’attribut « [assembly : DiscoverInternals] » est défini) – elle ne doit pas être « statique » – elle peut être générique tant que les paramètres de type peuvent être déduits et que les types d’arguments sont compatibles – il ne doit pas être « abstract » – le type de retour doit être « void », « Task » ou « ValueTask » – elle ne doit pas être « async void » – elle ne doit pas être une méthode spéciale (finaliseur, opérateur...).
it: I metodi di test, metodi contrassegnati con l'attributo '[TestMethod]', devono rispettare il layout seguente per essere considerati validi da MSTest: - devono essere “public” (o “internal” se l'attributo “[assembly: DiscoverInternals]” è impostato) - non devono essere “static” - possono essere generici purché i parametri di tipo possano essere dedotti e i tipi di argomento siano compatibili - non devono essere “abstract” - il tipo restituito deve essere “void”, “Task” o “ValueTask” - non devono essere “async void” - non devono essere un metodo speciale (finalizzatore, operatore...).
ja: '[TestMethod]' 属性でマークされたテスト メソッドは、MSTest によって有効と見なされるように、次のレイアウトを考慮する必要があります: - 'public' である必要があります ('[assembly: DiscoverInternals]' 属性が設定されている場合は 'internal' である必要があります) - 'static' にすることはできません - 型パラメーターを推論でき、引数の型が互換性がある限り、ジェネリックである必要があります - 'abstract' にすることはできません - 戻り値の型は 'void'、'Task'、または 'ValueTask' である必要があります - 'async void' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。
pl: Metody testowe, czyli metody oznaczone atrybutem „[TestMethod]”, powinny uwzględniać następujący układ, aby platforma MSTest uznała je za prawidłowe: — powinny mieć wartość „public” (lub „internal”, jeśli ustawiono atrybut „[assembly: DiscoverInternals]”) — nie powinny mieć wartości „static” — mogą być ogólne, o ile można wywnioskować parametry typu i typy argumentów są zgodne — nie powinny mieć wartości „abstract” — zwracany typ powinien mieć wartość „void”, „Task” lub „ValueTask” — nie powinny mieć wartości „async void” — nie powinny być metodą specjalną (finalizator, operator...).
pt_br: Os métodos de teste, métodos marcados com o atributo '[TestMethod]', devem respeitar o seguinte layout para que sejam considerados válidos pelo MSTest: - deve ser "público" (ou "interno" se o atributo "[assembly: DiscoverInternals]" estiver definido) - não pode ser ''estático'' - ele deve ser genérico, desde que os parâmetros de tipo possam ser inferidos e os tipos de argumentos sejam compatíveis - não pode ser ''abstrato'' - o tipo de retorno deve ser 'nulo', 'Tarefa' ou 'ValueTask' - não pode ser ''nulo assíncrono'' — não deve ser um método especial (finalizador, operador...).
ru: Методы теста (методы, помеченные атрибутом "[TestMethod]") должны соблюдать следующую структуру, чтобы считаться допустимыми в MSTest: – должно быть присвоено значение "public" (или "internal", если задан атрибут "[assembly: DiscoverInternals]") – не следует присваивать значение "static" – могут быть универсальными, если можно вывести параметры типа, а типы аргументов являются совместимыми – не следует присваивать значение "abstract" – возвращаемый тип должен быть "void", "Task" или "ValueTask" – не следует присваивать значение "async void" – это должен быть специальный метод (метод завершения, оператор...).
tr: '[TestMethod]' özniteliğiyle işaretlenen test yöntemleri, MSTest: tarafından geçerli kabul edilebilmesi için aşağıdaki düzene uygun olacak şekilde düzenlenmelidir - 'public' (veya '[assembly: DiscoverInternals]' özniteliği ayarlanmışsa 'internal') olmalıdır - 'static' olmamalıdır - Tür parametreleri çıkarsandıkça ve bağımsız değişken türleri uyumlu olduğu sürece genel olmalıdır - 'abstract' olmamalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalıdır - 'async void' olmamalıdır - özel bir yöntem (sonlandırıcı, işleç...) olmamalıdır.
zh_hans: 测试方法(标记有 "[TestMethod]" 属性的方法)应遵循以下布局，以便 MSTest 将其视为有效: - 它应该是 "public" (如果设置了 "[assembly: DiscoverInternals]" 属性，则应该是 "internal") - 它不应为 "static" - 只要可以推断类型参数并且参数类型兼容，它就应该是泛型 - 它不应为 "abstract" - 返回类型应为 "void”、"Task" 或 "ValueTask" - 它不应为 "async void" - 它不应是特殊方法(终结器、运算符...)。
zh_hant: 測試方法 (標示為 '[TestMethod]' 屬性的方法) 應該遵循下列配置，讓 MSTest 視為有效: - 它應該是 'public' (如果設定 '[assembly: DiscoverInternals]' 屬性，則為 'internal') - 它應該是 'static' - 只要可以推斷類型參數且引數類型相容，則其應為一般 - 它不能是 'abstract' - 傳回型別應為 'void'、'Task' 或 'ValueTask' - 它不能是 'async void' - 它不應該是特殊方法 (完成項、運算子...)。

# TestMethodShouldBeValidTitle
source: Test methods should have valid layout
cs: Testovací metody by měly mít platné rozložení.
de: Testmethoden müssen über ein gültiges Layout verfügen.
es: Los métodos de prueba deben tener un diseño válido
fr: Les méthodes de test doivent avoir une disposition valide
it: I metodi di test dovrebbero avere un layout valido
ja: テスト メソッドには有効なレイアウトが必要です
ko: 테스트 메서드에는 유효한 레이아웃이 있어야 합니다.
pl: Metody testowe powinny mieć prawidłowy układ
pt_br: Os métodos de teste devem ter um layout válido
ru: Методы теста должны использовать допустимую структуру
tr: Test yöntemleri geçerli bir düzene sahip olmalıdır
zh_hans: 测试方法应具有有效的布局
zh_hant: 測試方法應具備有效的配置

# TestMethodShouldNotBeIgnoredAnalyzerDescription
source: Test methods should not be ignored (marked with '[Ignore]').
cs: Testovací metody by se neměly ignorovat (označené jako „[Ignorovat]“.
de: Testmethoden dürfen nicht ignoriert werden (mit "[Ignore]" gekennzeichnet).
es: Los métodos de prueba no deberían ignorarse (marcarse con '[Ignorar]').
fr: Les méthodes de test ne doivent pas être ignorées (marquées avec « [Ignorer] »).
it: I metodi di test non devono essere ignorati (contrassegnati con '[Ignora]').
ja: テスト メソッドを無視することはできません ('[Ignore]' でマークされます)。
ko: 테스트 메서드는 무시하면 안 됩니다('[무시]'로 표시됨).
pl: Metody testowe nie powinny być ignorowane (oznaczone wyrażeniem „[Ignoruj]”).
pt_br: Os métodos de teste não devem ser ignorados (marcados com "[Ignorar]").
ru: Методы теста не должны игнорироваться (помечаться с помощью "[Ignore]").
tr: Test metotları yoksaymamalıdır ('[Ignore]' olarak işaretli).
zh_hans: 不应忽略测试方法(标记有 "[Ignore]")。
zh_hant: 不應略過測試方法 (標示為 '[Ignore]')。

# TestMethodShouldNotBeIgnoredAnalyzerFormat
source: Test method '{0}' should not be ignored
cs: Testovací metoda „{0}“ by se neměla ignorovat
de: Die Testmethode "{0}" darf nicht ignoriert werden.
es: El método de prueba '{0}' no debería ignorarse
fr: La méthode de test « {0} » ne doit pas être ignorée
it: Il metodo di test '{0}' non deve essere ignorato
ja: テスト メソッド '{0}' を無視することはできません
ko: 테스트 메서드 '{0}'을(를) 무시하면 안 됩니다.
pl: Metoda testowa „{0}” nie powinna być ignorowana
pt_br: O método de teste "{0}" não deve ser ignorado
ru: Метод теста "{0}" не должен игнорироваться
tr: Test metodu '{0}' yoksayılmamalıdır
zh_hans: 不应忽略测试方法“{0}”
zh_hant: 不應略過測試方法 '{0}'

# TestMethodShouldNotBeIgnoredAnalyzerTitle
source: Test method should not be ignored
cs: Testovací metoda by se neměla ignorovat.
de: Die Testmethode darf nicht ignoriert werden.
es: El método de prueba no debería ignorarse
fr: La méthode de test doit être ignorée
it: Il metodo di test non deve essere ignorato
ja: テスト メソッドを無視することはできません
ko: 테스트 메서드는 무시하면 안 됩니다.
pl: Metoda testowa nie powinna być ignorowana
pt_br: O método de teste não deve ser ignorado
ru: Метод теста не должен игнорироваться
tr: Test metodu yoksayılmamalıdır
zh_hans: 不应忽略测试方法
zh_hant: 不應略過測試方法

# TypeContainingTestMethodShouldBeATestClassDescription
source: Type containing '[TestMethod]' should be marked with '[TestClass]', otherwise the test method will be silently ignored.
cs: Typ obsahující [TestMethod] by měl mít označení [TestClass], jinak se bude testovací metoda bez upozornění ignorovat.
de: Der Typ, der „[Testmethode]“ enthält, sollte mit „[Testklasse]“ gekennzeichnet werden, andernfalls wird die Testmethode still im Hintergrund ignoriert.
es: El tipo que contiene '[TestMethod]' debe marcarse con '[TestClass]'; de lo contrario, el método de prueba se omitirá de forma silenciosa.
fr: Le type contenant « [TestMethod] » doit être marqué avec « [TestClass] », sans quoi la méthode de test sera ignorée silencieusement.
it: Il tipo contenente '[TestMethod]' deve essere contrassegnato con '[TestClass]', altrimenti il metodo di test verrà ignorato automaticamente.
ja: '[TestMethod]' を含む型は '[TestClass]' でマークする必要があります。そうしないとテスト メソッドは暗黙的に無視されます。
pl: Typ zawierający element „[TestMethod]” powinien być oznaczony znakiem „[TestClass]”. W przeciwnym razie metoda testowa zostanie zignorowana w trybie dyskretnym.
pt_br: O tipo que contém '[TestMethod]' deve ser marcado com '[TestClass]', caso contrário, o método de teste será ignorado sem aviso.
ru: У типа, содержащего "[TestMethod]", должна быть пометка "[TestClass]", иначе метод тестирования будет проигнорирован без уведомления пользователя.
tr: '[TestMethod]' içeren tür '[TestClass]' ile işaretlenmeli, aksi takdirde test yöntemi sessizce yoksayılır.
zh_hans: 应使用 "[TestClass]" 标记包含 "[TestMethod]" 的类型，否则将以静默方式忽略该测试方法。
zh_hant: 包含 '[TestMethod]' 的類型應標記為 '[TestClass]'，否則將以無訊息的方式忽略測試方法。

# TypeContainingTestMethodShouldBeATestClassMessageFormat
source: Type '{0}' contains test methods and should be marked with '[TestClass]'
cs: Třída {0} obsahuje testovací metody a měla by mít označení [TestClass].
de: Der Typ „{0}“ enthält Testmethoden und sollte mit „[TestClass]“ gekennzeichnet werden
es: El tipo '{0}' contiene métodos de prueba y debe marcarse con '[TestClass]'
fr: Le type « {0} » contient des méthodes de test et doit être marquée avec « [TestClass] »
it: Il tipo '{0}' contiene metodi di test e deve essere contrassegnato come '[TestClass]'
ja: 型 '{0}' にはテスト メソッドが含まれており、'[TestClass]' でマークする必要があります
pl: Typ „{0}” zawiera metody testowe i powinien być oznaczony znakiem „[TestClass]”
pt_br: O tipo '{0}' contém métodos de teste e deve ser marcado com '[TestClass]'
ru: Тип "{0}" содержит тестовые методы и должен быть помечен как "[TestClass]"
tr: '{0}' türü test yöntemleri içeriyor ve '[TestClass]' ile işaretlenmeli
zh_hans: 类型 "{0}" 包含测试方法，应使用 "[TestClass]" 进行标记
zh_hant: 類型 '{0}' 包含測試方法，應以 '[TestClass]' 標記
