Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DynamicDataShouldBeValidMessageFormat_MemberType
source: '[DynamicData]' referenced member '{0}.{1}' should return 'IEnumerable<object[]>', 'IEnumerable<Tuple>` or 'IEnumerable<ValueTuple>'
cs: Odkazovaný člen [DynamicData] {0}.{1} by měl vracet IEnumerable<object[]>, IEnumerable<Tuple> nebo IEnumerable<ValueTuple>.
de: "[DynamicData]"-Element "{0}.{1}" muss "IEnumerable"<"object[]>", "IEnumerable<Tuple>" oder "IEnumerable<ValueTuple>" zurückgeben.
es: El miembro '{0}.{1}' de '[DynamicData]' al que se hace referencia debe devolver 'IEnumerable<object[]>', 'IEnumerable<Tuple>' o 'IEnumerable<ValueTuple>'
fr: Le membre référencé « [DynamicData] '{0}.{1}' doit renvoyer « IEnumerable<object[]> », « IEnumerable<Tuple> » ou « IEnumerable<ValueTuple> »
it: Il membro di riferimento '[DynamicData]' '{0}.{1}' deve restituire 'IEnumerable<object[]>', 'IEnumerable<Tuple>' o 'IEnumerable<ValueTuple>'
ja: '[DynamicData]' の参照されるメンバー '{0}.{1}' は、'IEnumerable<object[]>'、'IEnumerable<Tuple>`、'IEnumerable<ValueTuple>' のいずれかを返す必要があります
ko: '[DynamicData]'이(가) '{0} 멤버를 참조했습니다.{1}'은(는) 'IEnumerable<object[]>', 'IEnumerable<Tuple>' 또는 'IEnumerable<ValueTuple>'을 반환해야 합니다.
pl: Przywołany element członkowski „{0}.{1}” „[DynamicData]” powinien zwrócić „IEnumerable<object[]>”, „IEnumerable<Tuple>” lub „IEnumerable<ValueTuple>”
pt_br: O membro referenciado "{0}.{1}" de "[DynamicData]" deve retornar "IEnumerable<object[]>", "IEnumerable<Tuple>" ou "IEnumerable<ValueTuple>"
ru: Элемент "[DynamicData]" "{0}.{1}" должен возвращать "IEnumerable<object[]>", "IEnumerable<Tuple>" или "IEnumerable<ValueTuple>"
tr: '[DynamicData]' başvurulan üyesi '{0}.{1}' şu değerleri döndürmelidir: 'IEnumerable<object[]>', 'IEnumerable<Tuple>` veya 'IEnumerable<ValueTuple>'
zh_hans: "[DynamicData]" 引用的成员 "{0}.{1}" 应返回 "IEnumerable<object[]>"、"IEnumerable<Tuple>" 或 "IEnumerable<ValueTuple>"
zh_hant: '[DynamicData]' 參考成員 '{0}.{1}' 應傳回 'IEnumerable<object[]>', 'IEnumerable<Tuple>` or 'IEnumerable<ValueTuple>'

# DynamicDataShouldBeValidMessageFormat_OnTestMethod
source: '[DynamicData]' should only be set on a test method
cs: Položka [DynamicData] by měla být nastavená jenom u testovací metody.
de: "[DynamicData]" sollte nur für eine Testmethode festgelegt werden.
es: '[DynamicData]' solo debe establecerse en un método de prueba
fr: '[DynamicData]' ne doit être défini que sur une méthode de test
it: '[DynamicData]' deve essere impostato solo su un metodo di test
ja: '[DynamicData]' はテスト メソッドでのみ設定する必要があります
ko: '[DynamicData]'는 테스트 메서드에서만 설정해야 합니다.
pl: „[DynamicData]” należy ustawić tylko dla metody testowej
pt_br: "[DynamicData]" só deve ser definido em um método de teste
ru: "[DynamicData]" следует задавать только для метода теста
tr: '[DynamicData]' yalnızca bir test yönteminde ayarlanmalıdır
zh_hans: 应仅对测试方法设置 "[DynamicData]"
zh_hant: [DynamicData]' 只能在測試方法上設定

# DynamicDataShouldBeValidMessageFormat_SourceTypeField
source: '[DynamicData]' member '{0}.{1}' is a field so you should use 'DynamicDataSourceType.AutoDetect' or 'DynamicDataSourceType.Field' (auto detect is the default when not specified explicitly, and is recommended)
pl: Składowa „[DynamicData]” „{0}.{1}” jest polem, dlatego należy użyć elementu „DynamicDataSourceType.AutoDetect” lub „DynamicDataSourceType.Field” (wykrywanie automatyczne jest ustawieniem domyślnym, gdy nie zostanie jawnie określone i jest zalecane)
zh_hant: '[DynamicData]' 成員 '{0}.{1}' 是欄位，因此您應該使用 'DynamicDataSourceType.AutoDetect' 或 'DynamicDataSourceType.Field' (未明確指定時，自動偵測為預設值，建議使用)

# DynamicDataShouldBeValidMessageFormat_SourceTypeMethod
source: '[DynamicData]' member '{0}.{1}' is a method so you should use 'DynamicDataSourceType.AutoDetect' or 'DynamicDataSourceType.Method' (auto detect is the default when not specified explicitly, and is recommended)
cs: '[DynamicData]' člen {0}.{1} je metoda, takže byste měli použít DynamicDataSourceType.AutoDetect nebo DynamicDataSourceType.Method (automatické zjišťování je výchozí, pokud není explicitně zadáno, a doporučuje se)
de: '[DynamicData]' Member "{0}.{1}" ist eine Methode, daher sollten Sie "DynamicDataSourceType.AutoDetect" oder "DynamicDataSourceType.Method" verwenden (die automatische Erkennung ist der Standardwert, wenn sie nicht explizit angegeben wird und empfohlen wird).
es: '[DynamicData]' miembro '{0}.{1}' es un método, por lo que debe usar 'DynamicDataSourceType.AutoDetect' o 'DynamicDataSourceType.Method' (la detección automática es el valor predeterminado cuando no se especifica explícitamente y se recomienda)
fr: '[DynamicData]' membre ' {0}.{1}' est une méthode, vous devez donc utiliser 'DynamicDataSourceType.AutoDetect' ou 'DynamicDataSourceType.Method' (la détection automatique est la valeur par défaut quand elle n’est pas spécifiée explicitement et est recommandée)
it: '[DynamicData]' membro '{0}.{1}' è un metodo, quindi è consigliabile usare 'DynamicDataSourceType.AutoDetect' o 'DynamicDataSourceType.Method'. Il rilevamento automatico è l'impostazione predefinita quando non è specificata in modo esplicito ed è consigliabile
ja: '[DynamicData]' メンバー '{0}.{1}' はメソッドであるため、'DynamicDataSourceType.AutoDetect' または 'DynamicDataSourceType.Method' を使用する必要があります (自動検出は明示的に指定されていない場合の既定値であり、推奨されます)
pl: '[DynamicData]' składowej "{0}.{1}" jest metodą, dlatego należy użyć elementu "DynamicDataSourceType.AutoDetect" lub "DynamicDataSourceType.Method" (autowykrywanie jest domyślne, gdy nie zostało jawnie określone i jest zalecane)
pt_br: '[DynamicData]' membro '{0}.{1}' é um método, portanto, você deve usar 'DynamicDataSourceType.AutoDetect' ou 'DynamicDataSourceType.Method' (detectar automaticamente é o padrão quando não especificado explicitamente e é recomendado)
ru: '[DynamicData]' "{0}.{1}" является методом, поэтому следует использовать "DynamicDataSourceType.AutoDetect" или "DynamicDataSourceType.Method" (автообнаружение используется по умолчанию, если не указано явно, и рекомендуется)
tr: '[DynamicData]' üyesi '{0}.{1}' bir metot olduğundan 'DynamicDataSourceType.AutoDetect' veya 'DynamicDataSourceType.Method' kullanmalısınız (otomatik algılama açıkça belirtilmediğinden varsayılandır ve önerilir)
zh_hans: '[DynamicData]' 成员 “{0}.{1}” 是一个方法，因此应使用 “DynamicDataSourceType.AutoDetect” 或 “DynamicDataSourceType.Method”，(未显式指定时，自动检测为默认值，建议)
zh_hant: '[DynamicData]' 成員 '{0}.{1}' 是方法，因此您應該使用 'DynamicDataSourceType.AutoDetect' 或 'DynamicDataSourceType.Method' (未明確指定時，自動偵測是預設值，建議)

# DynamicDataShouldBeValidMessageFormat_SourceTypeNotPropertyMethodOrField
source: '[DynamicData]' member '{0}.{1}' is not a property, method, or field. Only properties, methods, and fields are supported.
pl: Składowa „[DynamicData]” „{0}.{1}” nie jest właściwością, metodą ani polem. Obsługiwane są tylko właściwości, metody i pola.
zh_hant: '[DynamicData]' 成員 '{0}.{1}' 不是屬性、方法或欄位。僅支援屬性、方法和欄位。

# DynamicDataShouldBeValidMessageFormat_SourceTypeNotPropertyOrMethod
source: '[DynamicData]' member '{0}.{1}' is not a property nor a method. Only properties and methods are supported.
cs: '[DynamicData]' člen {0}.{1} není vlastnost ani metoda. Jsou podporovány pouze vlastnosti a metody.
de: '[DynamicData]' Member "{0}.{1}" ist weder eine Eigenschaft noch eine Methode. Nur Eigenschaften und Methoden werden unterstützt.
es: '[DynamicData]' miembro '{0}.{1}' no es una propiedad ni un método. Solo se admiten propiedades y métodos.
fr: '[DynamicData]' membre '{0}.{1}' n’est ni une propriété ni une méthode. Seules les propriétés et les méthodes sont prises en charge.
it: '[DynamicData]' membro '{0}.{1}' non è una proprietà né un metodo. Sono supportati solo metodi e proprietà.
ja: メンバー '{0}.{1}' '[DynamicData]' プロパティでもメソッドでもありません。プロパティとメソッドのみがサポートされています。
pl: składowa '[DynamicData]' "{0}.{1}" nie jest właściwością ani metodą. Obsługiwane są tylko właściwości i metody.
pt_br: '[DynamicData]' membro '{0}.{1}' não é uma propriedade nem um método. Somente propriedades e métodos têm suporte.
ru: '[DynamicData]' "{0}.{1}" не является свойством или методом. Поддерживаются только свойства и методы.
tr: '[DynamicData]' '{0}.{1}' üyesi bir özellik veya yöntem değil. Yalnızca özellikler ve yöntemler desteklenir.
zh_hans: '[DynamicData]' 成员 “{0}.{1}” 既不是属性也不是方法。仅支持属性和方法。
zh_hant: '[DynamicData]' 成員 『{0}.{1}』 不是屬性也不是方法。只支援屬性和方法。

# DynamicDataShouldBeValidMessageFormat_SourceTypeProperty
source: '[DynamicData]' member '{0}.{1}' is a property so you should use 'DynamicDataSourceType.AutoDetect' or 'DynamicDataSourceType.Property' (auto detect is the default when not specified explicitly, and is recommended)
cs: '[DynamicData]' člen {0}.{1} je vlastnost, takže byste měli použít DynamicDataSourceType.AutoDetect nebo DynamicDataSourceType.Property (automatické zjišťování je výchozí, pokud není explicitně zadáno, a doporučuje se)
de: '[DynamicData]' Member "{0}.{1}" ist eine Eigenschaft, daher sollten Sie "DynamicDataSourceType.AutoDetect" oder "DynamicDataSourceType.Property" verwenden (die automatische Erkennung ist der Standardwert, wenn sie nicht explizit angegeben wird und empfohlen wird).
es: '[DynamicData]' miembro '{0}.{1}' es una propiedad, por lo que debe usar 'DynamicDataSourceType.AutoDetect' o 'DynamicDataSourceType.Property' (la detección automática es el valor predeterminado cuando no se especifica explícitamente y se recomienda)
fr: '[DynamicData]' membre « {0}.{1} » est une propriété, vous devez donc utiliser « DynamicDataSourceType.AutoDetect » ou « DynamicDataSourceType.Property » (la détection automatique est la valeur par défaut lorsqu’elle n’est pas spécifiée explicitement et est recommandée)
it: '[DynamicData]' membro '{0}.{1}' è una proprietà, quindi è consigliabile usare 'DynamicDataSourceType.AutoDetect' o 'DynamicDataSourceType.Property'. Il rilevamento automatico è l'impostazione predefinita quando non è specificata in modo esplicito ed è consigliata
ja: '[DynamicData]' メンバー '{0}.{1}' はプロパティであるため、'DynamicDataSourceType.AutoDetect' または 'DynamicDataSourceType.Property' を使用する必要があります (自動検出は明示的に指定されていない場合の既定値であり、推奨されます)
pl: '[DynamicData]' składowa "{0}.{1}" jest właściwością, dlatego należy użyć właściwości "DynamicDataSourceType.AutoDetect" lub "DynamicDataSourceType.Property" (wykrywanie automatyczne jest domyślne, gdy nie jest jawnie określone i jest zalecane)
pt_br: '[DynamicData]' membro '{0}.{1}' é uma propriedade, portanto, você deve usar 'DynamicDataSourceType.AutoDetect' ou 'DynamicDataSourceType.Property' (detectar automaticamente é o padrão quando não especificado explicitamente e é recomendado)
ru: '[DynamicData]' "{0}.{1}" является свойством, поэтому следует использовать "DynamicDataSourceType.AutoDetect" или "DynamicDataSourceType.Property" (автообнаружение используется по умолчанию, если не указано явно и рекомендуется)
tr: '[DynamicData]' üyesi '{0}.{1}' bir özelliktir, bu nedenle 'DynamicDataSourceType.AutoDetect' veya 'DynamicDataSourceType.Property' kullanmalısınız (otomatik algılama açıkça belirtilmediğinden varsayılandır ve önerilir)
zh_hans: '[DynamicData]' 成员 “{0}.{1}” 是属性，因此应使用 “DynamicDataSourceType.AutoDetect” 或 “DynamicDataSourceType.Property”，(自动检测在未显式指定时为默认值，建议)
zh_hant: '[DynamicData]' 成員 '{0}.{1}' 是屬性，因此您應該使用 'DynamicDataSourceType.AutoDetect' 或 'DynamicDataSourceType.Property' (未明確指定自動偵測是預設值，建議)

# DynamicDataShouldBeValidMessageFormat_TooManyMembers
source: '[DynamicData]' member '{0}.{1}' is found more than once
cs: Člen [DynamicData] {0}.{1} byl nalezen více než jednou.
de: „[DynamicData]“-Mitglied „{0}.{1}“ wurde mehrmals gefunden.
es: '[DynamicData]' miembro '{0}.{1}' se encuentra más de una vez
fr: '[DynamicData]' membre ' {0}.{1}' est trouvé plusieurs fois
it: Il membro '[DynamicData]' '{0}.{1}' è stato trovato più di una volta
ja: '[DynamicData]' メンバー '{0}.{1}' が複数回見つかりました
pl: Element członkowski „[DynamicData]” „{0}.{1}” znaleziono więcej niż raz
pt_br: O membro '[DynamicData]' '{0}.{1}' foi encontrado mais de uma vez
ru: Элемент "[DynamicData]" "{0}.{1}" обнаружен несколько раз
tr: '[DynamicData]' üyesi '{0}.{1}' birden çok kez bulundu
zh_hans: 多次找到 "[DynamicData]" 成员“{0}.{1}”
zh_hant: '[DynamicData]' 成員 '{0}。{1}' 多次發現

# DynamicDataShouldBeValidTitle
source: DynamicData should be valid
cs: Položka DynamicData by měla být platná.
de: DynamicData muss gültig sein.
es: DynamicData debe ser válido
fr: DynamicData doit être valide
it: DynamicData deve essere valido
ja: DynamicData は有効である必要があります
ko: DynamicData는 유효해야 합니다.
pl: Wartość DynamicData powinna być prawidłowa
pt_br: DynamicData deve ser válido
ru: Значение DynamicData должно быть допустимым
tr: DynamicData geçerli olmalıdır
zh_hans: DynamicData 应有效
zh_hant: DynamicData 應該有效

# FlowTestContextCancellationTokenDescription
source: When calling async methods that have overloads accepting a CancellationToken parameter, prefer using the overload with TestContext.CancellationToken to enable cooperative cancellation and respect test timeouts.
pl: W przypadku wywoływania metod asynchronicznych, które mają przeciążenia akceptujące parametr CancellationToken, preferuj użycie przeciążenia z argumentem TestContext.CancellationToken, aby umożliwić anulowanie w trybie współpracy i respektowanie limitów czasu testu.
zh_hant: 在呼叫接受 CancellationToken 參數的多載非同步方法時，建議使用 TestContext.CancellationToken 的多載，以啟用共同取消並遵守測試逾時。

# FlowTestContextCancellationTokenMessageFormat
source: Consider using the overload that accepts a CancellationToken and pass 'TestContext.CancellationToken'
pl: Rozważ użycie przeciążenia, które akceptuje element CancellationToken i przekaż argument „TestContext.CancellationToken”
zh_hant: 考慮使用接受 CancellationToken 的多載，並傳遞 'TestContext.CancellationToken'

# FlowTestContextCancellationTokenTitle
source: Flow TestContext.CancellationToken to async operations
cs: Přenesení TestContext.CancellationToken do asynchronních operací
de: Fluss von TestContext.CancellationToken zu asynchronen Vorgängen
es: Flujo de TestContext.CancellationToken a operaciones asincrónicas
fr: Transmettez TestContext.CancellationToken aux opérations asynchrones
it: Flusso da TestContext.CancellationToken a operazioni asincrone
ja: TestContext.CancellationToken を非同期操作にフローする
pl: Przekaż TestContext.CancellationToken do operacji asynchronicznych
pt_br: Fluxo TestContext.CancellationToken para operações assíncronas
ru: Передача TestContext.CancellationToken в асинхронные операции
tr: TestContext.CancellationToken'ı asenkron işlemler için akışa aktarın
zh_hans: 将 TestContext.CancellationToken 传递给异步操作
zh_hant: 將 TestContext.CancellationToken 傳遞給非同步作業

# GlobalTestFixtureShouldBeValidDescription
source: Methods marked with '[GlobalTestInitialize]' or '[GlobalTestCleanup]' should follow the following layout to be valid: -it can't be declared on a generic class -it should be 'public' -it should be 'static' -it should not be 'async void' -it should not be a special method (finalizer, operator...). -it should not be generic -it should take one parameter of type 'TestContext' -return type should be 'void', 'Task' or 'ValueTask' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' -The class shouldn't be 'static' -The class should be marked with '[TestClass]' (or a derived attribute) -the class should not be generic.
cs: Aby byly metody s označením [GlobalTestInitialize] nebo [GlobalTestCleanup] platné, musí se řídit následujícím rozložením: – Nesmí být deklarované pro obecnou třídu. – Musí být „public“. – Musí být „static“. – Nesmí být „async void“. – Nesmí být speciální metodou („finalizer“, „operator“...). – Nesmí být obecné. – Musí mít jeden parametr typu TestContext. – Návratový typ musí být „void“, „Task“ nebo „ValueTask“. Typ deklarující tyto metody by měl také respektovat následující pravidla: – Typ by měl být třída. – Třída by měla být „public“. – Třída by neměla být „static“. – Třída by měla být označena atributem [TestClass] (nebo odvozeným atributem). – Třída by neměla být obecná.
de: Methoden, die mit „[GlobalTestInitialize]“ oder „[GlobalTestCleanup]“ gekennzeichnet sind, sollten dem folgenden Layout folgen, um gültig zu sein: – kann nicht für eine generische Klasse deklariert werden – muss „public“ sein – muss „static“ sein – darf nicht „async void“ sein – darf keine spezielle Methode sein (Finalizer, Operator...). – darf nicht „generic“ sein – muss einen Parameter vom Typ „TestContext“ annehmen – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein Der Typ, der diese Methoden deklariert, sollte auch die folgenden Regeln beachten: – Der Typ sollte eine Klasse sein – Die Klasse sollte „public“ sein – Die Klasse darf nicht „static“ sein – Die Klasse muss mit „[TestClass]“ (oder einem abgeleiteten Attribut) markiert werden – die Klasse darf nicht generisch sein.
es: Los métodos marcados con '[GlobalTestInitialize]' o '[GlobalTestCleanup]' deben seguir el siguiente diseño para ser válidos: -no se puede declarar en una clase genérica - debería ser 'público' - debería estar 'estático' -no debe ser 'async void' -no debe ser un método especial (finalizador, operador...). -no debe ser genérico -debe tomar un parámetro de tipo 'TestContext' - El tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' El tipo que declara estos métodos también debe respetar las reglas siguientes: -El tipo debe ser una clase -La clase debe ser 'public' -La clase no debe ser 'static' -La clase debe marcarse con '[TestClass]' (o un atributo derivado) -la clase no debe ser genérica.
fr: Les méthodes marquées par « [GlobalTestInitialize] » ou « [GlobalTestCleanup] » doivent respecter le schéma suivant pour être valides : - elle ne peut pas être déclarée dans une classe générique – elle doit être « public » – elle doit être « static » – elle ne doit pas être « async void » – il ne doit pas s’agir d’une méthode spéciale (finaliseur, opérateur...). – elle ne doit pas être générique – il doit prendre un paramètre de type « TestContext » - le type de retour doit être « void », « Task » ou « ValueTask » Le type déclarant ces méthodes doit également respecter les règles suivantes : - le type doit être une classe - la classe doit être « public » - la classe ne doit pas être « static » - la classe doit être marquée par « [TestClass] » (ou un attribut dérivé) - la classe ne doit pas être générique.
it: I metodi contrassegnati con ‘[GlobalTestInitialize]’ o ‘[GlobalTestCleanup]’ devono seguire il layout seguente per essere validi: - Non può essere dichiarato in una classe generica - Deve essere 'public' - Deve essere 'static' - Non deve essere 'async void' - Non deve essere un metodo speciale (finalizzatore, operatore...). - Non deve essere generico - Deve accettare un parametro di tipo 'TestContext' - Il tipo restituito deve essere 'void', 'Task' o 'ValueTask' Anche il tipo che dichiara questi metodi deve rispettare le regole seguenti: - Il tipo deve essere una classe - La classe deve essere 'public' - La classe non deve essere 'static' - La classe deve essere contrassegnata con '[TestClass]' (o un attributo derivato) - La classe non deve essere generica.
ja: '[GlobalTestInitialize]' または '[GlobalTestCleanup]' でマークされたメソッドを有効にするには、次のレイアウトに従う必要があります: - ジェネリック クラスで宣言することはできません - 'public' である必要があります - 'static' である必要があります - 'async void' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。 - ジェネリックにすることはできません - 'TestContext' 型のパラメーターを 1 つ受け取る必要があります - 戻り値の型が 'void'、'Task'、または 'ValueTask' である必要があります これらのメソッドを宣言する型も、次の規則に従う必要があります: - 型はクラスである必要があります -クラスは 'public' である必要があります - クラスを 'static' にすることはできません - クラスは '[TestClass]' (または派生属性) でマークする必要があります - クラスをジェネリックにすることはできません。
pl: Metody oznaczone znakiem „[GlobalTestInitialize]” lub „[GlobalTestCleanup]” powinny być zgodne z następującym układem, aby były prawidłowe: — nie może być zadeklarowana w klasie ogólnej — powinna być typu „public” — powinna mieć wartość „static” — nie powinna to być wartość „async void” — nie powinna to być metoda specjalna (finalizator, operator...). — nie powinna być ogólna — powinna przyjmować jeden parametr typu „TestContext” — zwracany typ powinien mieć wartość „void”, „Taks” lub „ValueTask” Typ deklarujący te metody powinien również przestrzegać następujących reguł: — typ powinien być klasą — klasa powinna być „publiczna” — klasa nie powinna mieć wartości „static” — klasa powinna być oznaczona „[TestClass]” (lub atrybutem pochodnym) — klasa nie powinna być ogólna.
pt_br: Os métodos marcados com "[GlobalTestInitialize]" ou "[GlobalTestCleanup]" devem seguir o seguinte layout para serem válidos: -não podem ser declarados em uma classe genérica -devem ser "públicos" -devem ser "estáticos" -não devem ser "nulos assíncronos" -não devem ser um método especial (finalizador, operador...). -não devem ser genéricos -devem usar um parâmetro do tipo “TestContext” -o tipo de retorno deve ser “nulo”, “Tarefa” ou “ValueTask” O tipo que declara esses métodos também deve respeitar as seguintes regras: -O tipo deve ser uma classe -A classe deve ser "público" -A classe não deve ser “estático” -A classe deve ser marcada com “[TestClass]” (ou um atributo derivado) -a classe não deve ser genérica.
ru: Чтобы метод, помеченный "[GlobalTestInitialize]" или "[GlobalTestCleanup]", был допустимым, он должен соответствовать следующей структуре: – не может быть объявлен для универсального класса ("generic") – должен быть общедоступным ("public") – должен быть статическим ("static") – не должен быть асинхронным и не возвращающим значения ("async void") – не должен быть специальным (метод завершения, оператор…). – не должен быть общим ("generic") – должен принимать один параметр типа "TestContext" – должен иметь тип возвращаемого значения "void", "Task" или "ValueTask" Тип, объявляющий такие методы, также должен соответствовать следующим правилам: – должен быть классом – класс должен быть общедоступным ("public") – не должен быть статическим ("static") – должен быть помечен как "[TestClass]" (или производный атрибут) – не должен быть универсальным ("generic").
tr: ‘[GlobalTestInitialize]’ veya ‘[GlobalTestCleanup]’ ile işaretlenmiş yöntemlerin geçerli olabilmesi için şu düzeni izlemesi gerekir: -genel bir sınıfta tanımlanamaz -'public' olmalıdır -'static' olmalıdır -'async void' olmamalıdır -özel bir metot (sonlandırıcı, işleç...) olmamalıdır. - genel olmamalıdır - 'TestContext' türünden bir parametre almalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalıdır Bu metotları bildiren türün ayrıca aşağıdaki kurallara uyması gerekir: -Tür bir sınıf olmalıdır -Sınıf ‘public’ olmalıdır -Sınıf 'static' olmamalıdır -Sınıf '[TestClass]' (veya türetilmiş bir öznitelik) ile işaretlenmelidir -sınıf genel olmamalıdır.
zh_hans: 标记有 "[GlobalTestInitialize]" 或 "[GlobalTestCleanup]" 的方法应遵循以下布局才会有效: - 不能在泛型类上声明它 - 它应为 "public" - 它应为 "static" - 它不应为 "async void" - 它不应是特殊方法(终结器、运算符...)。 - 它不应是泛型的 - 它应采用 "TestContext" 类型的一个参数 - 返回类型应为 "void"、"Task" 或 "ValueTask" 声明这些方法的类型还应遵循以下规则: - 类型应为类 - 类应该为 "public" - 类不应为 "static" - 应使用 "[TestClass]"（或派生属性）标记类 - 类不应是泛型的。
zh_hant: 標示為 '[GlobalTestInitialize]' 或 '[GlobalTestCleanup]' 的方法應該遵循下列配置才能有效： -其不能在泛型類別上宣告 -其應為 'public' -其應為 'static' -其不應為 'async void' -其不應為特殊方法 (完成項、運算子...)。 -其不應為泛型 -其應該接受類型為 'TestContext' 的一個參數 -傳回類型應為 'void'、'Task' 或 'ValueTask' 宣告這些方法的類型還應遵循以下規則: -類型應為類別 -類別應為 'public' -類別不應為 'static' -類別應標示為 '[TestClass]' (或衍生屬性) -類別不應為泛型。
