Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DataRowShouldBeValidMessageFormat_GenericTypeArgumentNotResolved
source: The type of the generic parameter '{0}' could not be inferred.
cs: Typ obecného parametru '{0}' nelze odvodit.
de: Der Typ des generischen Parameters '{0}' konnte nicht abgeleitet werden.
es: No se pudo inferir el tipo del parámetro genérico '{0}'.
fr: Impossible de déduire le type du paramètre générique '{0}'.
it: Impossibile dedurre il tipo del parametro generico '{0}'.
ja: ジェネリック パラメーター '{0}' の型を推論できませんでした。
pl: Nie można wywnioskować typu '{0}' parametru ogólnego.
pt_br: Não foi possível inferir o tipo '{0}' parâmetro genérico.
ru: Не удалось определить тип универсального '{0}' параметра.
tr: Genel parametre türü '{0}' çıkarsanamadı.
zh_hans: 无法推断 '{0}' 泛型参数的类型。
zh_hant: 無法推斷泛型參數 '{0}' 的類型。

# DataRowShouldBeValidMessageFormat_OnTestMethod
source: DataRow should only be set on a test method
cs: Objekt DataRow by měl být nastaven pouze pro testovací metodu
de: DataRow darf nur für eine Testmethode festgelegt werden.
es: DataRow solo debe establecerse en un método de prueba
fr: DataRow ne doit être défini que sur une méthode de test
it: DataRow deve essere impostato solo su un metodo di test
ja: DataRow はテスト メソッドにのみ設定する必要があります
ko: DataRow는 테스트 메서드에서만 설정해야 함
pl: Element DataRow powinien być ustawiony tylko dla metody testowej
pt_br: DataRow só deve ser definido em um método de teste
ru: Значение DataRow следует задавать только для метода теста
tr: DataRow yalnızca bir test yönteminde ayarlanmalıdır
zh_hans: DataRow 应仅在测试方法上进行设置
zh_hant: DataRow 只能在測試方法上設定

# DataRowShouldBeValidTitle
source: DataRow should be valid
cs: Argument DataRow by měl být platný
de: DataRow muss gültig sein.
es: DataRow debe ser válido
fr: DataRow doit être valide
it: DataRow deve essere valido
ja: DataRow は有効である必要があります
ko: DataRow는 유효해야 함
pl: Element DataRow powinien być prawidłowy
pt_br: DataRow deve ser válido
ru: Значение DataRow должно быть допустимым
tr: DataRow geçerli olmalıdır
zh_hans: DataRow 应有效
zh_hant: DataRow 應該有效

# DoNotNegateBooleanAssertionFix
source: Use 'Assert.{0}' instead
pl: Użyj „Assert.{0}” zamiast
zh_hant: 改為使用 'Assert.{0}'

# DoNotNegateBooleanAssertionFixAllTitle
source: Use proper Assert methods for all negated assertions
pl: Użyj odpowiednich metod Assert dla wszystkich zanegowanych asercji
zh_hant: 針對所有否定的判斷提示使用適當的 Assert 方法

# DoNotNegateBooleanAssertionMessageFormat
source: Do not negate boolean assertions, instead use the opposite assertion
cs: Nenegujte logické kontrolní výrazy – použijte místo nich opačný kontrolní výraz
de: Boolesche Assertionen nicht negiert, sondern die entgegengesetzte Assertion verwenden
es: No negar las aserciones booleanas, usar en su lugar la aserción opuesta
fr: Ne pas annuler les assertions booléennes, mais utiliser l'assertion opposée
it: Non negare asserzioni booleane, usare l'asserzione opposta
ja: ブール型アサーションを否定しないでください。代わりに、逆のアサーションを使用してください
ko: 부울 어설션을 부정하지 말고 반대 어설션을 사용하세요
pl: Nie neguj asercji logicznych, zamiast tego użyj asercji przeciwnej
pt_br: Não negue asserções boolianas; em vez disso, use a asserção oposta
ru: Не отрицать логические утверждения, вместо этого использовать противоположное утверждение
tr: Boole onay deyimlerini tersine çevirme, bunun yerine ters onay deyimini kullan
zh_hans: 不要对布尔断言求反，而是使用相反的断言
zh_hant: 請勿否定布林值判斷提示，而是使用相反的判斷提示

# DoNotNegateBooleanAssertionTitle
source: Do not negate boolean assertions
cs: Nenegujte logické kontrolní výrazy
de: Boolesche Assertionen nicht negiert
es: No negar las aserciones booleanas
fr: Ne pas annuler les assertions booléennes
it: Non negare asserzioni booleane
ja: ブール型アサーションを否定しない
ko: 부울 어설션 부정하지 마세요
pl: Nie neguj asercji logicznych
pt_br: Não negue asserções booleanas
ru: Не отрицать логические утверждения
tr: Boole onay deyimlerini tersine çevirme
zh_hans: 不要对布尔断言求反
zh_hant: 請勿否定布林值判斷提示

# DoNotStoreStaticTestContextAnalyzerMessageFormat
source: Do not store TestContext in a static member
cs: Neukládejte TestContext ve statickém členu
de: TestContext nicht in einem statischen Member speichern
es: No almacenar TestContext en un miembro estático
fr: Ne pas stocker TestContext dans un membre statique
it: Non archiviare TestContext in un membro statico
ja: 静的メンバーに TestContext を格納しない
ko: TestContext를 정적 멤버에 저장하지 마세요
pl: Nie przechowuj elementu TestContext w statycznym elemencie członkowskim
pt_br: Não armazene TestContext em um membro estático
ru: Не хранить TestContext в статическом элементе
tr: TestContext'i statik üyede depolama
zh_hans: 不要将 TestContext 存储在静态成员中
zh_hant: 請勿將 TestContext 儲存在靜態成員中

# DoNotStoreStaticTestContextAnalyzerTitle
source: Do not store TestContext in a static member
cs: Neukládejte TestContext ve statickém členu
de: TestContext nicht in einem statischen Member speichern
es: No almacenar TestContext en un miembro estático
fr: Ne pas stocker TestContext dans un membre statique
it: Non archiviare TestContext in un membro statico
ja: 静的メンバーに TestContext を格納しない
ko: TestContext를 정적 멤버에 저장하지 마세요
pl: Nie przechowuj elementu TestContext w statycznym elemencie członkowskim
pt_br: Não armazene TestContext em um membro estático
ru: Не хранить TestContext в статическом элементе
tr: TestContext'i statik üyede depolama
zh_hans: 不要将 TestContext 存储在静态成员中
zh_hant: 請勿將 TestContext 儲存在靜態成員中

# DoNotUseShadowingDescription
source: Shadowing test members could cause testing issues (such as NRE).
cs: Členové testů stínového provozu (vzdáleného řízení) by mohli způsobovat problémy s testováním (například NRE).
de: Durch das Schattieren von Testelementen können Testprobleme (z. B. NRE) verursacht werden.
es: La creación de instantáneas de miembros de prueba podría causar problemas de prueba (por ejemplo, NRE).
fr: Le cliché instantané des membres de test peut entraîner des problèmes de test (tels que NRE).
it: I membri del test di shadowing potrebbero causare problemi di test, ad esempio NRE.
ja: シャドウ処理テスト メンバーは、テストの問題 (NRE など) を引き起こす可能性があります。
ko: 테스트 멤버를 숨기면 테스트 문제(예: NRE)가 발생할 수 있습니다.
pl: Elementy członkowskie testu obserwowania mogą powodować problemy z testowaniem (takie jak NRE).
pt_br: Membros de teste de sombreamento podem causar problemas de teste (como NRE).
ru: Удаленное управление элементами теста может вызвать проблемы с тестированием (например, NRE).
tr: Gölge test üyeleri test sorunlarına (NRE gibi) neden olabilir.
zh_hans: 对测试成员进行影子处理可能会导致测试问题(如 NRE)。
zh_hant: 陰影測試成員可能會導致測試問題 (例如 NRE)。

# DoNotUseShadowingMessageFormat
source: Member '{0}' already exists in the base class
cs: Člen {0} už v základní (kořenové) třídě existuje.
de: Das Element „{0}“ ist bereits in der Basisklasse vorhanden.
es: El miembro "{0}" ya existe en la clase base
fr: Le membre « {0} » existe déjà dans la classe de base
it: Il membro “{0}” esiste già nella classe di base
ja: メンバー '{0}' は既に基本クラスに存在します
pl: Składowa „{0}” już istnieje w klasie bazowej
pt_br: O membro "{0}" já existe na classe base
ru: Элемент "{0}" уже существует в базовом классе
tr: '{0}' adlı üye zaten temel sınıfta mevcut
zh_hans: 基类中已存在成员“{0}”
zh_hant: 成員 '{0}' 已經存在於基底類別中

# DoNotUseShadowingTitle
source: Do not use shadowing
cs: Nepoužívat stínový provoz (vzdálené řízení)
de: Keine Schattierung verwenden
es: No usar sesión concurrente
fr: Ne pas utiliser le cliché instantané
it: Non usare lo shadowing
ja: シャドウ処理を使用しない
ko: 섀도 사용 안 함
pl: Nie używaj obserwowania
pt_br: Não usar sombreamento
ru: Не используйте удаленное управление
tr: Gölgeleme kullanma
zh_hans: 不使用影子处理
zh_hant: 不使用陰影

# DoNotUseSystemDescriptionAttributeDescription
source: 'System.ComponentModel.DescriptionAttribute' has no effect in the context of tests and you likely wanted to use 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute' instead.
cs: System.ComponentModel.DescriptionAttribute nemá v kontextu testů žádný účinek a pravděpodobně jste místo toho chtěli použít Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute.
de: "System.ComponentModel.DescriptionAttribute" hat im Kontext von Tests keine Auswirkungen, und Sie wollten wahrscheinlich stattdessen "Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute" verwenden.
es: "System.ComponentModel.DescriptionAttribute" no tiene ningún efecto en el contexto de las pruebas y es probable que quiera usar "Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute" en su lugar.
fr: « System.ComponentModel.DescriptionAttribute » n’a aucun effet dans le contexte des tests et vous vouliez probablement utiliser « Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute » à la place.
it: 'System.ComponentModel.DescriptionAttribute' non ha alcun effetto in un contesto di test ed è probabile che si intendesse usare 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'.
ja: 'System.ComponentModel.DescriptionAttribute' はテストのコンテキストでは効果がないため、代わりに 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute' を使用する必要がある可能性があります。
ko: 'System.ComponentModel.DescriptionAttribute'는 테스트 컨텍스트에 영향을 주지 않으며 대신 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'를 사용하려고 한 것 같습니다.
pl: Element „System.ComponentModel.DescriptionAttribute” nie ma żadnego efektu w kontekście testów i prawdopodobnie chcesz użyć elementu „Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute”.
pt_br: 'System.ComponentModel.DescriptionAttribute' não tem efeito no contexto de testes e você provavelmente quis usar 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'.
ru: "System.ComponentModel.DescriptionAttribute" не действует в контексте тестов. Вероятно, вы хотели использовать "Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute".
tr: 'System.ComponentModel.DescriptionAttribute'un testler bağlamında hiçbir etkisi yoktur ve muhtemelen bunun yerine 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute' kullanmak istediniz.
zh_hans: “System.ComponentModel.DescriptionAttribute” 在测试上下文中无效，你可能想要改用 “Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute”。
zh_hant: 'System.ComponentModel.DescriptionAttribute' 在測試內容中沒有作用，建議您改用 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'。

# DoNotUseSystemDescriptionAttributeMessageFormat
source: Did you mean to be using 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'?
cs: Nechtěli jste použít Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute?
de: Wollten Sie "Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute" verwenden?
es: ¿Quería usar "Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute"?
fr: Vous vouliez utiliser « Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute » ?
it: Si intendeva usare 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'?
ja: 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute' を使用する予定でしたか?
ko: 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'를 사용하려고 했나요?
pl: Czy chodziło Ci o użycie elementu „Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute”?
pt_br: Você pretendia usar 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute'?
ru: Вы хотели использовать "Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute"?
tr: 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute' kullanmayı mı düşündünüz?
zh_hans: 是否打算使用 “Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute”?
zh_hant: 您是指要使用 'Microsoft.VisualStudio.TestTools.UnitTesting.DescriptionAttribute' 嗎?

# DoNotUseSystemDescriptionAttributeTitle
source: 'System.ComponentModel.DescriptionAttribute' has no effect on test methods
cs: System.ComponentModel.DescriptionAttribute nemá žádný vliv na testovací metody
de: "System.ComponentModel.DescriptionAttribute" hat keine Auswirkungen auf Testmethoden.
es: "System.ComponentModel.DescriptionAttribute" no tiene ningún efecto en los métodos de prueba
fr: « System.ComponentModel.DescriptionAttribute » n’a aucun effet sur les méthodes de test
it: 'System.ComponentModel.DescriptionAttribute' non ha alcun effetto sui metodi di test.
ja: 'System.ComponentModel.DescriptionAttribute' はテスト メソッドに影響しません
ko: 'System.ComponentModel.DescriptionAttribute'는 테스트 메서드에 영향을 주지 않습니다.
pl: Element „System.ComponentModel.DescriptionAttribute” nie ma wpływu na metody testowe
pt_br: 'System.ComponentModel.DescriptionAttribute' não tem efeito sobre métodos de teste
ru: "System.ComponentModel.DescriptionAttribute" не действует на методы тестирования
tr: 'System.ComponentModel.DescriptionAttribute' test yöntemlerini etkilemez
zh_hans: “System.ComponentModel.DescriptionAttribute” 对测试方法没有影响
zh_hant: 'System.ComponentModel.DescriptionAttribute' 對測試方法無影響

# DuplicateDataRowMessageFormat
source: Do not duplicate 'DataRow' attributes. This is usually a copy/paste error. The attribute indices are '{0}' and '{1}'.
cs: Neduplikujte atributy DataRow. Obvykle se jedná o chybu kopírování a vložení. Indexy atributů jsou {0} a {1}.
de: Duplizieren Sie keine „DataRow“-Attribute. Dies ist normalerweise ein Kopier-/Einfügefehler. Die Attributindizes sind „{0}“ und „{1}“.
es: No duplicar los atributos "DataRow". Suele ser un error de copiar y pegar. Los índices de los atributos son "{0}" y "{1}".
fr: Ne dupliquez pas les attributs 'DataRow'. Il s'agit généralement d'une erreur de copier/coller. Les indices des attributs sont '{0}' et '{1}'.
it: Non duplicare gli attributi 'DataRow'. Generalmente è un errore di copia/incolla. Gli indici degli attributi sono '{0}' e '{1}'.
ja: 'DataRow' 属性を複製しないでください。これは通常、コピー/貼り付けエラーです。属性インデックスは '{0}' と '{1}' です。
pl: Nie duplikuj atrybutów „DataRow”. Zazwyczaj jest to błąd kopiowania/wklejania. Indeksy atrybutów to „{0}” i „{1}”.
pt_br: Não duplique os atributos 'DataRow'. Normalmente, isso é um erro de copiar/colar. Os índices de atributo são '{0}' e '{1}'.
ru: Не дублируйте атрибуты "DataRow". Обычно это ошибка копирования и вставки. Индексы атрибута — "{0}" и "{1}".
tr: 'DataRow' özniteliklerini kopyalamayın. Bu genellikle kopyala-yapıştır hatasıdır. Öznitelik dizinleri '{0}' ve '{1}'.
zh_hans: 不要复制 'DataRow' 属性。这通常是复制/粘贴错误。属性索引为“{0}”和“{1}”。
zh_hant: 不要複製 'DataRow' 屬性。這通常是複製/貼上錯誤。屬性索引為 '{0}' 和 '{1}'。

# DuplicateDataRowTitle
source: Avoid duplicated 'DataRow' entries
cs: Vyhněte se duplicitním položkám DataRow
de: Vermeiden doppelter „DataRow“-Einträge
es: Evitar entradas duplicadas de "DataRow"
fr: Évitez les entrées « DataRow » dupliquées
it: Evitare voci 'DataRow' duplicate
ja: 重複する 'DataRow' エントリを回避する
pl: Unikaj zduplikowanych wpisów „DataRow”
pt_br: Evite entradas duplicadas 'DataRow'
ru: Избегайте дублирования записей "DataRow"
tr: 'DataRow' girdilerinin yenilenmesinden kaçının
zh_hans: 避免重复的 'DataRow' 条目
zh_hant: 避免重複的 'DataRow' 條目

# DynamicDataShouldBeValidDescription
source: 'DynamicData' entry should have the following layout to be valid: - should only be set on a test method; - member should be defined on the type specified; - member should be a method if DynamicDataSourceType.Method is specified or a property otherwise.
cs: Aby byla položka DynamicData platná, musí se řídit následujícím rozložením: – měla by být nastavena jenom pro testovací metodu; – člen by měl být definovaný pro zadaný typ; – pokud je zadáno DynamicDataSourceType.Method, měl by být člen metoda, jinak vlastnost.
de: Der "DynamicData"-Eintrag muss das folgende Layout aufweisen, um gültig zu sein: – Er sollte nur für eine Testmethode festgelegt werden. – Das Element muss für den angegebenen Typ definiert werden; – Das Element sollte eine Methode sein, wenn DynamicDataSourceType.Method angegeben ist, oder andernfalls eine Eigenschaft.
es: La entrada de 'DynamicData' debe tener el siguiente diseño para que sea válida: : solo se debe establecer en un método de prueba; - el miembro debe definirse en el tipo especificado; - el miembro debe ser un método si se especifica DynamicDataSourceType.Method o una propiedad en caso contrario.
fr: L’entrée 'DynamicData' doit avoir la disposition suivante pour être valide : – ne doit être défini que sur une méthode de test ; - le membre doit être défini sur le type spécifié ; - le membre doit être une méthode si DynamicDataSourceType.Method est spécifié ou une propriété dans le cas contraire.
it: La voce di '[DynamicData]' deve avere il layout seguente per essere valida: - deve essere impostato solo su un metodo di test; - il membro deve essere definito nel tipo specificato; - il membro deve essere un metodo se si specifica DynamicDataSourceType.Method o una proprietà in caso contrario.
ja: 'DynamicData' エントリを有効にするには、次のレイアウトが必要です。 - テスト メソッドにのみ設定する必要があります。 - メンバーは、指定された型で定義する必要があります。 - DynamicDataSourceType.Method が指定されている場合はメンバーはメソッド、それ以外の場合はプロパティである必要があります。
ko: 'DynamicData' 항목에는 다음과 같은 레이아웃이 있어야 합니다. - 테스트 메서드에만 설정해야 합니다. - 지정된 형식에 멤버를 정의해야 합니다. - DynamicDataSourceType.Method가 지정된 경우 멤버가 메서드이거나, 그렇지 않으면 속성이어야 합니다.
pl: Wpis „DynamicData” powinien mieć następujący układ, aby był prawidłowym: — należy go ustawić tylko dla metody testowej; — element członkowski powinien być zdefiniowany dla określonego typu; — element członkowski powinien być metodą, jeśli określono metodę DynamicDataSourceType.Method lub właściwość w inny sposób.
pt_br: A entrada de "DynamicData" deve ter o seguinte layout para ser válida: - só deve ser definido em um método de teste; – o membro deve ser definido no tipo especificado; – o membro deve ser um método se DynamicDataSourceType.Method for especificado ou uma propriedade de outra forma.
ru: Запись "DynamicData" должна соответствовать следующему макету, чтобы быть допустимой: – должна быть задана только для метода теста; – элемент должен быть определен в указанном типе; – элемент должен быть методом, если указан DynamicDataSourceType.Method, в противном случае он должен быть свойством.
tr: '[DynamicData]' girdisinin geçerli olması için aşağıdaki koşulları karşılamalıdır: - yalnızca bir test yönteminde ayarlanmalıdır; - üye belirtilen türde tanımlanmalıdır; - DynamicDataSourceType.Method belirtilmişse üye bir yöntem olmalı, aksi takdirde bir özellik olmalıdır.
zh_hans: "DynamicData" 条目应具有以下布局才能有效: - 应仅对测试方法设置； - 应对指定的类型定义成员； - 如果指定了 DynamicDataSourceType.Method，则成员应为方法，否则应为属性。
zh_hant: 'DynamicData' 項目應具有下列配置為有效: - 應該只在測試方法上設定; - 應在指定的類型上定義成員; - 如果指定了 DynamicDataSourceType.Method，則成員應為方法，否則應為屬性。

# DynamicDataShouldBeValidMessageFormat_DataMemberSignature
source: '[DynamicData]' data member '{0}.{1}' signature is invalid
cs: Signatura datového členu [DynamicData] {0}.{1} je neplatná.
de: "[DynamicData]"-Datenmember "{0}.{1}" ist ungültig.
es: La firma del miembro de datos '{0}.{1}' de '[DynamicData]' no es válida
fr: Membre de données '[DynamicData]' '{0}.{1}' signature n’est pas valide
it: La firma del membro dati '[DynamicData]' '{0}.{1}' non è valida
ja: '[DynamicData]' データ メンバー '{0}.{1}' の署名が無効です
ko: '[DynamicData]' 데이터 멤버 '{0}.{1}' 서명이 잘못되었습니다.
pl: Podpis elementu członkowskiego „{0}.{1}” „[DynamicData]” jest nieprawidłowy
pt_br: A assinatura do membro de dados "{0}.{1}" de "[DynamicData]" é inválida
ru: Подпись элемента данных "[DynamicData]" "{0}.{1}" недопустима
tr: '[DynamicData]' veri üyesi '{0}.{1}' imzası geçersiz
zh_hans: "[DynamicData]" 数据成员 "{0}.{1}" 签名无效
zh_hant: '[DynamicData]' 資料成員 '{0}.{1}' 簽章無效

# DynamicDataShouldBeValidMessageFormat_DisplayMethodSignature
source: '[DynamicData]' display name method '{0}.{1}' signature is invalid
cs: Signatura metody zobrazovaného názvu [DynamicData] {0}.{1} je neplatná.
de: Die "[DynamicData]"-Signatur der Anzeigenamenmethode "{0}.{1}" ist ungültig.
es: La firma del método de nombre para mostrar '{0}.{1}' de '[DynamicData]' no es válida
fr: '[DynamicData]' méthode de nom d’affichage '{0}.{1}' signature n’est pas valide
it: La firma '{0}.{1}' del metodo del nome visualizzato '[DynamicData]' non è valida
ja: '[DynamicData]' 表示名メソッド '{0}.{1}' の署名が無効です
ko: '[DynamicData]' 표시 이름 메서드 '{0}.{1}' 서명이 잘못되었습니다.
pl: Podpis metody nazwy wyświetlanej „{0}.{1}” „[DynamicData]” jest nieprawidłowy
pt_br: A assinatura do método de nome de exibição "{0}.{1}" de "[DynamicData]" é inválida
ru: Подпись метода отображаемого имени "[DynamicData]" "{0}.{1}" недопустима
tr: '[DynamicData]' görünen ad yöntemi '{0}.{1}' imzası geçersiz
zh_hans: "[DynamicData]" 显示名称方法 "{0}.{1}" 签名无效
zh_hant: '[DynamicData]' 顯示名稱方法 '{0}.{1}' 簽章無效

# DynamicDataShouldBeValidMessageFormat_MemberMethod
source: '[DynamicData]' member '{0}.{1}' should be a method
cs: Člen [DynamicData] {0}.{1} by měla být metoda.
de: Das "[DynamicData]"-Element "{0}.{1}" muss eine Methode sein.
es: El miembro '{0}.{1}' de '[DynamicData]' debe ser un método
fr: Membre '[DynamicData]' '{0}.{1}' doit être une méthode
it: Il membro '[DynamicData]' '{0}.{1}' deve essere un metodo
ja: '[DynamicData]' メンバー '{0}.{1}' はメソッドである必要があります
ko: '[DynamicData]' 멤버 '{0}.{1}'은(는) 메서드여야 합니다.
pl: Element członkowski „{0}.{1}” „[DynamicData]” powinien być metodą
pt_br: O membro "{0}.{1}" de "[DynamicData]" deve ser um método
ru: Элемент "[DynamicData]" "{0}.{1}" должен быть методом
tr: '[DynamicData]' üyesi '{0}.{1}' bir yöntem olmalıdır
zh_hans: "[DynamicData]" 成员 "{0}.{1}" 应为方法
zh_hant: '[DynamicData]' 成員 '{0}.{1}' 應為方法

# DynamicDataShouldBeValidMessageFormat_MemberNotFound
source: '[DynamicData]' member '{0}.{1}' cannot be found
cs: Člen [DynamicData] {0}.{1} nelze najít.
de: "[DynamicData]"-Element "{0}.{1}" wurde nicht gefunden.
es: No se puede encontrar el miembro '{0}.{1}' de '[DynamicData]'
fr: Membre '[DynamicData]' '{0}.{1}' est introuvable
it: Impossibile trovare il membro '[DynamicData]' '{0}.{1}'
ja: '[DynamicData]' メンバー '{0}.{1}' が見つかりません
ko: '[DynamicData]' 멤버 '{0}.{1}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć elementu członkowskiego „{0}.{1}” „[DynamicData]”
pt_br: O membro "{0}.{1}" de "[DynamicData]" não pode ser encontrado
ru: Невозможно найти элемент "[DynamicData]" "{0}.{1}"
tr: '[DynamicData]' üyesi '{0}.{1}' bulunamıyor
zh_hans: 找不到 "[DynamicData]" 成员 "{0}.{1}"
zh_hant: 找不到 '[DynamicData]' 成員 '{0}.{1}'
