Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseRetryWithTestMethodMessageFormat
source: An attribute that derives from 'RetryBaseAttribute' can be specified only on a test method
cs: Atribut, který je odvozen od retryBaseAttribute, lze zadat pouze v testovací metodě.
de: Ein von „RetryBaseAttribute“ abgeleitetes Attribut kann nur für eine Testmethode angegeben werden.
es: Un atributo que deriva de 'RetryBaseAttribute' solo se puede especificar en un método de prueba
fr: Vous ne pouvez spécifier un attribut dérivant de « RetryBaseAttribute » que sur une méthode de test
it: È possibile specificare un attributo che deriva da ‘RetryBaseAttribute’ solo in un metodo di test
ja: 'RetryBaseAttribute' から派生する属性は、テスト メソッドでのみ指定できます
pl: Atrybut pochodzący od atrybutu „RetryBaseAttribute” można określić tylko w metodzie testowej
pt_br: Um atributo derivado de “RetryBaseAttribute” só pode ser especificado em um método de teste
ru: Атрибут, производный от "RetryBaseAttribute", может быть указан только в тестовом методе
tr: 'RetryBaseAttribute' özniteliğinden türetilen bir öznitelik yalnızca bir test yönteminde belirtilebilir
zh_hans: 只能在测试方法上指定派生自 ‘RetryBaseAttribute’ 的属性
zh_hant: 衍生自 'RetryBaseAttribute' 的屬性只能在測試方法上指定

# UseRetryWithTestMethodTitle
source: Use retry attribute on test method
cs: Použití atributu opakování u testovací metody
de: Verwenden des Wiederholungsattributs für die Testmethode
es: Usar el atributo de reintento en el método de prueba
fr: Utilisez l’attribut de nouvelle tentative sur la méthode de test
it: Utilizzare l'attributo di ripetizione nel metodo di test
ja: テスト メソッドで retry 属性を使用する
pl: Użyj atrybutu ponawiania dla metody testowej
pt_br: Usar o atributo de repetição no método de teste
ru: Использовать атрибут retry в тестовом методе
tr: Test yönteminde yeniden deneme özniteliğini kullan
zh_hans: 对测试方法使用重试属性
zh_hant: 在測試方法上使用重試屬性

# TestContextPropertyUsageTitle
source: TestContext property cannot be accessed in this context
cs: Vlastnost TestContext není v tomto kontextu přístupná
de: Auf die TestContext-Eigenschaft kann in diesem Kontext nicht zugegriffen werden
es: No se puede tener acceso a la propiedad TestContext en este contexto
fr: Impossible d’accéder à la propriété TestContext dans ce contexte
it: Non è possibile accedere alla proprietà TestContext in questo contesto
ja: このコンテキストでは TestContext プロパティにアクセスできません
pl: W tym kontekście nie można uzyskać dostępu do właściwości TestContext
pt_br: A propriedade TestContext não pode ser acessada neste contexto
ru: Свойство TestContext недоступно в этом контексте
tr: TestContext özelliğine bu bağlamda erişilemiyor
zh_hans: 无法在此上下文中访问 TestContext 属性
zh_hant: 無法在此內容中存取 TestContext 屬性

# TestContextPropertyUsageMessageFormat
source: TestContext property '{0}' cannot be accessed in '{1}' method
cs: Vlastnost TestContext {0} není přístupná v metodě {1}
de: Auf die TestContext-Eigenschaft „{0}“ kann in der Methode „{1}“ nicht zugegriffen werden
es: No se puede tener acceso a la propiedad TestContext "{0}" en el método "{1}"
fr: Impossible d’accéder à la propriété TestContext « {0} » dans la méthode « {1} »
it: Non è possibile accedere alla proprietà TestContext '{0}' nel metodo '{1}'
ja: TestContext プロパティ '{0}' に '{1}' メソッドでアクセスできません
pl: Nie można uzyskać dostępu do właściwości TestContext „{0}” w metodzie „{1}”
pt_br: A propriedade "{0}" de TestContext não pode ser acessada no método "{1}"
ru: Свойство TestContext "{0}" недоступно в методе "{1}"
tr: TestContext '{0}' özelliğine '{1}' yönteminde erişilemiyor
zh_hans: 无法在 ‘{1}’ 方法中访问 TestContext 属性 ‘{0}’
zh_hant: 無法在 '{1}' 方法中存取 TestContext 屬性 '{0}'

# TestContextPropertyUsageDescription
source: Some TestContext properties are only available during test execution and cannot be accessed in assembly initialize, class initialize, class cleanup, or assembly cleanup methods.
cs: Některé vlastnosti TestContext jsou k dispozici pouze během provádění testu a nelze k nim přistupovat v metodách inicializace sestavení, inicializace třídy, vyčištění třídy nebo vyčištění sestavení.
de: Einige TestContext-Eigenschaften sind nur während der Testausführung verfügbar und können nicht in Assemblyinitialisierungs-, Klasseninitialisierungs-, Klassenbereinigungs- oder Assemblybereinigungsmethoden aufgerufen werden.
es: Algunas propiedades de TestContext solo están disponibles durante la ejecución de la prueba y no se puede acceder a ellas en los métodos assembly initialize, class initialize, class cleanup o assembly cleanup.
fr: Certaines propriétés TestContext sont disponibles uniquement pendant l’exécution du test et ne sont pas accessibles dans les méthodes d’initialisation d’assembly, d’initialisation de classe, de nettoyage de classe ou de nettoyage d’assembly.
it: Alcune proprietà TestContext sono disponibili solo durante l'esecuzione dei test e non è possibile accedervi nei metodi di inizializzazione degli assembly, inizializzazione delle classi, pulizia delle classi o pulizia degli assembly.
ja: TestContext プロパティの一部はテストの実行中にのみ使用でき、assenbly initialize、class initialize、class cleanup、または assembly cleanup メソッドではアクセスできません。
pl: Niektóre właściwości TestContext są dostępne tylko podczas wykonywania testu i nie można uzyskać do nich dostępu w metodach inicjowania, inicjowania klasy, oczyszczania klasy ani oczyszczania zestawów.
pt_br: Algumas propriedades TestContext só estão disponíveis durante a execução do teste e não podem ser acessadas em métodos de inicialização de assembly, inicialização de classe, limpeza de classe ou limpeza de assembly.
ru: Некоторые свойства TestContext доступны только во время выполнения теста и недоступны в методах инициализации сборки, инициализации класса, очистки класса или очистки сборки.
tr: Bazı TestContext özellikleri yalnızca test yürütmesi sırasında kullanılabilir ve derleme başlatma, sınıf başlatma, sınıf temizleme veya derleme temizleme yöntemlerinde erişilemez.
zh_hans: 一些 TestContext 属性仅在测试执行期间可用，并且无法在程序集初始化、类初始化、类清理或程序集清理方法中访问。
zh_hant: 某些 TestContext 屬性僅在測試執行期間可供使用，無法在組件初始化、類別初始化、類別清理或組件清理方法中存取。

# AssertThrowsShouldContainSingleStatementDescription
source: Assert.Throws methods should contain only a single statement or expression. Multiple statements can be misleading - if the first statement throws, subsequent statements are never executed; if it doesn't throw, it should be moved outside the Assert.Throws.
pl: Metody Assert.Throws powinny zawierać tylko jedną instrukcję lub wyrażenie. Wiele instrukcji może być mylących – jeśli pierwsza instrukcja zgłosi wyjątek, kolejne instrukcje nigdy nie zostaną wykonane; jeśli nie zgłosi wyjątku, powinna zostać przeniesiona poza Assert.Throws.
zh_hant: Assert.Throws 方法應該只包含單一陳述式或運算式。多個陳述式可能會產生誤導 - 如果擲出第一個陳述式，後續陳述式永遠不會執行; 如果未擲回，則應該移到 Assert.Throws 之外。

# AssertThrowsShouldContainSingleStatementMessageFormat
source: Assert.Throws should contain only a single statement/expression
pl: Element Assert.Throws powinien zawierać tylko jedną instrukcję/wyrażenie
zh_hant: Assert.Throws 應該只包含單一陳述式/運算式

# AssertThrowsShouldContainSingleStatementTitle
source: Assert.Throws should contain only a single statement/expression
pl: Element Assert.Throws powinien zawierać tylko jedną instrukcję/wyrażenie
zh_hant: Assert.Throws 應該只包含單一陳述式/運算式

# AvoidAssertsInCatchBlocksTitle
source: Do not use asserts in catch blocks
pl: Nie używaj asercji w blokach catch
zh_hant: 不要在 Catch 區塊中使用判斷提示

# AvoidAssertsInCatchBlocksMessageFormat
source: Do not use asserts in catch blocks because they may not fail the test if no exception is thrown
pl: Nie używaj asercji w blokach catch, ponieważ test może nie zakończyć się niepowodzeniem, jeśli nie zostanie zgłoszony żaden wyjątek
zh_hant: 請勿在 Catch 區塊中使用判斷提示，因為如果沒有拋出例外，判斷提示可能不會測試失敗

# AvoidAssertsInCatchBlocksDescription
source: Using asserts in catch blocks is problematic because the test will pass even if no exception is thrown and the catch block is never executed. Use 'Assert.Throws', 'Assert.ThrowsExactly', 'Assert.ThrowsAsync' or 'Assert.ThrowsExactlyAsync' to verify that an exception is thrown, and then make additional assertions on the caught exception without using the try-catch block.
pl: Używanie asercji w blokach catch jest problematyczne, ponieważ test zakończy się powodzeniem, nawet jeśli nie zostanie zgłoszony żaden wyjątek i blok catch nigdy nie zostanie wykonany. Użyj instrukcji „Assert.Throws”, „Assert.ThrowsExactly”, „Assert.ThrowsAsync” lub „Assert.ThrowsExactlyAsync”, aby sprawdzić, czy zgłoszono wyjątek, a następnie wykonaj dodatkowe asercje dla przechwyconego wyjątku bez użycia bloku try-catch.
zh_hant: 在 Catch 區塊中使用斷言會有問題，因為即使沒有拋出例外且 Catch 區塊從未執行，測試仍會通過。請使用 'Assert.Throws'、'Assert.ThrowsExactly'、'Assert.ThrowsAsync' 或 'Assert.ThrowsExactlyAsync' 來驗證是否有拋出例外，然後在不使用 try-catch 區塊的情況下，對捕捉到的例外進行進一步判斷提示。

# DoNotUseParallelizeAndDoNotParallelizeTogetherDescription
source: An assembly should have either '[Parallelize]' or '[DoNotParallelize]' attribute, but not both. Having both attributes creates an ambiguous configuration. When both are present, '[DoNotParallelize]' takes precedence and parallelization will be disabled.
pl: Zestaw powinien mieć atrybut „[Parallelize]” lub „[DoNotParallelize]”, ale nie oba. Posiadanie obu atrybutów powoduje utworzenie niejednoznacznej konfiguracji. Gdy oba elementy są obecne, pierwszeństwo ma element „[DoNotParallelize]”, a równoległość zostanie wyłączona.

# DoNotUseParallelizeAndDoNotParallelizeTogetherMessageFormat
source: Assembly has both '[Parallelize]' and '[DoNotParallelize]' attributes which creates ambiguity
pl: Zestaw ma atrybuty „[Parallelize]” i „[DoNotParallelize]”, co tworzy niejednoznaczność

# DoNotUseParallelizeAndDoNotParallelizeTogetherTitle
source: Do not use both '[Parallelize]' and '[DoNotParallelize]' attributes
pl: Nie używaj obu atrybutów „[Parallelize]” i „[DoNotParallelize]”

# UseOSConditionAttributeInsteadOfRuntimeCheckTitle
source: Use '[OSCondition]' attribute instead of 'RuntimeInformation.IsOSPlatform' calls with early return or 'Assert.Inconclusive'
pl: Użyj atrybutu „[OSCondition]” zamiast wywołań „RuntimeInformation.IsOSPlatform” z wczesnym powrotem lub „Assert.Inconclusive”

# UseOSConditionAttributeInsteadOfRuntimeCheckMessageFormat
source: Use '[OSCondition]' attribute instead of 'RuntimeInformation.IsOSPlatform' calls with early return or 'Assert.Inconclusive'
pl: Użyj atrybutu „[OSCondition]” zamiast wywołań „RuntimeInformation.IsOSPlatform” z wczesnym powrotem lub „Assert.Inconclusive”

# UseOSConditionAttributeInsteadOfRuntimeCheckDescription
source: Test methods that use 'RuntimeInformation.IsOSPlatform' with early return or 'Assert.Inconclusive' should use the '[OSCondition]' attribute instead. This attribute provides a more declarative and discoverable way to specify OS-specific test requirements.
pl: W metodach testowych używających metody „RuntimeInformation.IsOSPlatform” z wczesnym powrotem lub metody „Assert.Inconclusive” należy użyć atrybutu „[OSCondition]”. Ten atrybut zapewnia bardziej deklaratywny i wykrywalny sposób określania wymagań dotyczących testów specyficznych dla systemu operacyjnego.

# DuplicateTestMethodAttributeTitle
source: Avoid duplicate test method attributes
pl: Unikaj powielania atrybutów metody testowej

# DuplicateTestMethodAttributeMessageFormat
source: Test method '{0}' has multiple attributes that inherit from 'TestMethodAttribute'. Only one test method attribute should be used.
pl: Metoda testowa „{0}” ma wiele atrybutów dziedziczących po elemencie „TestMethodAttribute”. Należy użyć tylko jednego atrybutu metody testowej.

# DuplicateTestMethodAttributeDescription
source: A test method should be marked with exactly one attribute that is or inherits from 'TestMethodAttribute'. When multiple such attributes are present, only the first one returned by reflection will be used.
pl: Metoda testowa powinna mieć dokładnie jeden atrybut, który jest lub dziedziczy po elemencie „TestMethodAttribute”. Gdy jest ich kilka, używany jest tylko pierwszy zwrócony przez mechanizm refleksji.

# AvoidExpectedExceptionAttributeDescription
source: Prefer 'Assert.ThrowsExactly' or 'Assert.ThrowsExactlyAsync' over '[ExpectedException]' as it ensures that only the expected call throws the expected exception. The assert APIs also provide more flexibility and allow you to assert extra properties of the exception.
cs: Preferujte Assert.ThrowsExactly nebo Assert.ThrowsExactlyAsync před [ExpectedException], protože zajišťuje, že očekávanou výjimku vyvolá pouze očekávané volání. Rozhraní API pro vyhodnocení také poskytují větší flexibilitu a umožňují vyhodnocovat další vlastnosti výjimky.
de: „Assert.ThrowsExactly“ oder „Assert.ThrowsExactlyAsync“ gegenüber „[ExpectedException]“ bevorzugen, da dadurch sichergestellt wird, dass nur der erwartete Aufruf die erwartete Ausnahme auslöst. Die Assert-APIs bieten außerdem mehr Flexibilität und ermöglichen es Ihnen, zusätzliche Eigenschaften der Ausführung zu bestätigen.
es: Preferir "Assert.ThrowsExactly" o "Assert.ThrowsExactlyAsync" en lugar de "[ExpectedException]", ya que garantiza que solo la llamada esperada inicie la excepción esperada. Las API de aserción también proporcionan más flexibilidad y permiten declarar propiedades adicionales de la ejecución.
fr: Préférez « Assert.ThrowsExactly » ou « Assert.ThrowsExactlyAsync » à « [ExpectedException] », car il garantit que seul l’appel attendu lève l’exception attendue. Les API d’assertion offrent également plus de flexibilité et vous permettent de déclarer des propriétés supplémentaires de l’exception.
it: Preferire 'Assert.ThrowsExactly' o 'Assert.ThrowsExactlyAsync' a '[ExpectedException]' perché assicura che solo la chiamata prevista generi l'eccezione prevista. Le API di asserzione offrono anche maggiore flessibilità e consentono di dichiarare proprietà aggiuntive dell'eccezione.
ja: '[ExpectedException]' よりも 'Assert.ThrowsExactly' または 'Assert.ThrowsExactlyAsync' を優先します。これは、予期された呼び出しのみが予期された例外をスローするようにするためです。アサート API もさらに柔軟性が高く、これにより例外の追加プロパティをアサートできます。
pt_br: Prefira 'Assert.ThrowsExactly' ou 'Assert.ThrowsExactlyAsync' em vez de '[ExpectedException]', pois isso garante que apenas a chamada esperada lance a exceção esperada. As APIs de assert também oferecem mais flexibilidade e permitem que você afirme propriedades adicionais da exceção.
ru: Предпочтите "Assert.ThrowsExactly' или 'Assert.ThrowsExactlyAsync" вместо "[ExpectedException]", так как это гарантирует, что только ожидаемый вызов вызовет ожидаемое исключение. API-интерфейсы утверждения также обеспечивают дополнительную гибкость и позволяют утверждать дополнительные свойства исключения.
tr: Yalnızca beklenen çağrının beklenen özel durumu oluşturmasını sağladığı için '[ExpectedException]' yerine 'Assert.ThrowsExactly' veya 'Assert.ThrowsExceptionAsync' tercih edin. Onaylama API'leri de daha fazla esneklik sağlar ve özel durumun ek özelliklerini onaylamanıza izin verir.
zh_hans: 首选“Assert.ThrowsExactly”或“Assert.ThrowsExactlyAsync”，而不是“[ExpectedException]”，因为它确保只有预期调用才会引发预期异常。断言 API 还提供更多的灵活性，并允许你断言异常的额外属性。

# AvoidExpectedExceptionAttributeMessageFormat
source: Prefer 'Assert.ThrowsExactly/ThrowsExactlyAsync' over '[ExpectedException]'
cs: Preferovat Assert.ThrowsExactly/ThrowsExactlyAsync před [ExpectedException]
de: „Assert.ThrowsExactly/ThrowsExactlyAsync“ gegenüber „[ExpectedException]“ bevorzugen
es: Preferir "Assert.ThrowsExactly/ThrowsExactlyAsync" en lugar de "[ExpectedException]"
fr: Préférez « Assert.ThrowsExactly/ThrowsExactlyAsync » à « [ExpectedException] »
it: Preferire 'Assert.ThrowsExactly/ThrowsExactlyAsync' a '[ExpectedException]'
ja: '[ExpectedException]' よりも 'Assert.ThrowsExactly/ThrowsExactlyAsync' を優先する
pt_br: Prefira 'Assert.ThrowsExactly/ThrowsExactlyAsync' em vez de '[ExpectedException]'
ru: Предпочтите "Assert.ThrowsExactly/ThrowsExactlyAsync" вместо "[ExpectedException]"
tr: '[ExpectedException]' yerine 'Assert.ThrowsExactly/ThrowsExactlyAsync' tercih edin
zh_hans: 首先“Assert.ThrowsExactly/ThrowsExactlyAsync”而不是“[ExpectedException]”

# AvoidExpectedExceptionAttributeTitle
source: Avoid '[ExpectedException]'
cs: Vyhněte se [ExpectedException]
de: „[ExpectedException]“ vermeiden
es: Evitar '[ExpectedException]'
fr: Éviter « [ExpectedException] »
it: Evita '[ExpectedException]'
ja: '[ExpectedException]' を回避する
ko: '[ExpectedException]' 사용 지양
pt_br: Evitar '[ExpectedException]'
ru: Избегать "[ExpectedException]"
tr: '[ExpectedException]' kullanmayın
zh_hans: 避免 "[ExpectedException]"

# FlowTestContextCancellationTokenDescription
source: When calling async methods that have overloads accepting a CancellationToken parameter, prefer using the overload with TestContext.CancellationTokenSource.Token to enable cooperative cancellation and respect test timeouts.
cs: Při volání asynchronních metod, které mají přetížení akceptující parametr CancellationToken, upřednostňujte použití přetížení s TestContext.CancellationTokenSource.Token, aby se umožnilo kooperativní rušení a dodržování časových limitů testů.
de: Wenn Sie asynchrone Methoden aufrufen, die über Überladungen verfügen, die einen CancellationToken-Parameter akzeptieren, bevorzugen Sie die Verwendung der Überladung mit TestContext.CancellationTokenSource.Token, um einen kooperativen Abbruch zu ermöglichen und Testtimeouts zu berücksichtigen.
es: Al llamar a métodos asincrónicos que tienen sobrecargas que aceptan un parámetro CancellationToken, es preferible utilizar la sobrecarga con TestContext.CancellationTokenSource.Token para habilitar la cancelación cooperativa y respetar los tiempos de espera de las pruebas.
fr: Lors de l’appel de méthodes asynchrones qui ont des surcharges acceptant un paramètre CancellationToken, préférez utiliser la surcharge avec TestContext.CancellationTokenSource.Token pour activer l’annulation collaborative et respecter les délais d’expiration des tests.
it: Quando si chiamano metodi asincroni con overload che accettano un parametro CancellationToken, preferire l'uso dell'overload con TestContext.CancellationTokenSource.Token per abilitare l'annullamento cooperativo e rispettare i timeout di test.
ja: CancellationToken パラメーターを受け入れるオーバーロードを持つ非同期メソッドを呼び出す場合は、TestContext.CancellationTokenSource.Token でオーバーロードを使用して協調的な取り消しを有効にし、テスト タイムアウトを考慮します。
pt_br: Ao chamar métodos assíncronos que tenham sobrecargas que aceitam um parâmetro CancellationToken, prefira usar a sobrecarga com TestContext.CancellationTokenSource.Token para habilitar o cancelamento cooperativo e respeitar os tempos limite do teste.
ru: При вызове асинхронных методов с перегрузками, принимающими параметр CancellationToken, рекомендуется использовать перегрузку с TestContext.CancellationTokenSource.Token, чтобы обеспечить кооперативную отмену и учитывать времена ожидания теста.
tr: CancellationToken parametresini kabul eden aşırı yüklemeleri olan asenkron yöntemleri çağırırken, işbirliğine dayalı iptal işlemini etkinleştirmek ve test zaman aşımlarını dikkate almak için TestContext.CancellationTokenSource.Token ile aşırı yüklemeyi kullanmayı tercih edin.
zh_hans: 在调用包含接受 CancellationToken 参数的重载的异步方法时，建议使用 TestContext.CancellationTokenSource.Token 的重载，以启用协作取消并遵守测试超时。

# FlowTestContextCancellationTokenMessageFormat
source: Consider using the overload that accepts a CancellationToken and pass 'TestContext.CancellationTokenSource.Token'
cs: Zvažte použití přetížení, které přijímá CancellationToken a předejte TestContext.CancellationTokenSource.Token.
de: Erwägen Sie die Verwendung der Überladung, die ein CancellationToken akzeptiert, und übergeben Sie „TestContext.CancellationTokenSource.Token“.
es: Considere utilizar la sobrecarga que acepta un CancellationToken y pase 'TestContext.CancellationTokenSource.Token'
fr: Envisagez d’utiliser la surcharge qui accepte un CancellationToken et passe « TestContext.CancellationTokenSource.Token »
it: Valutare la possibilità di usare l'overload che accetta un CancellationToken e a passare 'TestContext.CancellationTokenSource.Token'
ja: CancellationToken を受け取り、'TestContext.CancellationTokenSource.Token' を渡すオーバーロードの使用を検討してください
pt_br: Considere usar a sobrecarga que aceita um CancellationToken e passar "TestContext.CancellationTokenSource.Token"
ru: Рассмотрите возможность использования перегрузки, которая принимает CancellationToken, и передавайте "TestContext.CancellationTokenSource.Token"
tr: CancellationToken'ı kabul eden aşırı yüklemeyi kullanmayı düşünün ve 'TestContext.CancellationTokenSource.Token'i geçirin.
zh_hans: 请考虑使用接受 CancellationToken 的重载，并传递 'TestContext.CancellationTokenSource.Token'

# UseClassCleanupBehaviorEndOfClassDescription
source: Without using 'ClassCleanupBehavior.EndOfClass', the '[ClassCleanup]' will by default be run at the end of the assembly and not at the end of the class.
cs: Když nepoužijete ClassCleanupBehavior.EndOfClass, [ClassCleanup] se ve výchozím nastavení spustí na konci sestavení, nikoli na konci třídy.
de: Ohne Verwendung von „ClassCleanupBehavior.EndOfClass“ wird „[ClassCleanup]“ standardmäßig am Ende der Assembly und nicht am Ende der Klasse ausgeführt.
es: Sin usar 'ClassCleanupBehavior.EndOfClass', el '[ClassCleanup]' se ejecutará de forma predeterminada al final del ensamblado y no al final de la clase.
fr: Sans utiliser 'ClassCleanupBehavior.EndOfClass', '[ClassCleanup]' sera exécuté par défaut à la fin de l’assemblée et non à la fin de la classe.
it: Se non si usa 'ClassCleanupBehavior.EndOfClass', '[ClassCleanup]' verrà eseguito per impostazione predefinita alla fine dell'assembly e non alla fine della classe.
ja: 'ClassCleanupBehavior.EndOfClass' を使用しない場合、'[ClassCleanup]' は既定でアセンブリの最後に実行され、クラスの最後には実行されません。
ko: 'ClassCleanupBehavior.EndOfClass'를 사용하지 않으면 '[ClassCleanup]'은 기본적으로 클래스의 끝이 아니라 어셈블리의 끝에서 실행됩니다.
pt_br: Sem usar o "ClassCleanupBehavior.EndOfClass", o "[ClassCleanup]" será executado, por padrão, no final do assembly e não no final da classe.
ru: Без использования "ClassCleanupBehavior.EndOfClass" "[ClassCleanup]" по умолчанию будет выполняться в конце сборки, а не в конце класса.
tr: 'ClassCleanupBehavior.EndOfClass' kullanılmadığında, '[ClassCleanup]' varsayılan olarak sınıfın sonunda değil derlemenin sonunda çalıştırılır.
zh_hans: 如果不使用 "ClassCleanupBehavior.EndOfClass"，"[ClassCleanup]" 将默认在程序集末尾运行，而不是在类的末尾运行。

# UseClassCleanupBehaviorEndOfClassMessageFormat
source: Use 'ClassCleanupBehavior.EndOfClass' with the '[ClassCleanup]'
cs: S [ClassCleanup] použijte ClassCleanupBehavior.EndOfClass.
de: Verwenden von „ClassCleanupBehavior.EndOfClass“ mit „[ClassCleanup]“
es: Use 'ClassCleanupBehavior.EndOfClass' con '[ClassCleanup]'
fr: Utilisez 'ClassCleanupBehavior.EndOfClass' avec '[ClassCleanup]'
it: Usare 'ClassCleanupBehavior.EndOfClass' con '[ClassCleanup]'
ja: 'ClassCleanupBehavior.EndOfClass' を '[ClassCleanup]' と共に使用してください
ko: '[ClassCleanup]'과 함께 'ClassCleanupBehavior.EndOfClass' 사용
pt_br: Use "ClassCleanupBehavior.EndOfClass" com o "[ClassCleanup]"
ru: Использовать "classCleanupBehavior.EndOfClass" с "[ClassCleanup]"
tr: '[ClassCleanup]' ile 'ClassCleanupBehavior.EndOfClass' kullanın
zh_hans: 将 "ClassCleanupBehavior.EndOfClass" 与 "[ClassCleanup]" 配合使用
