Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AssertionArgsShouldAvoidConditionalAccessMessageFormat
source: Prefer adding an additional assertion that checks for null
cs: Preferovat přidání dalšího kontrolního výrazu, který kontroluje hodnotu null
de: Lieber eine zusätzliche Assertion hinzufügen, die auf NULL überprüft
es: Preferir agregar una aserción adicional que compruebe si hay valores NULL
fr: Préférer l’ajout d’une assertion supplémentaire qui recherche la valeur null
it: Preferire l'aggiunta di un'ulteriore asserzione che controlli la presenza di valori null
ja: 追加のアサーションによる null チェックを推奨する
ko: null을 확인하는 추가 어설션을 추가하는 것이 좋습니다.
pl: Preferuj dodawanie dodatkowej asercji, która sprawdza pod kątem wartości null
pt_br: Preferir adicionar uma declaração adicional que verifica se existe um nulo
ru: Предпочитайте добавление дополнительного утверждения, проверяющего наличие значения NULL
tr: Null değerini denetlerken ek bir onaylama eklemeyi tercih et
zh_hans: 首选添加检查 null 的其他断言
zh_hant: 偏好新增檢查 Null 的其他判斷提示

# AssertionArgsShouldAvoidConditionalAccessTitle
source: Avoid conditional access in assertions
cs: Vyhnout se podmíněnému přístupu v kontrolních výrazech
de: Bedingten Zugriff in Assertionen vermeiden
es: Evitar el acceso condicional en las aserciones
fr: Éviter l’accès conditionnel dans les assertions
it: Evitare l'accesso condizionale nelle asserzioni
ja: アサーションの中で条件付きアクセスの使用を避ける
ko: 어설션에서 조건부 액세스 방지
pl: Unikaj dostępu warunkowego w asercjach
pt_br: Evitar o acesso condicional nas declarações
ru: Избегайте условного доступа в утверждениях
tr: Onaylamalarda koşullu erişimden kaçın
zh_hans: 避免断言中的条件访问
zh_hant: 避免判斷提示中的條件式存取

# AssertionArgsShouldBePassedInCorrectOrderDescription
source: 'Assert.AreEqual', 'Assert.AreNotEqual', 'Assert.AreSame' and 'Assert.AreNotSame' expects the expected value to be passed first and the actual value to be passed as second argument.
cs: Assert.AreEqual, Assert.AreNotEqual, Assert.AreSame a Assert.AreNotSame očekává, že se jako první argument předá očekávaná hodnota a jako druhý argument skutečná hodnota.
de: “Assert.AreEqual“, „Assert.AreNotEqual“, „Assert.AreSame“ und „Assert.AreNotSame“ erwarten, dass der erwartete Wert zuerst übergeben wird und der tatsächliche Wert als zweites Argument übergeben wird.
es: "Assert.AreEqual", "Assert.AreNotEqual", "Assert.AreSame" y "Assert.AreNotSame" esperan que el valor esperado se pase primero y que el valor real se pase como segundo argumento.
fr: « Assert.AreEqual », « Assert.AreNotEqual », « Assert.AreSame » et « Assert.AreNotSame » supposent que la valeur attendue soit passée en premier et que la valeur réelle soit passée en tant que deuxième argument.
it: "Assert.AreEqual", "Assert.AreNotEqual", "Assert.AreSame" e "Assert.AreNotSame" prevedono che il valore previsto venga passato per primo e il valore effettivo come secondo argomento.
ja: 'Assert.AreEqual'、'Assert.AreNotEqual'、'Assert.AreSame'、および 'Assert.AreNotSame' では、必要な値が最初に渡され、実際の値が 2 番目の引数として渡される必要があります。
ko: 'Assert.AreEqual', 'Assert.AreNotEqual', 'Assert.AreSame' 및 'Assert.AreNotSame'에는 필요한 값이 먼저 전달되고 실제 값이 두 번째 인수로 전달되어야 합니다.
pl: Elementy „Assert.AreEqual”, „Assert.AreNotEqual”, „Assert.AreSame” i „Assert.AreNotSame” oczekują przekazania oczekiwanej wartości jako pierwszej, a rzeczywistej wartości jako drugiego argumentu.
pt_br: "Assert.AreEqual", "Assert.AreNotEqual", "Assert.AreSame" e "Assert.AreNotSame" esperam que o valor esperado seja passado primeiro e o valor real seja passado como o segundo argumento.
ru: "Assert.AreEqual", "Assert.AreNotEqual", "Assert.AreSame" и "Assert.AreNotSame" ожидают, что сначала будет передано ожидаемое значение, а фактическое значение будет передано в качестве второго аргумента.
tr: 'Assert.AreEqual', 'Assert.AreNotEqual', 'Assert.AreSame' ve 'Assert.AreNotSame' ilk olarak beklenen değerin geçirilmesini ve gerçek değerin ikinci bağımsız değişken olarak geçirilmesini bekliyor.
zh_hans: “Assert.AreEqual”、“Assert.AreNotEqual”、“Assert.AreSame” 和 “Assert.AreNotSame” 要求先传递预期值，然后将实际值作为第二个参数传递。
zh_hant: 'Assert.AreEqual'、'Assert.AreNotEqual'、'Assert.AreSame' 和 'Assert.AreNotSame' 預期值必須先傳遞，而實際值則會以第二個引數傳遞。

# AssertionArgsShouldBePassedInCorrectOrderMessageFormat
source: Assertion arguments should be passed in the correct order. 'actual' and 'expected'/'notExpected' arguments have been swapped.
cs: Argumenty kontrolního výrazu musí být předány ve správném pořadí. Argumenty actual a expected/notExpected byly prohozeny.
de: Assertionsargumente sollten in der richtigen Reihenfolge übergeben werden. Die Argumente „actual“ und „expected“/“notExpected“ wurden ausgetauscht.
es: Los argumentos de aserción deben pasarse en el orden correcto. Se han intercambiado los argumentos "actual" y "expected"/"notExpected".
fr: Les arguments d’assertion doivent être passés dans l’ordre approprié. Les arguments « actual » et « expected »/« notExpected » ont été permutés.
it: Gli argomenti dell'asserzione devono essere passati nell'ordine corretto. Gli argomenti "actual" ed "expected"/"notExpected" sono stati invertiti.
ja: アサーション引数は正しい順序で渡す必要があります。'actual' 引数と 'expected'/'notExpected' 引数がスワップされました。
ko: 어설션 인수는 올바른 순서로 전달되어야 합니다. 'actual' 및 'expected'/'notExpected' 인수가 바뀌었습니다.
pl: Argumenty asercji powinny być przekazywane w poprawnej kolejności. Argumenty „actual” i „expected”/„notExpected” zostały zamienione.
pt_br: Os argumentos de asserção devem ser passados na ordem correta. Os argumentos "actual" e "expected"/"notExpected" foram trocados.
ru: Аргументы проверочных утверждений должны передаваться в правильном порядке. Аргументы "actual" и "expected"/"notExpected" были переставлены местами.
tr: Onay deyimi bağımsız değişkenleri doğru sıralama düzeninde geçirilmelidir. 'actual' ve 'expected'/'notExpected' bağımsız değişkenleri değiştirildi.
zh_hans: 应按正确的顺序传递断言参数。已交换 “actual” 和 “expected”/“notExpected” 参数。
zh_hant: 應該以正確的順序傳遞判斷提示引數。已交換 'actual' 和 'expected'/'notExpected' 引數。

# AssertionArgsShouldBePassedInCorrectOrderTitle
source: Assertion arguments should be passed in the correct order
cs: Argumenty kontrolního výrazu musí být předány ve správném pořadí
de: Assertionsargumente sollten in der richtigen Reihenfolge übergeben werden.
es: Los argumentos de aserción deben pasarse en el orden correcto
fr: Les arguments d’assertion doivent être passés dans l’ordre approprié
it: Gli argomenti dell'asserzione devono essere passati nell'ordine corretto
ja: アサーション引数は正しい順序で渡す必要があります
ko: 어설션 인수는 올바른 순서로 전달되어야 합니다.
pl: Argumenty asercji powinny być przekazywane w poprawnej kolejności
pt_br: Os argumentos de asserção devem ser passados na ordem correta
ru: Аргументы проверочных утверждений должны передаваться в правильном порядке
tr: Onay deyimi bağımsız değişkenleri doğru sıralama düzeninde geçirilmelidir
zh_hans: 应按正确的顺序传递断言参数
zh_hant: 應該以正確的順序傳遞判斷提示引數

# AvoidAssertAreSameWithValueTypesDescription
source: Use 'Assert.AreEqual'/'Assert.AreNotEqual' instead of 'Assert.AreSame'/'Assert.AreNotSame' when comparing value types. Passing a value type to 'Assert.AreSame'/'Assert.AreNotSame' will be boxed (creating a new object). Because 'Assert.AreSame'/'Assert.AreNotSame' does the comparison by reference, 'Assert.AreSame' will fail when boxing happens, and 'Assert.AreNotSame' will always pass.
cs: Při porovnávání typů hodnot použijte Assert.AreEqual/Assert.AreNotEqual místo Assert.AreSame/Assert.AreNotSame. Předání typu hodnoty do assert.AreSame/Assert.AreNotSame bude zabaleno (vytváření nového objektu). Protože Assert.AreSame/Assert.AreNotSame provádí porovnání podle odkazu, Assert.AreSame selže, když dojde k zabalení, a Assert.AreNotSame vždy proběhne.
de: Verwenden Sie beim Vergleichen von Werttypen "Assert.AreEqual"/"Assert.AreNotEqual" anstelle von "Assert.AreSame"/"Assert.AreNotSame". Das Übergeben eines Werttyps an "Assert.AreSame"/"Assert.AreNotSame" wird geschachtelt (ein neues Objekt wird erstellt). Da "Assert.AreSame"/"Assert.AreNotSame" den Vergleich als Verweis führt, tritt bei "Assert.AreSame" beim Boxing ein Fehler auf, und "Assert.AreNotSame" wird immer übergeben.
es: Use 'Assert.AreEqual'/'Assert.AreNotEqual' en lugar de 'Assert.AreSame'/'Assert.AreNotSame' al comparar tipos de valor. Al pasar un tipo de valor a 'Assert.AreSame'/'Assert.AreNotSame', se aplicará la conversión boxing (creando un nuevo objeto). Dado que 'Assert.AreSame'/'Assert.AreNotSame' realiza la comparación por referencia, 'Assert.AreSame' producirá un error cuando se produzca una conversión boxing y 'Assert.AreNotSame' pasará siempre.
fr: Utilisez 'Assert.AreEqual'/'Assert.AreNotEqual' à la place de 'Assert.AreSame'/'Assert.AreNotSame' lors de la comparaison des types valeur. Le passage d’un type valeur à 'Assert.AreSame'/'Assert.AreNotSame' est encadré (création d’un objet). Dans la mesure où 'Assert.AreSame'/'Assert.AreNotSame' effectue la comparaison par référence, 'Assert.AreSame' échoue quand le boxing se produit et 'Assert.AreNotSame' passe toujours.
it: Usare 'Assert.AreEqual'/'Assert.AreNotEqual' invece di 'Assert.AreSame'/'Assert.AreNotSame' durante il confronto dei tipi valore. Se si passa un tipo valore a 'Assert.AreSame'/'Assert.AreNotSame', verrà eseguito il boxing (creazione di un nuovo oggetto). Poiché 'Assert.AreSame'/'Assert.AreNotSame' esegue il confronto per riferimento, 'Assert.AreSame' non riuscirà quando si esegue la boxing e 'Assert.AreNotSame' passerà sempre.
ja: 値の型を比較するときは、'Assert.AreSame'/'Assert.AreNotSame' の代わりに 'Assert.AreEqual'/'Assert.AreNotEqual' を使用してください。値の型を 'Assert.AreSame'/'Assert.AreNotSame' に渡すとボックス化されます (新しいオブジェクトが作成されます)。'Assert.AreSame'/'Assert.AreNotSame' は参照による比較を行うため、ボックス化が発生すると 'Assert.AreSame' は失敗し、'Assert.AreNotSame' は常に渡されます。
pl: Użyj metody Assert.AreEqual'/'Assert.AreNotEqual' zamiast assert.AreSame'/'Assert.AreNotSame' podczas porównywania typów wartości. Przekazanie typu wartości do elementu "Assert.AreSame"/"Assert.AreNotSame" zostanie opakowane (tworzenie nowego obiektu). Ponieważ funkcja "Assert.AreSame"/"Assert.AreNotSame" wykonuje porównanie przez referencję, operacja "Assert.AreSame" zakończy się niepowodzeniem, gdy nastąpi konwersja boxing, a element "Assert.AreNotSame" zawsze przejdzie.
pt_br: Use 'Assert.AreEqual'/'Assert.AreNotEqual' em vez de 'Assert.AreSame'/'Assert.AreNotSame' ao comparar tipos de valor. Passar um tipo de valor para 'Assert.AreSame'/'Assert.AreNotSame' será em caixa (criando um novo objeto). Como 'Assert.AreSame'/'Assert.AreNotSame' faz a comparação por referência, 'Assert.AreSame' falhará quando ocorrer boxing e 'Assert.AreNotSame' sempre será aprovado.
ru: При сравнении типов значений используйте "Assert.AreEqual"/"Assert.AreNotEqual" вместо "Assert.AreSame"/"Assert.AreNotSame". Передача типа значения в "Assert.AreSame"/"Assert.AreNotSame" будет добавлена в рамку (создание нового объекта). Поскольку "Assert.AreSame"/"Assert.AreNotSame" выполняет сравнение по ссылке, при боксе "Assert.AreSame" будет выполняться с ошибкой, а "Assert.AreNotSame" всегда будет проходить.
tr: Değer türlerini karşılaştırılırken 'Assert.AreSame'/'Assert.AreNotSame' yerine 'Assert.AreEqual'/'Assert.AreNotSame' kullanın. 'Assert.AreSame'/'Assert.AreNotSame' değerine bir değer türü geçirilemedi (yeni bir nesne oluşturuluyor). 'Assert.AreSame'/'Assert.AreNotSame' başvuruya göre karşılaştırmayı yapar, kutulama gerçekleşirken 'Assert.AreSame' başarısız olur ve 'Assert.AreNotSame' her zaman başarılı olur.
zh_hans: 比较值类型时，请使用 “Assert.AreEqual”/“Assert.AreNotEqual” 而不是 “Assert.AreSame”/“Assert.AreNotSame”。将值类型传递给 “Assert.AreSame”/“Assert.AreNotSame”将装箱 (创建新的对象)。由于 'Assert.AreSame'/'Assert.AreNotSame' 按引用进行比较，所以当装箱发生时，“Assert.AreSame” 将失败，并且 “Assert.AreNotSame” 将始终通过。
zh_hant: 比較值類型時，請使用 'Assert.AreEqual'/'Assert.AreNotEqual' 取代 'Assert.AreSame'/'Assert.AreNotSame'。將值類型傳遞至 『Assert.AreSame』/'Assert.AreNotSame' 將會在建立新物件) (方塊化。因為 'Assert.AreSame'/'Assert.AreNotSame' 依參照進行比較，當進行拳擊時，'Assert.AreSame' 將會失敗，而且 'Assert.AreNotSame' 一律會通過。

# AvoidAssertAreSameWithValueTypesMessageFormat
source: Use '{0}' instead of '{1}' when comparing value types
cs: Při porovnávání typů hodnot použít '{0}' místo '{1}'
de: Beim Vergleichen von Werttypen '{0}' anstelle von '{1}' verwenden
es: Usar '{0}' en lugar de '{1}' al comparar tipos de valor
fr: Utiliser '{0}' au lieu de '{1}' lors de la comparaison de types valeur
it: Usa '{0}' invece di '{1}' durante il confronto dei tipi di valore
ja: 値の型を比較するときに '{1}' の代わりに '{0}' を使用する
pl: Użyj '{0}' zamiast '{1}' podczas porównywania typów wartości
pt_br: Usar '{0}' em vez de '{1}' ao comparar tipos de valor
ru: Использовать '{0}' вместо '{1}' при сравнении типов значений
tr: Değer '{0}' karşılaştırılırken '{1}' yerine farklı bir ad kullanın
zh_hans: 比较值类型时使用 '{0}' 而不是 '{1}'
zh_hant: 比較值類型時，使用 '{0}' 而非 '{1}'

# AvoidAssertAreSameWithValueTypesTitle
source: Don't use 'Assert.AreSame' or 'Assert.AreNotSame' with value types
cs: Nepoužívejte Assert.AreSame ani Assert.AreNotSame s typy hodnot.
de: Verwenden Sie "Assert.AreSame" oder "Assert.AreNotSame" nicht mit Werttypen.
es: No use "Assert.AreSame" o "Assert.AreNotSame" con tipos de valor
fr: N’utilisez pas 'Assert.AreSame' ou 'Assert.AreNotSame' avec des types valeur
it: Non usare 'Assert.AreSame' o 'Assert.AreNotSame' con i tipi di valore
ja: 値型に 'Assert.AreSame' または 'Assert.AreNotSame' を使用しないでください
pl: Nie używaj elementu "Assert.AreSame" ani "Assert.AreNotSame" z typami wartości
pt_br: Não use 'Assert.AreSame' ou 'Assert.AreNotSame' com tipos de valor
ru: Не используйте Assert.AreSame или Assert.AreNotSame с типами значений
tr: Değer türleriyle 'Assert.AreSame' veya 'Assert.AreNotSame' kullanma
zh_hans: 不要将 “Assert.AreSame” 或 “Assert.AreNotSame” 与值类型一起使用
zh_hant: 不要在值類型中使用 'Assert.AreSame' 或 'Assert.AreNotSame'

# AvoidExplicitDynamicDataSourceTypeMessageFormat
source: Remove the 'DynamicDataSourceType' argument to use the default auto detect behavior
pl: Usuń argument „DynamicDataSourceType”, aby użyć domyślnego zachowania wykrywania automatycznego
zh_hant: 移除 'DynamicDataSourceType' 引數，以使用預設的自動偵測行為

# AvoidExplicitDynamicDataSourceTypeTitle
source: Avoid passing an explicit 'DynamicDataSourceType' and use the default auto detect behavior
pl: Unikaj przekazywania jawnego elementu „DynamicDataSourceType” i użyj domyślnego zachowania wykrywania automatycznego
zh_hant: 避免傳遞明確的 'DynamicDataSourceType'，並使用預設的自動偵測行為

# AvoidUsingAssertsInAsyncVoidContextDescription
source: Do not assert inside 'async void' methods, local functions, or lambdas. Exceptions that are thrown in this context will be unhandled exceptions. When using VSTest under .NET Framework, they will be silently swallowed. When using Microsoft.Testing.Platform or VSTest under modern .NET, they may crash the process.
cs: Nepoužívejte výraz uvnitř metod async void, místních funkcí nebo výrazů lambda. Výjimky vyvolané v tomto kontextu budou neošetřené výjimky. Když používáte VSTest v .NET Framework, budou se bezobslužně používat. Když používáte Microsoft.Testing.Platform nebo VSTest v moderním rozhraní .NET, může dojít k chybovému ukončení procesu.
de: Nicht innerhalb von "async void"-Methoden, lokalen Funktionen oder Lambdafunktionen bestätigen. Ausnahmen, die in diesem Kontext ausgelöst werden, werden nicht behandelt. Bei Verwendung von VSTest unter .NET Framework werden diese im Hintergrund verschlungen. Wenn Sie Microsoft.Testing.Platform oder VSTest unter modernem .NET verwenden, kann der Prozess abgestürzt werden.
es: No realice ninguna aserción dentro de métodos 'async void', funciones locales o expresiones lambda. Las excepciones que se inicien en este contexto serán excepciones no controladas. Al usar VSTest en .NET Framework, se ingerirán silenciosamente. Cuando se usa Microsoft.Testing.Platform o VSTest en .NET moderno, es posible que se bloquee el proceso.
fr: N’effectuez pas d’assertion dans les méthodes 'async void', les fonctions locales ou les expressions lambda. Les exceptions levées dans ce contexte seront des exceptions non gérées. Lors de l’utilisation de VSTest sous .NET Framework, ils sont silencieusement coupés. Quand vous utilisez Microsoft.Testing.Platform ou VSTest sous .NET moderne, ils peuvent bloquer le processus.
it: Non dichiarare all'interno di metodi 'async void', funzioni locali o espressioni lambda. Le eccezioni generate in questo contesto saranno eccezioni non gestite. Quando si usa VSTest in .NET Framework, verranno eliminati automaticamente. Quando si usa Microsoft.Testing.Platform o VSTest nella versione moderna di .NET, è possibile che il processo venga arrestato in modo anomalo.
ja: 'async void' メソッド、ローカル関数、またはラムダ内ではアサートしないでください。このコンテキストでスローされる例外は、ハンドルされない例外になります。.NET Frameworkで VSTest を使用すると、警告なしに飲み込まれるようになります。最新の .NET で Microsoft.Testing.Platform または VSTest を使用すると、プロセスがクラッシュする可能性があります。
pl: Nie potwierdzaj wewnątrz metod "async void", funkcji lokalnych ani lambda. Wyjątki, które są zgłaszane w tym kontekście, będą nieobsługiwanymi wyjątkami. W przypadku korzystania z narzędzia VSTest w .NET Framework będą one dyskretnie ściszone. W przypadku korzystania z elementu Microsoft.Testing.Platform lub VSTest w nowoczesnych programach .NET mogą one spowodować awarię procesu.
pt_br: Não asserção dentro de métodos 'async void', funções locais ou lambdas. Exceções lançadas neste contexto serão exceções sem tratamento. Ao usar VSTest sob .NET Framework, eles serão silenciosamente ignoradas. Ao usar Microsoft.Testing.Platform ou VSTest em .NET moderno, o processo pode falhar.
ru: Не подтверяйте внутри методов async void, локальных функций или лямбда-выражений. Исключения, вызванные в этом контексте, будут необработанные исключения. При использовании VSTest платформа .NET Framework, они будут пропущены без уведомления. При использовании Microsoft.Testing.Platform или VSTest в современной версии .NET они могут привести к сбою процесса.
tr: 'async void' metotları, yerel işlevler veya lambdalar içinde onaylamayın. Bu bağlamda oluşturulan özel durumlar işlenmeyen özel durumlar olacak. VsTest'i .NET Framework, sessizce kırılır. Modern .NET altında Microsoft.Testing.Platform veya VSTest kullanırken işlemi kilitler.
zh_hans: 不要在 “async void” 方法、本地函数或 lambdas 内断言。在此上下文中引发的异常将是未经处理的异常。在.NET Framework下使用 VSTest 时，将无提示地接受这些测试。在现代 .NET 下使用 Microsoft.Testing.Platform 或 VSTest 时，它们可能会导致进程崩溃。
zh_hant: 不要在 'async void' 方法、本機函數或 lambdas 內判斷提示。在此內容中擲回的例外狀況將會是未處理的例外狀況。在 .NET Framework 下使用 VSTest 時，會以無訊息方式接受。在現代 .NET 下使用 Microsoft.Testing.Platform 或 VSTest 時，可能會損毀進程。

# AvoidUsingAssertsInAsyncVoidContextMessageFormat
source: Do not assert inside 'async void' methods, local functions, or lambdas because they may not fail the test
cs: Neprosazovat uvnitř metod async void, místních funkcí nebo výrazů lambda, protože test nemusí selhat
de: Nicht innerhalb von "async void"-Methoden, lokalen Funktionen oder Lambdafunktionen bestätigen, weil sie den Test möglicherweise nicht fehlschlagen lassen
es: No realizar aserciones dentro de métodos 'async void', funciones locales o expresiones lambda porque no pueden generar errores en la prueba
fr: Ne pas effectuer d’assertion dans les méthodes 'async void', les fonctions locales ou les expressions lambda, car elles ne peuvent pas faire échouer le test
it: Non dichiarare all'interno di metodi 'async void', funzioni locali o espressioni lambda perché non possono non testare il test
ja: 'async void' メソッド、ローカル関数、またはラムダはテストに失敗しない可能性があるため、内部でアサートしないでください
pl: Nie potwierdzaj wewnątrz metod "async void", funkcji lokalnych ani wyrażeń lambda, ponieważ nie mogą one zakończyć się niepowodzeniem testu
pt_br: Não declarar dentro de métodos 'async void', funções locais ou lambdas porque eles podem não falhar no teste
ru: Не подтверяйте внутри методов async void, локальных функций или лямбда-выражений, так как они не могут не пройдены
tr: 'async void' metotları, yerel işlevler veya lambdalar içinde onaylamayın çünkü test başarısız olamazlar
zh_hans: 不要在 “async void” 方法、本地函数或 lambda 中断言，因为它们可能不会使测试失败
zh_hant: 不要在 'async void' 方法、本機函數或 lambdas 內判斷提示，因為它們可能無法通過測試

# AvoidUsingAssertsInAsyncVoidContextTitle
source: Do not assert inside 'async void' contexts
cs: Neprosazovat uvnitř kontextů async void
de: Nicht innerhalb von "async void"-Kontexten bestätigen
es: No declarar dentro de contextos 'async void'
fr: Ne pas déclarer dans les contextes 'async void'
it: Non dichiarare all'interno di contesti 'async void'
ja: 'async void' コンテキスト内でアサートしないでください
pl: Nie potwierdzaj wewnątrz kontekstów "async void"
pt_br: Não declarar dentro de contextos 'async void'
ru: Не утверждать внутри контекстов async void
tr: 'async void' bağlamları içinde onaylama
zh_hans: 不要在 “async void” 上下文中断言
zh_hant: 不要在 『async void』 內容內判斷提示
