Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseClassCleanupBehaviorEndOfClassTitle
source: Use 'ClassCleanupBehavior.EndOfClass' with the '[ClassCleanup]'
cs: S [ClassCleanup] použijte ClassCleanupBehavior.EndOfClass.
de: Verwenden von „ClassCleanupBehavior.EndOfClass“ mit „[ClassCleanup]“
es: Use 'ClassCleanupBehavior.EndOfClass' con '[ClassCleanup]'
fr: Utilisez 'ClassCleanupBehavior.EndOfClass' avec '[ClassCleanup]'
it: Usare 'ClassCleanupBehavior.EndOfClass' con '[ClassCleanup]'
ja: 'ClassCleanupBehavior.EndOfClass' を '[ClassCleanup]' と共に使用してください
ko: '[ClassCleanup]'과 함께 'ClassCleanupBehavior.EndOfClass' 사용
pt_br: Use "ClassCleanupBehavior.EndOfClass" com o "[ClassCleanup]"
ru: Использовать "classCleanupBehavior.EndOfClass" с "[ClassCleanup]"
tr: '[ClassCleanup]' ile 'ClassCleanupBehavior.EndOfClass' kullanın
zh_hans: 将 "ClassCleanupBehavior.EndOfClass" 与 "[ClassCleanup]" 配合使用

# UseNewerAssertThrowsMessageFormat
source: Use 'Assert.ThrowsExactly' instead of 'Assert.ThrowsException'
cs: Místo Assert.ThrowsException použijte Assert.ThrowsExactly.
de: Verwenden Sie "Assert.ThrowsExactly" anstelle von "Assert.ThrowsException".
es: Usar "Assert.ThrowsExactly" en lugar de "Assert.ThrowsException"
fr: Utiliser 'Assert.ThrowsExactly' à la place de 'Assert.ThrowsException'
it: Usare 'Assert.ThrowsExactly' invece di 'Assert.ThrowsException'
ja: 'Assert.ThrowsException' の代わりに 'Assert.ThrowsExactly' を使用する
pt_br: Usar 'Assert.ThrowsExactly' em vez de 'Assert.ThrowsException'
ru: Используйте Assert.ThrowsExactly вместо Assert.ThrowsException
tr: 'Assert.ThrowsException' yerine 'Assert.ThrowsExactly' kullanın
zh_hans: 使用 “Assert.ThrowsExactly” 而不是 “Assert.ThrowsException”

# UseNewerAssertThrowsTitle
source: Use newer methods to assert exceptions
cs: Pro vyhodnocení výjimek použijte novější metody.
de: Neuere Methoden zum Bestätigen von Ausnahmen verwenden
es: Usar métodos más recientes para declarar excepciones
fr: Utiliser des méthodes plus nouvelles pour déclarer des exceptions
it: Usa metodi più recenti per dichiarare le eccezioni
ja: 新しいメソッドを使用して例外をアサートする
pt_br: Usar métodos mais recentes para declarar exceções
ru: Использовать более новые методы для утверждения исключений
tr: Özel durumları onaylamak için daha yeni yöntemler kullanın
zh_hans: 使用较新的方法断言异常

# AssemblyCleanupShouldBeValidDescription
source: Methods marked with '[AssemblyCleanup]' should follow the following layout to be valid: -it can't be declared on a generic class -it should be 'public' -it should be 'static' -it should not be 'async void' -it should not be a special method (finalizer, operator...). -it should not be generic -it should not take any parameter -return type should be 'void', 'Task' or 'ValueTask' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -The class should be marked with '[TestClass]' (or a derived attribute) -the class should not be generic.
ko: '[AssemblyCleanup]'으로 표시된 메서드가 유효하려면 다음 레이아웃을 따라야 합니다. -제네릭 클래스에서 선언할 수 없습니다. - 'public'이어야 합니다. - 'static'이어야 합니다. - 'async void'가 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다. - 제네릭이 아니어야 합니다. - 매개 변수를 사용하지 않아야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. 이러한 메서드를 선언하는 형식은 다음 규칙도 준수해야 합니다. -형식은 클래스여야 합니다. -클래스는 'public' 또는 'internal'이어야 합니다(테스트 프로젝트에서 '[DiscoverInternals]' 특성을 사용하는 경우). -클래스는 'static'이 되어서는 안 됩니다. -클래스는 '[TestClass]'(또는 파생 특성)로 표시되어야 합니다. -클래스는 제네릭이 아니어야 합니다.

# AvoidExpectedExceptionAttributeDescription
source: Prefer 'Assert.ThrowsException' or 'Assert.ThrowsExceptionAsync' over '[ExpectedException]' as it ensures that only the expected call throws the expected exception. The assert APIs also provide more flexibility and allow you to assert extra properties of the exeption.
ko: 예상되는 호출만 예상되는 예외를 throw하도록 보장하는 '[ExpectedException]'보다 'Assert.ThrowsException' 또는 'Assert.ThrowsExceptionAsync'를 사용하는 것이 좋습니다. 또한 Assert API는 더 많은 유연성을 제공하고 예외의 추가 속성을 어설션할 수 있도록 합니다.

# AvoidExpectedExceptionAttributeMessageFormat
source: Prefer 'Assert.ThrowsException/ThrowsExceptionAsync' over '[ExpectedException]'
ko: '[ExpectedException]'보다 'Assert.ThrowsException/ThrowsExceptionAsync' 권장

# ClassCleanupShouldBeValidDescription
source: Methods marked with '[ClassCleanup]' should follow the following layout to be valid: -it can't be declared on a generic class without the 'InheritanceBehavior' mode is set -it should be 'public' -it should be 'static' -it should not be 'async void' -it should not be a special method (finalizer, operator...). -it should not be generic -it should not take any parameter -return type should be 'void', 'Task' or 'ValueTask' -'InheritanceBehavior.BeforeEachDerivedClass' attribute parameter should be specified if the class is 'abstract' -'InheritanceBehavior.BeforeEachDerivedClass' attribute parameter should not be specified if the class is 'sealed' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -If the class is 'sealed', it should be marked with '[TestClass]' (or a derived attribute) -the class should not be generic.
ko: '[ClassCleanup]'으로 표시된 메서드가 유효하려면 다음 레이아웃을 따라야 합니다. -'InheritanceBehavior' 모드가 설정되지 않은 제네릭 클래스에서 선언할 수 없습니다. - 'public'이어야 합니다. - 'static'이어야 합니다. - 'async void'가 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다. - 제네릭이 아니어야 합니다. - 매개 변수를 사용하지 않아야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. - 클래스가 'abstract'인 경우 'InheritanceBehavior.BeforeEachDerivedClass' 특성 매개 변수를 지정해야 합니다. - 클래스가 'sealed'인 경우 'InheritanceBehavior.BeforeEachDerivedClass' 특성 매개 변수를 지정하면 안 됩니다. 이러한 메서드를 선언하는 형식은 다음 규칙도 준수해야 합니다. -형식은 클래스여야 합니다. -클래스는 'public' 또는 'internal'이어야 합니다(테스트 프로젝트에서 '[DiscoverInternals]' 특성을 사용하는 경우). -클래스는 'static'이 되어서는 안 됩니다. -클래스가 'sealed'인 경우 '[TestClass]'(또는 파생 특성)로 표시되어야 합니다. -클래스는 제네릭이 아니어야 합니다.

# DataRowShouldBeValidMessageFormat_ArgumentTypeMismatch
source: DataRow argument type should match method parameter type. Mismatches occur at indices: {0}
ko: DataRow 인수 형식은 메서드 매개 변수 형식과 일치해야 합니다. 인덱스에서 불일치 발생: {0}

# DoNotUseShadowingMessageFormat
source: Member '{0}' is already exist in the base class
ko: 멤버 '{0}'이(가) 기본 클래스에 이미 있습니다.

# DynamicDataShouldBeValidMessageFormat_SourceTypeMethod
source: '[DynamicData]' member '{0}.{1}' is a method so you should set 'DynamicDataSourceType.Method'
ko: '[DynamicData]' 멤버 '{0}.{1}'은(는) 메서드이므로 'DynamicDataSourceType.Method'를 설정해야 합니다.

# DynamicDataShouldBeValidMessageFormat_SourceTypeProperty
source: '[DynamicData]' member '{0}.{1}' is a property so you should set 'DynamicDataSourceType.Property'
ko: '[DynamicData]' 멤버 '{0}.{1}'은(는) 속성이므로 'DynamicDataSourceType.Property'를 설정해야 합니다.

# DynamicDataShouldBeValidMessageFormat_TooManyMembers
source: '[DynamicDta]' member '{0}.{1}' is found more than once
ko: '[DynamicDta]' 멤버 '{0}.{1}'을(를) 두 번 이상 찾았습니다.

# TestContextShouldBeValidDescription
source: TestContext property should follow the following layout to be valid: - it should be a property - it should be 'public' (or 'internal' if '[assembly: DiscoverInternals]' attribute is set) - it should not be 'static' - it should not be readonly.
ko: TestContext 속성은 다음 레이아웃을 따라 유효해야 합니다. - 속성이어야 합니다. - 'public'(혹은 '[assembly: DiscoverInternals]' 특성이 설정된 경우 'internal')이어야 합니다. - 'static'이 아니어야 합니다. - 읽기 전용이 아니어야 합니다.

# TestMethodShouldBeValidDescription
source: Test methods, methods marked with the '[TestMethod]' attribute, should respect the following layout to be considered valid by MSTest: - it should be 'public' (or 'internal' if '[assembly: DiscoverInternals]' attribute is set) - it should not be 'static' - it should not be generic - it should not be 'abstract' - return type should be 'void', 'Task' or 'ValueTask' - it should not be 'async void' - it should not be a special method (finalizer, operator...).
ko: '[TestMethod]' 특성으로 표시된 메서드인 테스트 메서드는 MSTest에서 유효한 것으로 간주되도록 다음 레이아웃을 준수해야 합니다. - 'public'(혹은 '[assembly: DiscoverInternals]' 특성이 설정된 경우 'internal')이어야 합니다. - 'static'이 아니어야 합니다. - 제네릭이 아니어야 합니다. - 'abstract'가 아니어야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. - 'async void'가 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다.

# TypeContainingTestMethodShouldBeATestClassDescription
source: Type contaning '[TestMethod]' should be marked with '[TestClass]', otherwise the test method will be silently ignored.
ko: '[TestMethod]'를 포함하는 유형은 '[TestClass]'로 표시되어야 합니다. 그렇지 않으면 테스트 메서드가 자동으로 무시됩니다.

# TypeContainingTestMethodShouldBeATestClassMessageFormat
source: Class '{0}' contains test methods and should be marked with '[TestClass]'
ko: '{0}' 클래스에는 테스트 메서드가 포함되어 있으며 '[TestClass]'로 표시되어야 합니다.
