Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ClassInitializeShouldBeValidDescription
source: Methods marked with '[ClassInitialize]' should follow the following layout to be valid: -it can't be declared on a generic class without the 'InheritanceBehavior' mode is set -it should be 'public' -it should be 'static' -it should not be 'async void' -it should not be a special method (finalizer, operator...). -it should not be generic -it should take one parameter of type 'TestContext' -return type should be 'void', 'Task' or 'ValueTask' -'InheritanceBehavior.BeforeEachDerivedClass' attribute parameter should be specified if the class is 'abstract' -'InheritanceBehavior.BeforeEachDerivedClass' attribute parameter should not be specified if the class is 'sealed' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -If the class is 'sealed', it should be marked with '[TestClass]' (or a derived attribute) -the class should not be generic.
cs: Aby byly metody s označením [ClassInitialize] platné, musí se řídit následujícím rozložením: – Nesmí být deklarované pro obecnou třídu bez nastavení režimu InheritanceBehavior. – Musí být public. – Musí být static. – Nesmí být async void. – Nesmí být speciální metodou (finalizační metoda, operátor...). – Nesmí být obecné. – Musí mít jeden parametr typu TestContext. – Návratový typ musí být void, Task nebo ValueTask. – V případě třídy abstract by měl být zadán parametr atributu InheritanceBehavior.BeforeEachDerivedClass. – V případě třídy sealed by neměl být zadán parametr atributu InheritanceBehavior.BeforeEachDerivedClass. Typ deklarující tyto metody by měl také respektovat následující pravidla: – Typ by měl být třída. – Třída by měla být public nebo internal (pokud testovací projekt používá atribut [DiscoverInternals]). – Třída by neměla být static. – Pokud je třída sealed, měla by být označena atributem [TestClass] (nebo odvozeným atributem). – Třída by neměla být obecná.
de: Methoden, die mit „[ClassInitialize]“ gekennzeichnet sind, müssen dem folgenden Layout folgen, um gültig zu sein: – kann nicht für eine generische Klasse deklariert werden, ohne dass der Modus „InheritanceBehavior“ auf festgelegt ist. – muss „public“ sein – muss „static“ sein – darf nicht „async void“ sein – darf keine spezielle Methode sein (Finalizer, Operator...) – darf nicht „generic“ sein – muss einen Parameter vom Typ „TestContext“ annehmen – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein – der Attributparameter „InheritanceBehavior.BeforeEachDerivedClass“ sollte angegeben werden, wenn die Klasse „abstract“ ist – der Attributparameter „InheritanceBehavior.BeforeEachDerivedClass“ sollte angegeben werden, wenn die Klasse „sealed“ ist. Der Typ, der diese Methoden deklariert, sollte auch die folgenden Regeln beachten: – Der Typ sollte eine Klasse sein. – Die Klasse muss „public“ oder „internal“ sein (wenn das Testprojekt das Attribut „[DiscoverInternals]“ verwendet) – Die Klasse darf nicht „static“ sein. – Wenn die Klasse „sealed“ ist, sollte sie mit „[TestClass]“ (oder einem abgeleiteten Attribut) markiert werden. - die Klasse darf nicht generisch sein.
es: Los métodos marcados con '[ClassInitialize]' deben seguir el siguiente diseño para ser válidos: -no se puede declarar en una clase genérica sin el modo 'InheritanceBehavior' establecido - debería ser 'público' - debería estar 'estático' - no debería ser 'async void' -no debe ser un método especial (finalizador, operador...). -no debe ser genérico -debe tomar un parámetro de tipo 'TestContext' - El tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' Se debe especificar el parámetro de atributo -'InheritanceBehavior.BeforeEachDerivedClass' si la clase es 'abstract' - No se debe especificar el parámetro del atributo 'InheritanceBehavior.BeforeEachDerivedClass' si la clase es 'sellada' El tipo que declara estos métodos también debe respetar las reglas siguientes: -El tipo debe ser una clase -La clase debe ser 'public' o 'internal' (si el proyecto de prueba usa el atributo '[DiscoverInternals]') -La clase no debe ser 'static' -Si la clase es 'sealed', debe marcarse con '[TestClass]' (o un atributo derivado) -la clase no debe ser genérica.
fr: Les méthodes marquées par « [ClassInitialize] » doivent respecter le schéma suivant pour être valides : -il ne peut pas être déclarée dans une classe générique si le mode ’InheritanceBehavior’ n’est pas activé. – il doit être « public » – il doit être « static » – il ne doit pas être « async void » – Il ne doit pas s’agir d’une méthode spéciale (finaliseur, opérateur...). – il ne doit pas être générique – il doit prendre un paramètre de type « TestContext » - le type de retour doit être « vide », « Task » ou « ValueTask » - « InheritanceBehavior.BeforeEachDerivedClass » doit être spécifié si la classe est « abstract » -Le paramètre d’attribut « InheritanceBehavior.BeforeEachDerivedClass » ne doit pas être spécifié si la classe est « scellée » Le type déclarant ces méthodes doit également respecter les règles suivantes : Le type doit être une classe -La classe doit être « public » ou « internal » (si le projet de test utilise l’attribut ’[DiscoverInternals]’) -La classe ne doit pas être « static » -Si la classe est « sealed », elle doit être marquée avec « [TestClass] » (ou un attribut dérivé). -la classe ne doit pas être générique.
it: I metodi contrassegnati con ‘[ClassInitialize]’ devono seguire il layout seguente per essere validi: -Non può essere dichiarato in una classe generica se la modalità 'InheritanceBehavior' non è impostata - Deve essere 'public' - Deve essere 'static' - Non deve essere 'async void' - Non deve essere un metodo speciale (finalizzatore, operatore...). - Non deve essere generico - Deve accettare un parametro di tipo 'TestContext' - il tipo restituito deve essere 'void', 'Task' o 'ValueTask' - È necessario specificare il parametro dell'attributo 'InheritanceBehavior.BeforeEachDerivedClass' se la classe è 'abstract' - Non è necessario specificare il parametro dell'attributo 'InheritanceBehavior.BeforeEachDerivedClass' se la classe è 'sealed' Anche il tipo che dichiara questi metodi deve rispettare le regole seguenti: -Il tipo deve essere una classe -La classe deve essere 'public' o 'internal' (se il progetto di test usa l'attributo '[DiscoverInternals]') -La classe non deve essere 'static' -Se la classe è 'sealed', deve essere contrassegnata con '[TestClass]' (o un attributo derivato) -La classe non deve essere generica.
ja: '[ClassInitialize]' でマークされたメソッドを有効にするには、次のレイアウトに従う必要があります: - 'InheritanceBehavior' モードが設定されていないと、ジェネリック クラスで宣言できません - 'public' である必要があります - 'static' である必要があります - 'async void' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。 - ジェネリックにすることはできません - 'TestContext' 型のパラメーターを 1 つ受け取る必要があります - 戻り値の型が 'void'、'Task'、または 'ValueTask' である必要があります - クラスが 'abstract' である場合は 'InheritanceBehavior.BeforeEachDerivedClass' 属性パラメーターーを指定する必要があります - クラスが 'sealed' である場合は 'InheritanceBehavior.BeforeEachDerivedClass' 属性パラメーターーを指定しない必要があります これらのメソッドを宣言する型も、次の規則に従う必要があります: - 型はクラスである必要があります - クラスは 'public' または 'internal' である必要があります (テスト プロジェクトが '[DiscoverInternals]' 属性を使用している場合) - クラスを 'static' にすることはできません - クラスが 'sealed' の場合は、'[TestClass]' (または派生属性) でマークする必要があります - クラスをジェネリックにすることはできません。
ko: '[ClassInitialize]'로 표시된 메서드가 유효하려면 다음 레이아웃을 따라야 합니다. -'InheritanceBehavior' 모드가 설정되지 않은 제네릭 클래스에서 선언할 수 없습니다. - 'public'이어야 합니다. - 'static'이어야 합니다. - 'async void'가 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다. - 제네릭이 아니어야 합니다. - 'TestContext' 형식의 매개 변수를 하나 사용해야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. - 클래스가 'abstract'인 경우 'InheritanceBehavior.BeforeEachDerivedClass' 특성 매개 변수를 지정해야 합니다. - 클래스가 'sealed'인 경우 'InheritanceBehavior.BeforeEachDerivedClass' 특성 매개 변수를 지정하면 안 됩니다. 이러한 메서드를 선언하는 형식은 다음 규칙도 준수해야 합니다. -형식은 클래스여야 합니다. -클래스는 'public' 또는 'internal'이어야 합니다(테스트 프로젝트에서 '[DiscoverInternals]' 특성을 사용하는 경우). -클래스는 'static'이 되어서는 안 됩니다. -클래스가 'sealed'인 경우 '[TestClass]'(또는 파생 특성)로 표시되어야 합니다. -클래스는 제네릭이 아니어야 합니다.
pl: Metody oznaczone za pomocą wartości „[ClassInitialize]” powinny być zgodne z następującym układem, aby były prawidłowe: -nie może być zadeklarowana w klasie ogólnej bez ustawionego trybu „InheritanceBehavior” — powinna być typu „public” — powinna mieć wartość „static” — nie powinna to być wartość „async void” — nie powinna to być metoda specjalna (finalizator, operator...). — nie powinna być ogólna — powinna przyjmować jeden parametr typu „TestContext” — zwracany typ powinien mieć wartość „void”, „Taks” lub „ValueTask” — parametr atrybutu „InheritanceBehavior.BeforeEachDerivedClass” powinien być określony, jeśli klasa ma wartość „abstract” — parametr atrybutu „InheritanceBehavior.BeforeEachDerivedClass” nie powinien być określony, jeśli klasa ma wartość „sealed” Typ deklarujący te metody powinien również przestrzegać następujących reguł: — Typ powinien być klasą — Klasa powinna mieć wartość „public” lub „internal” (jeśli projekt testowy używa atrybutu „[DiscoverInternals]”) — Klasa nie powinna mieć wartości „static” — Jeśli klasa ma wartość „sealed”, powinna być oznaczona znakiem „[TestClass]” (lub atrybutem pochodnym) — Klasa nie powinna być ogólna.
pt_br: Os métodos marcados com “[ClassInitialize]” devem seguir o seguinte layout para serem válidos: -não podem ser declarados em uma classe genérica sem que o modo “InheritanceBehavior” esteja definido -devem ser "públicos" -devem ser "estáticos" -não devem ser "nulos assíncronos" -não devem ser um método especial (finalizador, operador...). -não devem ser genéricos -devem usar um parâmetro do tipo “TestContext” -o tipo de retorno deve ser “nulo”, “Tarefa” ou “ValueTask” -"InheritanceBehavior.BeforeEachDerivedClass" deve ser especificado se a classe for "abstrato" -'InheritanceBehavior.BeforeEachDerivedClass' não deverá ser especificado se a classe for “selado” O tipo que declara esses métodos também deve respeitar as seguintes regras: -O tipo deve ser uma classe -A classe deve ser “público” ou '”interno” (se o projeto de teste estiver usando o atributo “[DiscoverInternals]”) -A classe não deve ser “estático” -Se a classe for “selado”, ela deverá ser marcada com “[TestClass]” (ou um atributo derivado) -a classe não deve ser genérica.
ru: Чтобы метод, помеченный "[ClassInitialize]", был допустимым, он должен соответствовать следующим правилам: – не может быть объявлен для универсального класса, если не установлен режим InheritanceBehavior; – должен быть общедоступным ("public"); – должен быть статическим ("static"); – не быть асинхронным и не возвращающим значения ("async void") – не быть специальным (метод завершения, оператор…). – не быть общим ("generic") ; – должен принимать один параметр типа "TestContext"; – тип возвращаемого значения должен быть "void", "Task" или "ValueTask"; – если класс абстрактный, должен быть указан параметр атрибута "InheritanceBehavior.BeforeEachDerivedClass"; – если класс запечатанный, не следует указывать параметр атрибута "InheritanceBehavior.BeforeEachDerivedClass"; Тип, объявляющий такие методы, также должен соответствовать следующим правилам: – должен быть классом; – класс должен быть объявлен как "public" или "internal" (если тестовый проект использует атрибут "[DiscoverInternals]"); – не должен быть объявлен как статический ("static"); – если класс запечатанный, его следует пометить как "[TestClass]" (или производный атрибут); – не должен быть универсальным ("generic").
tr: '[ClassInitialize]' ile işaretlenen yöntemlerin geçerli olması için aşağıdaki düzeni takip etmesi gereklidir: -'InheritanceBehavior' modu ayarlanmadan genel bir sınıfta tanımlanamaz -'public' olmalıdır -'static' olmalıdır -'async void' olmamalıdır -özel bir yöntem (sonlandırıcı, işleç...) olmamalıdır. - genel olmamalıdır - 'TestContext' türünden bir parametre almalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalı -Sınıf 'abstract' ise 'InheritanceBehavior.BeforeEachDerivedClass' öznitelik parametresi belirtilmelidir. -'InheritanceBehavior.BeforeEachDerivedClass' öznitelik parametresi, sınıf 'sealed' ise belirtilmemelidir Bu yöntemleri bildiren tipin ayrıca aşağıdaki kurallara uyması gerekir: -Tür bir sınıf olmalıdır -Sınıf 'public' veya 'internal' olmalıdır (test projesi '[DiscoverInternals]' niteliğini kullanıyorsa) -Sınıf 'static' olmamalıdır -Sınıf 'sealed' ise '[TestClass]' (veya türetilmiş bir öznitelik) ile işaretlenmelidir. -sınıf genel olmamalıdır.
zh_hans: 标记有“[ClassInitialize]”的方法应遵循以下布局才会有效: -如果未设置“InheritanceBehavior”模式，则不能在泛型类上声明它 - 它应为“public” - 它应为“static” - 它不应为“async void” - 它不应是特殊方法(终结器、运算符...)。 - 它不应是泛型的 - 它应采用“TestContext”类型的一个参数 - 返回类型应为“void”、“Task”或“ValueTask” - "InheritanceBehavior.BeforeEachDerivedClass" 属性参数应在类为 "abstract" 时指定 - "InheritanceBehavior.BeforeEachDerivedClass" 属性参数不应在类为 "sealed" 时指定 声明这些方法的类型还应遵循以下规则: -类型应为类 -类应为“public”或“internal”(如果测试项目正在使用“[DiscoverInternals]”属性) -类不应为“static” -如果类为“sealed”，则应使用“[TestClass]”(或派生属性)标记该类 -类不应是泛型的。
zh_hant: 標示 '[ClassInitialize]' 的方法應該遵循下列配置，才會有效: -未設定 'InheritanceBehavior' 模式的情況下不能在泛型類別上宣告它 - 其應為 'public' - 其應為 'static' - 其不應為 'async void' - 其不應為特殊方法 (完成項、運算子...)。 - 其不應為泛型 - 其應該接受類型為 'TestContext' 的一個參數 - 傳回類型應為 'void'、'Task' 或 'ValueTask' - 如果類別為 'abstract'，應指定 'InheritanceBehavior.BeforeEachDerivedClass' 屬性參數。 - 如果類別為 'sealed'，則不應指定 'InheritanceBehavior.BeforeEachDerivedClass' 屬性參數。 宣告這些方法的類型還應遵循以下規則: -類型應為類別 -類別應為 'public' 或 'internal' (如果測試專案使用 '[DiscoverInternals]' 屬性) -類別不應為 'static' -如果類別是 'sealed'，則應標示為 '[TestClass]' (或衍生屬性)。 -類別不應為泛型。

# ClassInitializeShouldBeValidMessageFormat
source: ClassInitialize method '{0}' signature is invalid
cs: Signatura „{0}“ metody ClassInitialize je neplatná
de: Signatur der ClassInitialize-Methode "{0}" ist ungültig
es: La signatura "{0}" del método ClassInitialize no es válida
fr: La signature de la méthode ClassInitialize '{0}' n’est pas valide
it: La firma del metodo ClassInitialize '{0}' non è valida
ja: ClassInitialize メソッド '{0}' シグネチャが無効です
ko: ClassInitialize 메서드 '{0}' 시그니처가 잘못되었습니다.
pl: Podpis metody ClassInitialize „{0}” jest nieprawidłowy
pt_br: A assinatura do método ClassInitialize "{0}" é inválida
ru: Подпись метода ClassInitialize "{0}" недопустима
tr: ClassInitialize yöntemi '{0}' imzası geçersiz
zh_hans: ClassInitialize 方法“{0}”签名无效
zh_hant: ClassInitialize 方法 '{0}' 簽章無效

# ClassInitializeShouldBeValidTitle
source: ClassInitialize methods should have valid layout
cs: Metody ClassInitialize musí mít platné rozložení
de: ClassInitialize-Methoden müssen über ein gültiges Layout verfügen.
es: Los métodos ClassInitialize deben tener un diseño válido
fr: La méthode ClassInitialize doit avoir une disposition valide
it: Il metodo ClassInitialize deve avere un layout valido
ja: ClassInitialize メソッドには有効なレイアウトが必要です
ko: ClassInitialize 메서드에는 유효한 레이아웃이 있어야 합니다.
pl: Metody ClassInitialize powinny mieć prawidłowy układ
pt_br: Os métodos ClassInitialize devem ter um layout válido
ru: Методы ClassInitialize должны использовать допустимый макет
tr: ClassInitialize yöntemleri geçerli bir düzene sahip olmalıdır
zh_hans: ClassInitialize 方法应具有有效的布局
zh_hant: ClassInitialize 方法應該具有有效的配置

# DataRowShouldBeValidDescription
source: DataRow entry should have the following layout to be valid: - should only be set on a test method; - argument count should match method argument count; - argument type should match method argument type.
cs: Položka DataRow by měla mít platné následující rozložení: - by se mělo nastavovat jenom pro testovací metodu; - počet argumentů by měl odpovídat počtu argumentů metody; - typ argumentu by měl odpovídat typu argumentu metody.
de: Der DataRow-Eintrag muss das folgende Layout aufweisen, um gültig zu sein: – Er sollte nur für eine Testmethode festgelegt werden. - Die Argumentanzahl muss mit der Anzahl der Methodenargumente übereinstimmen. - Der Argumenttyp muss mit dem Methodenargumenttyp übereinstimmen.
es: La entrada DataRow debe tener el siguiente diseño para que sea válido: : solo se debe establecer en un método de prueba; - el recuento de argumentos debe coincidir con el recuento de argumentos del método; : el tipo de argumento debe coincidir con el tipo de argumento de método.
fr: L’entrée DataRow doit avoir la disposition suivante pour être valide : – ne doit être défini que sur une méthode de test; - le nombre d’arguments doit correspondre au nombre d’arguments de la méthode ; – le type d’arguments doit correspondre au type d’arguments de la méthode.
it: La voce di DataRow deve avere il layout seguente per essere valido: - deve essere impostato solo su un metodo di test; - il numero di argomenti deve corrispondere al numero di argomenti del metodo; - il tipo di argomento deve corrispondere al tipo di argomento del metodo.
ja: DataRow エントリを有効にするには、次のレイアウトが必要です。 - テスト メソッドにのみ設定する必要があります。 - 引数の数はメソッドの引数の数と一致させる必要があります。 - 引数の型は、メソッドの引数の型と一致させる必要があります。
ko: DataRow 항목이 유효하려면 다음과 같은 레이아웃이 있어야 합니다. - 테스트 메서드에만 설정해야 합니다. - 인수 개수가 메서드 인수 개수와 일치해야 합니다. - 인수 형식이 메서드 인수 형식과 일치해야 합니다.
pl: Wpis DataRow powinien mieć następujący układ, aby był prawidłowym: — należy go ustawić tylko dla metody testowej; — liczba argumentów powinna być zgodna z liczbą argumentów metody; — typ argumentu powinien być zgodny z typem argumentu metody.
pt_br: A entrada DataRow deve ter o seguinte layout para ser válida: - só deve ser definido em um método de teste; - a contagem de argumentos deve corresponder à contagem de argumentos do método; - o tipo de argumento deve corresponder ao tipo de argumento do método.
ru: Действительная запись DataRow должна иметь следующую структуру: – должна быть задана только для метода теста; – количество аргументов должно совпадать с количеством аргументов метода; – тип аргумента должен совпадать с типом аргумента метода.
tr: DataRow girdisi, geçerli olması için aşağıdaki koşulları karşılamalıdır: - yalnızca bir test yönteminde ayarlanmalıdır; - bağımsız değişken sayısı yöntem bağımsız değişkeni sayısıyla eşleşmelidir; - bağımsız değişken sayısı yöntem bağımsız değişkeni sayısıyla eşleşmelidir.
zh_hans: DataRow 条目应具有以下布局才能有效: - 应仅在测试方法上进行设置； - 参数计数应与方法参数计数匹配； - 参数类型应与方法参数类型匹配。
zh_hant: DataRow 項目應具有下列配置為有效: - 應該只在測試方法上設定; - 引數計數應符合方法引數計數; - 引數類型應該符合方法引數類型。

# DataRowShouldBeValidMessageFormat_ArgumentCountMismatch
source: DataRow argument count should match method parameter count (constructor arguments: {0}, method parameters: {1})
cs: Počet argumentů dataRow by měl odpovídat počtu parametrů metody (argumenty konstruktoru: {0}, parametry metody: {1})
de: Die Anzahl der DataRow-Argumente muss mit der Anzahl der Methodenparameter übereinstimmen (Konstruktorargumente: {0}, Methodenparameter: {1})
es: El recuento de argumentos de DataRow debe coincidir con el recuento de parámetros del método (argumentos de constructor: {0}, parámetros de método: {1})
fr: Le nombre d’arguments DataRow doit correspondre au nombre de paramètres de méthode (arguments du constructeur : {0}, paramètres de méthode : {1})
it: Il numero di argomenti DataRow deve corrispondere al numero di parametri del metodo (argomenti del costruttore: {0}, parametri del metodo: {1})
ja: DataRow 引数の数は、メソッド パラメーター数 (コンストラクター引数: {0}、メソッド パラメーター: {1}) と一致させる必要があります
ko: DataRow 인수 개수는 메서드 매개 변수 개수(생성자 인수: {0}, 메서드 매개 변수: {1})와 일치해야 합니다.
pl: Liczba argumentów DataRow powinna być zgodna z liczbą parametrów metody (argumenty konstruktora: {0}, parametry metody: {1})
pt_br: A contagem de argumentos DataRow deve corresponder à contagem de parâmetros do método (argumentos do construtor: {0}, parâmetros do método: {1})
ru: Количество аргументов DataRow должно соответствовать количеству параметров метода (аргументов конструктора: {0}, параметров метода: {1})
tr: DataRow bağımsız değişken sayısı, yöntem parametresi sayısıyla eşleşmelidir (oluşturucu bağımsız değişkenleri: {0}, yöntem parametreleri: {1})
zh_hans: DataRow 参数计数应与方法参数计数匹配(构造函数参数: {0}，方法参数: {1})
zh_hant: DataRow 引數計數應符合建構函式引數 (方法參數計數: {0}、方法參數: {1})

# DataRowShouldBeValidMessageFormat_ArgumentTypeMismatch
source: DataRow argument types do not match method parameter types. {0}
cs: Typy argumentů DataRow neodpovídají typům parametrů metody. {0}
de: DataRow-Argumenttypen stimmen nicht mit Methodenparametertypen überein. {0}
es: Los tipos de argumentos DataRow no coinciden con los tipos de parámetro de método. {0}
fr: Les types d’argument DataRow ne correspondent pas aux types de paramètre de la méthode. {0}
it: Il tipo di argomento di DataRow deve corrispondere ai tipi di parametro del metodo. {0}
ja: DataRow 引数の型がメソッド パラメーターの型と一致しません。 {0}
pl: Typy argumentów DataRow nie są zgodne z typami parametrów metody. {0}
pt_br: Os tipos de argumento do DataRow não correspondem aos tipos de parâmetro do método. {0}
ru: Типы аргументов DataRow не соответствуют типам параметров метода. {0}
tr: DataRow bağımsız değişken türleri, yöntem parametre türleriyle eşleşmiyor. {0}
zh_hans: DataRow 参数类型与方法参数类型不匹配。{0}
zh_hant: DataRow 引數類型不符合方法參數類型。{0}

# DataRowShouldBeValidMessageFormat_ParameterMismatch
source: Parameter '{0}' expects type '{1}', but the provided value has type '{2}'
cs: Parametr '{0}' očekává typ '{1}', ale zadaná hodnota má typ '{2}'
de: Der Parameter „{0}“ erwartet den Typ „{1}“, aber der übergebene Wert hat den Typ „{2}“.
es: El parámetro '{0}' espera el tipo '{1}', pero el valor proporcionado tiene el tipo '{2}'
fr: Le paramètre « {0} » attend un type « {1} », mais la valeur fournie a un type « {2} »
it: Il parametro '{0}' prevede il tipo '{1}', ma il tipo del valore specificato è '{2}'
ja: パラメーター '{0}' の型は '{1}' が想定されていますが、指定された値の型は '{2}' です
pl: Parametr „{0}” oczekuje typu „{1}”, ale podana wartość ma typ „{2}”
pt_br: O parâmetro "{0}" espera o tipo "{1}", mas o valor fornecido tem o tipo "{2}"
ru: Параметр "{0}" ожидает тип "{1}", но предоставленное значение относится к типу "{2}"
tr: Parametre ‘{0}’ tipi ‘{1}’ bekliyor, ancak verilen değer ‘{2}’ tipindedir
zh_hans: 参数 ‘{0}’ 需要类型 ‘{1}’，但提供的值类型为 ‘{2}’
zh_hant: 參數 '{0}' 期望類型為 '{1}'，但提供的值的類型為 '{2}'

# DataRowShouldBeValidMessageFormat_GenericTypeArgumentConflictingTypes
source: Found two conflicting types for generic parameter '{0}'. The conflicting types are '{1}' and '{2}'.
cs: Byly nalezeny dva konfliktní typy pro obecný parametr '{0}'. Konfliktní typy jsou '{1}' a '{2}'.
de: Es wurden zwei in Konflikt stehende Typen für den generischen Parameter '{0}' gefunden. Die in Konflikt stehenden Typen sind '{1}' und '{2}'.
es: Se encontraron dos tipos en conflicto para el parámetro genérico '{0}'. Los tipos en conflicto son '{1}' y '{2}'.
fr: Deux types en conflit ont été trouvés pour le paramètre générique '{0}'. Les types en conflit sont '{1}' et '{2}'.
it: Sono stati trovati due tipi in conflitto per il parametro generico '{0}'. I tipi in conflitto sono '{1}' e '{2}'.
ja: ジェネリック パラメーター '{0}' に 2 つの競合する型が見つかりました。競合する型は '{1}' で '{2}'。
pl: Znaleziono dwa typy powodujące konflikt dla parametru ogólnego '{0}'. Typy powodujące konflikty są '{1}' i '{2}'.
pt_br: Foram encontrados dois tipos conflitativos para parâmetro genérico '{0}'. Os tipos conflitativos são '{1}' e '{2}'.
ru: Обнаружены два конфликтующих типа для универсального параметра '{0}'. Конфликтуют типы '{1}' и '{2}'.
tr: Genel parametre türü için iki çakışan tür '{0}'. Çakışan türler '{1}' '{2}'.
zh_hans: 发现泛型参数 '{0}' 的两个冲突类型。冲突类型 '{1}' 和 '{2}'。
zh_hant: 發現兩個衝突的泛型參數類型 '{0}'。衝突的類型 '{1}' 且 '{2}'。
