Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TypeContainingTestMethodShouldBeATestClassTitle
source: Type containing '[TestMethod]' should be marked with '[TestClass]'
cs: Typ obsahující [TestMethod] by měl mít označení [TestClass]
de: Der Typ, der "[TestMethod]" enthält, muss mit "[TestClass]" gekennzeichnet werden.
es: El tipo que contiene "[TestMethod]" debe marcarse con "[TestClass]"
fr: Le type contenant « [TestMethod] » doit être marqué avec « [TestClass] »
it: Il tipo contenente '[TestMethod]' deve essere contrassegnato con '[TestClass]'
ja: '[TestMethod]' を含む型は '[TestClass]' でマークする必要があります
ko: '[TestMethod]'를 포함하는 유형은 '[TestClass]'로 표시되어야 합니다.
pl: Typ zawierający metodę „[TestMethod]” powinien być oznaczony klasą „[TestClass]”
pt_br: O tipo contendo '[TestMethod]' deve ser marcado com '[TestClass]'
ru: У типа, содержащего "[TestMethod]", должна быть пометка "[TestClass]"
tr: '[TestMethod]' içeren tür '[TestClass]' ile işaretlenmelidir
zh_hans: 应使用“[TestClass]”标记包含“[TestMethod]”的类型
zh_hant: 包含 '[TestMethod]' 的類型應標記為 '[TestClass]'

# UseAsyncSuffixTestFixtureMethodSuppressorJustification
source: Asynchronous test fixture methods do not require the 'Async' suffix
cs: Asynchronní metody testovacích přípravků nevyžadují příponu Async.
de: Für asynchrone Testfixture-Methoden ist das Suffix "Async" nicht erforderlich.
es: Los métodos asincrónicos de accesorio de prueba no requieren el sufijo "Async".
fr: Les méthodes de fixture de test asynchrones ne nécessitent pas le suffixe « Async »
it: I metodi di fixture di test asincroni non richiedono il suffisso 'Async'
ja: 非同期テスト フィクスチャには 'Async' サフィックスは不要です
ko: 비동기 테스트 fixture 메서드에는 'Async' 접미사가 필요하지 않습니다.
pl: Asynchroniczne metody testowe nie wymagają sufiksu „Async”
pt_br: Os métodos de acessório de teste assíncronos não exigem o sufixo "Async"
ru: Методы асинхронных средств тестирования не требуют суффикса "Async".
tr: Zaman uyumsuz test düzeni metotları için 'Async' soneki gerekmez
zh_hans: 异步测试固定例程方法不需要 "Async" 后缀
zh_hant: 非同步測試固件方法不需要 'Async' 尾碼

# UseAsyncSuffixTestMethodSuppressorJustification
source: Asynchronous test methods do not require the 'Async' suffix
cs: Asynchronní testovací metody nevyžadují příponu Async.
de: Für asynchrone Testmethoden ist das Suffix "Async" nicht erforderlich.
es: Los métodos de prueba asincrónicos no requieren el sufijo "Async".
fr: Les méthodes de test asynchrones ne nécessitent pas le suffixe 'Async'
it: I metodi di test asincroni non richiedono il suffisso 'Async'
ja: 非同期テスト メソッドには 'Async' サフィックスは不要です
ko: 비동기 테스트 메서드에는 'Async' 접미사가 필요하지 않습니다.
pl: Asynchroniczne metody testowe nie wymagają sufiksu „Async”
pt_br: Os métodos de teste assíncronos não exigem o sufixo 'Async'
ru: Асинхронные методы теста не требуют суффикса Async
tr: Asenkron test metotları için 'Async' soneki gerekmez
zh_hans: 异步测试方法不需要 "Async" 后缀
zh_hant: 非同步測試方法不需要 'Async' 尾碼

# UnusedParameterSuppressorJustification
source: TestContext parameter is required by MSTest for AssemblyInitialize and ClassInitialize methods
cs: Parametr TestContext vyžaduje MSTest pro metody AssemblyInitialize a ClassInitialize.
de: Der TestContext-Parameter ist für MSTest für AssemblyInitialize- und ClassInitialize-Methoden erforderlich
es: MSTest requiere el parámetro TestContext para los métodos AssemblyInitialize y ClassInitialize
fr: Le paramètre TestContext est requis par MSTest pour les méthodes AssemblyInitialize et ClassInitialize
it: Il parametro TestContext è necessario a MSTest per i metodi AssemblyInitialize e ClassInitialize
ja: AssemblyInitialize メソッドと ClassInitialize メソッドに対する MSTest には TestContext パラメーターが必要です
pl: Parametr TestContext jest wymagany przez narzędzie MSTest dla metod AssemblyInitialize i ClassInitialize
pt_br: O parâmetro TestContext é obrigatório para métodos AssemblyInitialize e ClassInitialize do MSTest
ru: Параметр TestContext необходим для MSTest в методах AssemblyInitialize и ClassInitialize
tr: AssemblyInitialize ve ClassInitialize yöntemleri için MSTest tarafından TestContext parametresi gereklidir.
zh_hans: AssemblyInitialize 和 ClassInitialize 方法的 MSTest 需要 TestContext 参数
zh_hant: MSTest 需要 TestContext 參數，以用於 AssemblyInitialize 和 ClassInitialize 方法

# UseAttributeOnTestMethodAnalyzerMessageFormat
source: [{0}] can only be set on methods marked with [TestMethod]
cs: [{0}] lze nastavit pouze u metod označených pomocí metody [TestMethod].
de: [{0}] kann nur für Methoden festgelegt werden, die mit [TestMethod] markiert sind.
es: [{0}] solo se puede establecer en métodos marcados con [TestMethod]
fr: [{0}] ne peut être défini que sur les méthodes marquées avec [TestMethod]
it: [{0}] può essere impostato solo su metodi contrassegnati con [TestMethod]
ja: [{0}] は、[TestMethod] でマークされたメソッドにのみ設定できます
ko: [{0}]은(는) [TestMethod] 표시된 메서드에만 설정할 수 있습니다.
pl: [{0}] można ustawić tylko dla metod oznaczonych znakiem [TestMethod]
pt_br: [{0}] só pode ser definido em métodos marcados com [TestMethod]
ru: [{0}] можно задать только для методов с пометкой [TestMethod]
tr: [{0}] yalnızca [TestMethod] ile işaretli yöntemlerde ayarlanabilir
zh_hans: 只能对标记了 [TestMethod] 的方法设置 [{0}]
zh_hant: [{0}] 只能在標示為 [TestMethod] 的方法上設定

# UseAttributeOnTestMethodAnalyzerTitle
source: [{0}] can only be set on methods marked with [TestMethod]
cs: [{0}] lze nastavit pouze u metod označených pomocí metody [TestMethod].
de: [{0}] kann nur für Methoden festgelegt werden, die mit [TestMethod] markiert sind.
es: [{0}] solo se puede establecer en métodos marcados con [TestMethod]
fr: [{0}] ne peut être défini que sur les méthodes marquées avec [TestMethod]
it: [{0}] può essere impostato solo su metodi contrassegnati con [TestMethod]
ja: [{0}] は、[TestMethod] でマークされたメソッドにのみ設定できます
ko: [{0}]은(는) [TestMethod] 표시된 메서드에만 설정할 수 있습니다.
pl: [{0}] można ustawić tylko dla metod oznaczonych znakiem [TestMethod]
pt_br: [{0}] só pode ser definido em métodos marcados com [TestMethod]
ru: [{0}] можно задать только для методов с пометкой [TestMethod]
tr: [{0}] yalnızca [TestMethod] ile işaretli yöntemlerde ayarlanabilir
zh_hans: 只能对标记了 [TestMethod] 的方法设置 [{0}]
zh_hant: [{0}] 只能在標示為 [TestMethod] 的方法上設定

# UseConditionBaseWithTestClassMessageFormat
source: The attribute '{0}' which derives from 'ConditionBaseAttribute' should be used only on classes marked with `TestClassAttribute`
cs: Atribut '{0}' odvozený od atributu ConditionBaseAttribute by měl být použit pouze u tříd označených atributem TestClassAttribute.
de: Das Attribut '{0}', das von "ConditionBaseAttribute" abgeleitet wird, darf nur für Klassen verwendet werden, die mit "TestClassAttribute" markiert sind.
es: El atributo '{0}' que deriva de 'ConditionBaseAttribute' solo se debe usar en clases marcadas con 'TestClassAttribute'
fr: L’attribut '{0}' qui dérive de 'ConditionBaseAttribute' doit être utilisé uniquement sur les classes marquées avec 'TestClassAttribute'
it: L'attributo '{0}' che deriva da 'ConditionBaseAttribute' deve essere utilizzato solo in classi contrassegnate con 'TestClassAttribute'
ja: 'ConditionBaseAttribute' から派生する属性 '{0}' は、'TestClassAttribute' でマークされたクラスでのみ使用する必要があります
pl: Atrybut '{0}' pochodzący od atrybutu "ConditionBaseAttribute" powinien być używany tylko w przypadku klas oznaczonych atrybutem "TestClassAttribute"
pt_br: O atributo '{0}' derivado de 'ConditionBaseAttribute' deve ser usado somente em classes marcadas com 'TestClassAttribute'
ru: Атрибут '{0}', производный от ConditionBaseAttribute, следует использовать только для классов, помеченных атрибутом TestClassAttribute
tr: 'ConditionBaseAttribute' öğesinden türetilen '{0}' özniteliği yalnızca 'TestClassAttribute' ile işaretlenmiş sınıflarda kullanılmalıdır
zh_hans: 派生自 “ConditionBaseAttribute” 的属性 '{0}' 只能在标记为 “TestClassAttribute” 的类上使用
zh_hant: 衍生自 'ConditionBaseAttribute' 的屬性 '{0}' 只能用於標示為 'TestClassAttribute' 的類別

# UseConditionBaseWithTestClassTitle
source: Use 'ConditionBaseAttribute' on test classes
cs: Použít ConditionBaseAttribute u testovacích tříd
de: "ConditionBaseAttribute" für Testklassen verwenden
es: Usar 'ConditionBaseAttribute' en clases de prueba
fr: Utiliser 'ConditionBaseAttribute' sur les classes de test
it: Usa 'ConditionBaseAttribute' nelle classi di test
ja: テスト クラスで 'ConditionBaseAttribute' を使用する
pl: Użyj atrybutu "ConditionBaseAttribute" w klasach testu
pt_br: Usar 'ConditionBaseAttribute' em classes de teste
ru: Использовать ConditionBaseAttribute для тестовых классов
tr: Test sınıflarda 'ConditionBaseAttribute' kullanın
zh_hans: 对测试类使用 “ConditionBaseAttribute”
zh_hant: 在測試類別上使用 'ConditionBaseAttribute'

# UseCooperativeCancellationForTimeoutDescription
source: Using '[Timeout]' without explicitly setting 'CooperativeCancellation = true' is discouraged. In a future version, cooperative cancellation will become the default behavior. Set 'CooperativeCancellation = true' to opt into the recommended behavior and avoid breaking changes.
cs: Použití „[Timeout]“ bez explicitního nastavení „CooperativeCancellation = true“ se nedoporučuje. V budoucí verzi se kooperativní zrušení stane výchozím chováním. Nastavte „CooperativeCancellation = true“, abyste zapnuli doporučené chování a vyhnuli se změnám, které by mohly způsobit problémy.
de: Es wird davon abgeraten, „[Timeout]“ ohne die explizite Festlegung von „CooperativeCancellation = true“ zu verwenden. In einer zukünftigen Version wird der kooperative Abbruch das Standardverhalten sein. Legen Sie „CooperativeCancellation = true“ fest, um das empfohlene Verhalten zu aktivieren und Breaking Changes zu vermeiden.
es: No se recomienda usar "[Timeout]" sin establecer explícitamente "CooperativeCancellation = true". En una versión futura, la cancelación cooperativa se convertirá en el comportamiento predeterminado. Establece "CooperativeCancellation = true" para participar en el comportamiento recomendado y evitar cambios importantes.
fr: L’utilisation de '[Timeout]' sans définir explicitement 'CooperativeCancellation = true' est déconseillée. Dans une future version, l’annulation coopérative deviendra le comportement par défaut. Définissez 'CooperativeCancellation = true' pour adopter le comportement recommandé et éviter les changements incompatibles.
it: L'uso di "[Timeout]" senza impostare esplicitamente "CooperativeCancellation = true" è sconsigliato. In una versione futura l'annullamento cooperativo diventerà il comportamento predefinito. Impostare "CooperativeCancellation = true" per acconsentire esplicitamente al comportamento consigliato ed evitare modifiche che causano un'interruzione.
ja: 'CooperativeCancellation = true' を明示的にを設定せずに '[Timeout]' を使用することは推奨されません。将来のバージョンでは、協調的キャンセルが既定の動作になります。推奨される動作をオプトインし、破壊的な変更を避けるために、'CooperativeCancellation = true' を設定します。
pl: Nie rekomenduje się używania elementu „[Timeout]” bez jawnego ustawiania wartości „CooperativeCancellation = true”. W przyszłej wersji anulowanie trybu współpracy będzie zachowaniem domyślnym. Ustaw opcję „CooperativeCancellation = true”, aby włączyć rekomendowane zachowanie i uniknąć zmian powodujących niezgodność.
pt_br: Usar '\[Timeout]' sem definir explicitamente 'CooperativeCancellation = true' não é recomendado. Em uma versão futura, o cancelamento cooperativo se tornará o comportamento padrão. Defina 'CooperativeCancellation = true' para optar pelo comportamento recomendado e evitar quebras.
ru: Использование "[Timeout]" без явной настройки "CooperativeCancellation = true" не рекомендуется. В будущей версии кооперативная отмена станет поведением по умолчанию. Настройте "CooperativeCancellation = true", чтобы согласиться с рекомендуемым поведением и избежать критических изменений.
tr: '[Timeout]' ayarını 'CooperativeCancellation = true' olarak açıkça ayarlamadan kullanmak önerilmez. Gelecek bir sürümde, birlikte iptal etme varsayılan davranış haline gelecektir. Önerilen davranışı kabul etmek ve uyumsuzlukları önlemek için 'CooperativeCancellation = true' değerini ayarlayın.
zh_hans: 不建议在不显式设置 'CooperativeCancellation = true' 的情况下使用 '[Timeout]'。在将来的版本中，协作取消将成为默认行为。设置 'CooperativeCancellation = true' 以选择加入建议的行为，并避免中断性变更。
zh_hant: 在未明確設定 'CooperativeCancellation = true' 的情況下，不建議使用 '[Timeout]'。在未來的版本中，合作取消將成為預設行為。請設定 'CooperativeCancellation = true' 以選擇加入推薦的行為，並避免破壞性變更。

# UseCooperativeCancellationForTimeoutMessageFormat
source: Use 'CooperativeCancellation = true' with '[Timeout]' to enable cooperative cancellation behavior
cs: Použijte „CooperativeCancellation = true“ s „[Timeout]“, abyste povolili chování kooperativního zrušení
de: Verwenden Sie „CooperativeCancellation = true“ mit „[Timeout]“, um das kooperative Abbruchverhalten zu aktivieren.
es: Usa "CooperativeCancellation = true" con "[Timeout]" para habilitar el comportamiento de cancelación cooperativa.
fr: Utilisez 'CooperativeCancellation = true' avec '[Timeout]' pour activer le comportement d’annulation coopératif
it: Usare "CooperativeCancellation = true" con "[Timeout]" per abilitare il comportamento di annullamento cooperativo
ja: '[Timeout]' と共に 'CooperativeCancellation = true' を使用して、協調的キャンセルの動作を有効にします
pl: Użyj opcji „CooperativeCancellation = true” z limitem czasu „[Timeout]”, aby włączyć zachowanie anulowania trybu współpracy
pt_br: Use 'CooperativeCancellation = true' com '\[Timeout]' para habilitar o comportamento de cancelamento cooperativo
ru: Используйте "CooperativeCancellation = true" с "[Timeout]", чтобы включить поведение кооперативной отмены
tr: '[Timeout]' ile 'CooperativeCancellation = true' kullanarak birlikte iptal etme davranışını etkinleştirin
zh_hans: 将 'CooperativeCancellation = true' 与 '[Timeout]' 配合使用以启用协作取消行为
zh_hant: 使用 'CooperativeCancellation = true' 搭配 '[Timeout]' 以啟用合作取消行為

# UseCooperativeCancellationForTimeoutTitle
source: Use 'CooperativeCancellation = true' with '[Timeout]'
cs: Použijte „CooperativeCancellation = true“ s „[Timeout]“
de: Verwenden Sie „CooperativeCancellation = true“ mit „[Timeout]“.
es: Usa "CooperativeCancellation = true" con "[Timeout]"
fr: Utiliser 'CooperativeCancellation = true' avec '[Timeout]'
it: Usa "CooperativeCancellation = true" con "[Timeout]"
ja: '[Timeout]' と共に 'CooperativeCancellation = true' を使用する
pl: Użyj opcji „CooperativeCancellation = true” w limitem czasu „[Timeout]”
pt_br: Use 'CooperativeCancellation = true' com '\[Timeout]'
ru: Использовать "CooperativeCancellation = true" с "[Timeout]"
tr: '[Timeout]' ile 'CooperativeCancellation = true' kullanın
zh_hans: 将 'CooperativeCancellation = true' 与 '[Timeout]' 配合使用
zh_hant: 使用 'CellCancellation = true' 搭配 '[Timeout]'

# UseDeploymentItemWithTestMethodOrTestClassMessageFormat
source: '[DeploymentItem]' can be specified only on test class or test method
cs: [DeploymentItem] se dá zadat jenom pro testovací třídu nebo testovací metodu.
de: „[DeploymentItem]“ kann nur für die Testklasse oder Testmethode angegeben werden.
es: '[DeploymentItem]' solo se puede especificar en la clase de prueba o el método de prueba
fr: « [DeploymentItem] » ne peut être spécifié que sur une classe de test ou une méthode de test
it: '[DeploymentItem]' può essere specificato solo per la classe di test o il metodo di test
ja: '[DeploymentItem]' は、テスト クラスまたはテスト メソッドでのみ指定できます
ko: '[DeploymentItem]'은(는) 테스트 클래스 또는 테스트 메서드에만 지정할 수 있습니다.
pl: Element „[DeploymentItem]” można określić tylko dla klasy testowej lub metody testowej
pt_br: '[DeploymentItem]' pode ser especificado apenas na classe de teste ou método de teste
ru: Указать "[DeploymentItem]" можно только для тестового класса или метода.
tr: '[DeploymentItem]' yalnızca test sınıfında veya test yönteminde belirtilebilir
zh_hans: 只能对测试类或测试方法指定 "[DeploymentItem]"
zh_hant: '[DeploymentItem]' 只能在測試類或測試方法上指定

# UseDeploymentItemWithTestMethodOrTestClassTitle
source: '[DeploymentItem]' can be specified only on test class or test method
cs: [DeploymentItem] se dá zadat jenom pro testovací třídu nebo testovací metodu.
de: „[DeploymentItem]“ kann nur für die Testklasse oder Testmethode angegeben werden.
es: '[DeploymentItem]' solo se puede especificar en la clase de prueba o el método de prueba
fr: « [DeploymentItem] » ne peut être spécifié que sur une classe de test ou une méthode de test
it: '[DeploymentItem]' può essere specificato solo per la classe di test o il metodo di test
ja: '[DeploymentItem]' は、テスト クラスまたはテスト メソッドでのみ指定できます
ko: '[DeploymentItem]'은(는) 테스트 클래스 또는 테스트 메서드에만 지정할 수 있습니다.
pl: Element „[DeploymentItem]” można określić tylko dla klasy testowej lub metody testowej
pt_br: '[DeploymentItem]' pode ser especificado apenas na classe de teste ou método de teste
ru: Указать "[DeploymentItem]" можно только для тестового класса или метода.
tr: '[DeploymentItem]' yalnızca test sınıfında veya test yönteminde belirtilebilir
zh_hans: 只能对测试类或测试方法指定 "[DeploymentItem]"
zh_hant: '[DeploymentItem]' 只能在測試類或測試方法上指定

# UseParallelizeAttributeAnalyzerDescription
source: By default, MSTest runs tests within the same assembly sequentially, which can lead to severe performance limitations. It is recommended to enable assembly attribute '[Parallelize]' to run tests in parallel, or if the assembly is known to not be parallelizable, to use explicitly the assembly level attribute '[DoNotParallelize]'.
cs: Ve výchozím nastavení spouští MSTest testy v rámci stejného sestavení sekvenčně, což může vést k závažným omezením výkonu. Doporučuje se povolit atribut sestavení [Parallelize] k paralelnímu spouštění testů nebo explicitně použít atribut [DoNotParallelize] na úrovni sestavení, pokud je známo, že sestavení není paralelizovatelné.
de: Standardmäßig führt MSTest Tests in derselben Assembly sequentiell aus, was zu erheblichen Leistungseinschränkungen führen kann. Es wird empfohlen, das Assembly-Attribut "[Parallelize]" zu aktivieren, um Tests parallel auszuführen, oder, wenn bekannt ist, dass die Assembly nicht parallelisierbar ist, explizit das Assembly-Attribut "[DoNotParallelize]" zu verwenden.
es: De forma predeterminada, MSTest ejecuta pruebas en el mismo ensamblado secuencialmente, lo que puede provocar limitaciones de rendimiento graves. Se recomienda habilitar el atributo de ensamblado ''[Parallelize]'' o, si se sabe que el ensamblado no se puede paralelizar, usar explícitamente el atributo de nivel de ensamblado ''[DoNotParallelize]''.
fr: Par défaut, MSTest exécute des tests dans la même assembly de façon séquentielle, ce qui peut entraîner de graves limitations de performances. Il est recommandé d’activer l’attribut d’assemblée « [Parallelize] » pour exécuter des tests en parallèle ou, si l’assemblée est connu pour ne pas être parallélisable, d’utiliser explicitement l’attribut de niveau assemblée « [DoNotParallelize] ».
it: Per impostazione predefinita, MSTest esegue i test in sequenza nello stesso assemby, il che può causare gravi limitazioni delle prestazioni. È consigliabile abilitare l'attributo di assembly '[Parallelize]' per eseguire i test in parallelo, o, se l'assembly non è parallelizzabile, usare in modo esplicito l'attributo a livello di assembly '[DoNotParallelize]'.
ja: 既定では、MSTest は同じアセンブリ内でテストを順番に実行するため、重大なパフォーマンス制限が生じる可能性があります。アセンブリ属性 '[Parallelize]' を有効にして並列でテストを実行するか、アセンブリが並列化できないことがわかっている場合は、アセンブリ レベル属性 '[DoNotParallelize]' を明示的に使用することをお勧めします。
ko: 기본적으로 MSTest는 동일한 어셈블리 내에서 테스트를 순차적으로 실행하므로 심각한 성능 제한이 발생할 수 있습니다. 어셈블리 특성 '[Parallelize]'가 병렬로 테스트를 실행하도록 설정하거나 어셈블리가 병렬화할 수 없는 것으로 알려진 경우 어셈블리 수준 특성 '[DoNotParallelize]'을(를) 명시적으로 사용하는 것이 좋습니다.
pl: Domyślnie platforma MSTest uruchamia testy w ramach tego samego zestawu sekwencyjnie, co może prowadzić do poważnego ograniczenia wydajności. Zaleca się włączenie atrybutu zestawu „[Parallelize]”, aby uruchamiać testy równolegle, lub jeśli zestaw na to nie pozwala — użycie jawnie atrybutu poziomu zestawu „[DoNotParallelize]”.
pt_br: Por padrão, o MSTest executa testes no mesmo assembly sequencialmente, o que pode levar a limitações graves de desempenho. É recomendável habilitar o atributo de assembly ''[Parallelize]'' para executar testes em paralelo ou se o assembly for conhecido por não ser paralelizável, para usar explicitamente o atributo de nível de assembly ''[DoNotParallelize]''.
ru: По умолчанию MSTest выполняет тесты в одной сборке последовательно, что может привести к серьезному ограничению производительности. Рекомендуется включить атрибут сборки "[Parallelize]", чтобы выполнять тесты параллельно, или явно использовать атрибут уровня сборки "[DoNotParallelize]", если известно, что сборка не поддерживает параллелизацию.
tr: Varsayılan olarak, MSTest hizmeti testleri aynı derleme içinde sırayla çalıştırır ve bu durum ciddi performans sınırlamalarına yol açabilir. Testleri paralel yürütmek için '[Parallelize]' derleme özniteliğini etkinleştirmeniz önerilir veya derlemenin paralelleştirilebilir olduğu biliniyorsa, doğrudan '[DoNotParallelize]' derleme düzeyi özniteliğini kullanmanız önerilir.
zh_hans: 默认情况下，MSTest 将按顺序在同一程序集中运行测试，这可能会导致严重的性能限制。建议启用程序集属性“[Parallelize]”以并行运行测试，或者如果已知程序集不可并行，则显式使用程序集级别属性“DoNotParallelize”。
zh_hant: 根據預設，MSTest 會依順序執行在相同組件內的測試，這可能會導致嚴重的效能限制。建議啟用組件屬性 '[Parallelize]' 來平行執行測試，或者如果已知組件無法平行處理，則明確使用組件層級的屬性 '[DoNotParallelize]'。

# UseParallelizeAttributeAnalyzerMessageFormat
source: Explicitly enable or disable tests parallelization
cs: Explicitně povolit nebo zakázat paralelizaci testů
de: Parallelisierung von Tests explizit aktivieren oder deaktivieren
es: Habilitar o deshabilitar explícitamente la paralelización de pruebas
fr: Activer ou désactiver explicitement la parallélisation des tests
it: Abilitare o disabilitare in modo esplicito la parallelizzazione dei test
ja: テストの並列化を明示的に有効または無効にする
ko: 테스트 병렬 처리를 명시적으로 사용하거나 사용하지 않도록 설정
pl: Jawne włączanie lub wyłączanie równoległości testów
pt_br: Habilitar ou desabilitar explicitamente a paralelização de testes
ru: Явное включение или отключение параллелизации тестов
tr: Doğrudan test paralelleştirmeyi etkinleştirin veya devre dışı bırakın
zh_hans: 显式启用或禁用测试并行化
zh_hant: 明確啟用或停用測試平行處理

# UseParallelizeAttributeAnalyzerTitle
source: Explicitly enable or disable tests parallelization
cs: Explicitně povolit nebo zakázat paralelizaci testů
de: Parallelisierung von Tests explizit aktivieren oder deaktivieren
es: Habilitar o deshabilitar explícitamente la paralelización de pruebas
fr: Activer ou désactiver explicitement la parallélisation des tests
it: Abilitare o disabilitare in modo esplicito la parallelizzazione dei test
ja: テストの並列化を明示的に有効または無効にする
ko: 테스트 병렬 처리를 명시적으로 사용하거나 사용하지 않도록 설정
pl: Jawne włączanie lub wyłączanie równoległości testów
pt_br: Habilitar ou desabilitar explicitamente a paralelização de testes
ru: Явное включение или отключение параллелизации тестов
tr: Doğrudan test paralelleştirmeyi etkinleştirin veya devre dışı bırakın
zh_hans: 显式启用或禁用测试并行化
zh_hant: 明確啟用或停用測試平行處理

# UseProperAssertMethodsMessageFormat
source: Use 'Assert.{0}' instead of 'Assert.{1}'
cs: Místo Assert.{1} použijte Assert.{0}.
de: Verwenden Sie "Assert.{0}" anstelle von "Assert.{1}".
es: Usar "Assert.{0}" en lugar de "Assert".{1}"
fr: Utilisez ' Assert.{0}' au lieu de 'Assert.{1}'
it: Usa 'Assert.{0}' invece di 'Assert.{1}'
ja: 'Assert.{1}' の代わりに 'Assert.{0}' を使用する
pl: Użyj instrukcji „Assert{0}.” zamiast „Assert{1}”.
pt_br: Usar 'Assert.{0}' em vez de 'Assert.{1}'
ru: Используйте "Assert.{0}" вместо "Assert.{1}"
tr: 'Assert.{1}' yerine 'Assert.{0}' kullan
zh_hans: 使用“Assert.{0}”而不是“Assert.{1}”
zh_hant: 使用 'Assert.{0}' 取代 'Assert.{1}'

# UseProperAssertMethodsTitle
source: Use proper 'Assert' methods
cs: Použít správné metody Assert
de: Geeignete Assert-Methoden verwenden
es: Usar métodos "Assert" adecuados
fr: Utiliser les méthodes 'Assert' appropriées
it: Usa metodi 'Assert' appropriati
ja: 適切な 'Assert' メソッドを使用する
pl: Użyj odpowiednich metod „Assert”
pt_br: Usar métodos 'Assert' adequados
ru: Используйте правильные методы "Assert"
tr: Uygun 'Assert' yöntemlerini kullan
zh_hans: 使用正确的“断言”方法
zh_hant: 使用適當的 'Assert' 方法
