Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# GlobalTestFixtureShouldBeValidMessageFormat
source: Global test fixture method '{0}' signature is invalid
cs: Podpis metody globálního testovacího přípravku {0} je neplatný.
de: Die Signatur der globalen Testfixierungsmethode „{0}“ ist ungültig
es: La firma del método del accesorio de pruebas global '{0}' no es válida
fr: La signature de la méthode « {0} » de la fixture de test globale est invalide
it: La firma del metodo di fixture di test globale '{0}' non è valida
ja: グローバル テスト フィクスチャ メソッド '{0}' シグネチャが無効です
pl: Podpis globalnej metody warunków początkowych testu „{0}” jest nieprawidłowy
pt_br: A assinatura do método de acessório de teste global "{0}" é inválida
ru: Подпись метода глобального средства тестирования "{0}" недопустима
tr: Global test düzeni yöntemi ‘{0}’ imzası geçersiz
zh_hans: 全局测试固定例程方法 "{0}" 签名无效
zh_hant: 全域測試固件方法 '{0}' 的簽名無效

# GlobalTestFixtureShouldBeValidTitle
source: GlobalTestInitialize and GlobalTestCleanup methods should have valid layout
cs: Metody GlobalTestInitialize a GlobalTestCleanup by měly mít platné rozložení.
de: Die Methoden „GlobalTestInitialize“ und „GlobalTestCleanup“ müssen ein gültiges Layout aufweisen
es: Los métodos GlobalTestInitialize y GlobalTestCleanup deben tener un diseño válido
fr: Les méthodes GlobalTestInitialize et GlobalTestCleanup doivent avoir une structure valide
it: I metodi GlobalTestInitialize e GlobalTestCleanup devono avere un layout valido
ja: GlobalTestInitialize および GlobalTestCleanup メソッドには有効なレイアウトが必要です
pl: Metody GlobalTestInitialize i GlobalTestCleanup powinny mieć prawidłowy układ
pt_br: Os métodos GlobalTestInitialize e GlobalTestCleanup devem ter um layout válido
ru: Методы GlobalTestInitialize и GlobalTestCleanup должны использовать допустимый макет
tr: GlobalTestInitialize ve GlobalTestCleanup yöntemleri geçerli bir düzene sahip olmalıdır
zh_hans: GlobalTestInitialize 和 GlobalTestCleanup 方法应具有有效的布局
zh_hant: GlobalTestInitialize 和 GlobalTestCleanup 方法應具備有效的配置

# IgnoreStringMethodReturnValueDescription
source: Methods like Contains, StartsWith, and EndsWith return boolean values that indicate whether the condition was met. Ignoring these return values is likely a mistake.
pl: Metody takie jak Contains, StartsWith i EndsWith zwracają wartości logiczne wskazujące, czy warunek został spełniony. Ignorowanie tych wartości zwrotnych jest prawdopodobnie błędem.
zh_hant: Contains、StartsWith 和 EndsWith 等方法會傳回布林值，指出是否已符合條件。忽略這些傳回值可能導致錯誤。

# IgnoreStringMethodReturnValueMessageFormat
source: The return value of '{0}' should not be ignored
pl: Zwracana wartość „{0}” nie powinna być ignorowana
zh_hant: 不應忽略傳回值 '{0}'

# IgnoreStringMethodReturnValueTitle
source: Do not ignore the return value of string methods
pl: Nie ignoruj zwracanej wartości metod ciągu
zh_hant: 請勿忽略字串方法的傳回值

# PreferAssertFailOverAlwaysFalseConditionsMessageFormat
source: Use 'Assert.Fail' instead of an always-failing 'Assert.{0}' assert
cs: Místo trvalého neúspěšného vyhodnocovacího výrazu „Assert.{0}“ použijte „Assert.Fail“.
de: Verwenden Sie „Assert.Fail“ anstelle einer Assert-Anweisung „Assert.{0}“, bei der immer ein Fehler auftritt.
es: Usar "Assert.Fail" en lugar de una aserción 'Assert.{0}' que siempre tiene errores
fr: Utilisez « Assert.Fail » à la place d’une assertion « Assert.{0} » toujours en échec
it: Usare 'Assert.Fail' invece di un'asserzione 'Assert.{0}' che ha sempre esito negativo.
ja: 常に失敗している 'Assert.{0}' アサートの代わりに 'Assert.Fail' を使用する。
ko: 항상 실패하는 'Assert.{0}' 어설션 대신 'Assert.Fail'을 사용합니다.
pl: Użyj trybu „Assert.Fail” zamiast kończącej się zawsze niepowodzeniem instrukcji „Assert.{0}”
pt_br: Use "Assert.Fail" em vez de uma asserção "Assert.{0}" sempre com falha
ru: Используйте "Assert.Fail" вместо утверждения с постоянным сбоем "Assert.{0}"
tr: Her zaman başarısız olan 'Assert.{0}' onaylaması yerine 'Assert.Fail' seçeneğini kullanın
zh_hans: 使用 “Assert.Fail” 而不是始终失败的 “Assert.{0}” 断言
zh_hant: 使用 'Assert.Fail'，而不是一直失敗的 'Assert.{0}' 聲明

# PreferAssertFailOverAlwaysFalseConditionsTitle
source: Use 'Assert.Fail' instead of an always-failing assert
cs: Místo trvalého neúspěšného vyhodnocovacího výrazu použijte „Assert.Fail“.
de: Verwenden Sie „Assert.Fail“ anstelle einer Assert-Anweisung, bei der immer ein Fehler auftritt.
es: Usar "Assert.Fail" en lugar de una aserción que siempre tiene errores
fr: Utilisez « Assert.Fail » à la place d’une assertion toujours en échec
it: Usare 'Assert.Fail' invece di un'asserzione che ha sempre esito negativo
ja: 常に失敗しているアサートの代わりに 'Assert.Fail' を使用する
ko: 항상 실패하는 어설션 대신 'Assert.Fail' 사용
pl: Użyj trybu „Assert.Fail” zamiast kończącej się zawsze niepowodzeniem instrukcji asercji
pt_br: Usar "Assert.Fail" em vez de uma asserção sempre com falha
ru: Используйте "Assert.Fail" вместо утверждения с постоянным сбоем
tr: Her zaman başarısız olan onaylama yerine 'Assert.Fail' seçeneğini kullanın
zh_hans: 使用 “Assert.Fail” 而不是始终失败的断言
zh_hant: 使用 'Assert.Fail'，而不是一直失敗的聲明

# PreferTestMethodOverDataTestMethodAnalyzerDescription
source: 'DataTestMethodAttribute' is obsolete and provides no additional functionality over 'TestMethodAttribute'. Use 'TestMethodAttribute' for all test methods, including parameterized tests.
cs: Možnost DataTestMethodAttribute je zastaralá a neposkytuje žádné funkce navíc oproti možnosti TestMethodAttribute. Pro všechny testovací metody, včetně parametrizovaných testů, použijte možnost TestMethodAttribute.
de: „DataTestMethodAttribute“ ist veraltet und bietet keine zusätzliche Funktionalität im Vergleich zu „TestMethodAttribute“. Verwenden Sie „TestMethodAttribute“ für alle Testmethoden, einschließlich parametrisierter Tests.
es: "DataTestMethodAttribute" está obsoleto y no proporciona ninguna funcionalidad adicional sobre "TestMethodAttribute". Use "TestMethodAttribute" para todos los métodos de prueba, incluidas las pruebas parametrizadas.
fr: « DataTestMethodAttribute » est obsolète et ne fournit aucune fonctionnalité supplémentaire par rapport à « TestMethodAttribute ». Utiliser « TestMethodAttribute » pour toutes les méthodes de test, y compris les tests paramétrés.
it: 'DataTestMethodAttribute' è obsoleto e non offre funzionalità aggiuntive rispetto a 'TestMethodAttribute'. Utilizzare 'TestMethodAttribute' per tutti i metodi di test, inclusi i test con parametri.
ja: 'DataTestMethodAttribute' は廃止されており、'TestMethodAttribute' に対して追加の機能は提供しません。パラメーター化されたテストを含むすべてのテスト メソッドには、'TestMethodAttribute' を使用してください。
pl: Atrybut „DataTestMethodAttribute” jest przestarzały i nie zapewnia dodatkowych funkcji w stosunku do atrybutu „TestMethodAttribute”. Użyj atrybutu „TestMethodAttribute” dla wszystkich metod testowych, w tym testów sparametryzowanych.
pt_br: 'DataTestMethodAttribute' está obsoleto e não oferece funcionalidade adicional em relação a 'TestMethodAttribute'. Use 'TestMethodAttribute' para todos os métodos de teste, inclusive testes parametrizados.
ru: Атрибут "DataTestMethodAttribute" устарел и не предоставляет дополнительных функций по сравнению с "TestMethodAttribute". Используйте '"TestMethodAttribute" для всех методов тестирования, включая параметризованные тесты.
tr: 'DataTestMethodAttribute' artık kullanılmıyor ve 'TestMethodAttribute' üzerinde ek bir işlevsellik sunmuyor. Parametreli testler de dahil, tüm test yöntemleri için 'TestMethodAttribute' kullanın.
zh_hans: 'DataTestMethodAttribute' 已过时，并且不再提供 'TestMethodAttribute' 之外的其他功能。对所有测试方法(包括参数化测试)使用 'TestMethodAttribute'。
zh_hant: 'DataTestMethodAttribute' 已過時，未提供比 'TestMethodAttribute' 更多的功能。針對所有測試方法使用 'TestMethodAttribute'，包括參數化測試。

# PreferTestMethodOverDataTestMethodAnalyzerMessageFormat
source: 'DataTestMethod' is obsolete. Use 'TestMethod' instead.
cs: Možnost DataTestMethod je zastaralá. Místo ní použijte možnost TestMethod.
de: „DataTestMethod“ ist veraltet. Verwenden Sie stattdessen „TestMethod“.
es: "DataTestMethod" está obsoleto. Use "TestMethod" en su lugar.
fr: « DataTestMethod » est obsolète. Utilisez « TestMethod » à la place.
it: 'DataTestMethod' è obsoleto. Utilizzare 'TestMethod' invece.
ja: 'DataTestMethod' は廃止されました。代わりに 'TestMethod' を使用してください。
pl: Element „DataTestMethod” jest przestarzały. Zamiast niego użyj elementu „TestMethod”.
pt_br: 'DataTestMethod' está obsoleto. Use 'TestMethod' em vez disso.
ru: "DataTestMethod" устарел. Используйте вместо него "TestMethod".
tr: 'DataTestMethod' artık kullanılmıyor. Bunun yerine 'TestMethod' kullanın.
zh_hans: 'DataTestMethod' 已过时。请改用 'TestMethod'。
zh_hant: 'DataTestMethod' 已過時。請改用 'TestMethod'。

# PreferTestMethodOverDataTestMethodAnalyzerTitle
source: Prefer 'TestMethod' over 'DataTestMethod'
cs: Preferovat TestMethod před DataTestMethod
de: „TestMethod“ gegenüber „DataTestMethod“ bevorzugen
es: Preferir "TestMethod" a "DataTestMethod"
fr: Préférer « TestMethod » à « DataTestMethod »
it: Preferisci 'TestMethod' a 'DataTestMethod'
ja: 'DataTestMethod' よりも 'TestMethod' を優先する
pl: Wybieraj element „TestMethod”, anie „DataTestMethod”
pt_br: Prefira 'TestMethod' a 'DataTestMethod'
ru: Следует предпочитать метод "TestMethod" методу "DataTestMethod"
tr: 'DataTestMethod' yerine 'TestMethod' yöntemini tercih edin
zh_hans: 首选 'TestMethod' 而不是 'DataTestMethod'
zh_hant: 優先使用 'TestMethod' 而不是 'DataTestMethod'

# ReviewAlwaysTrueAssertConditionAnalyzerMessageFormat
source: Review or remove the assertion as its condition is known to be always true
cs: Zkontrolujte nebo odeberte kontrolní výraz, protože jeho podmínka je vždy true.
de: Überprüfen oder entfernen Sie die Assertion, weil ihre Bedingung bekanntermaßen immer TRUE ist.
es: Revise o quite la aserción porque se sabe que su condición siempre es true
fr: Vérifier ou supprimer l’assertion, car sa condition est connue pour être toujours vraie
it: Rivedere o rimuovere l'asserzione perché la relativa condizione è sempre true
ja: アサーションの条件が常に TRUE であることが判明しているため、アサーションを確認または削除してください
ko: 조건이 항상 true인 것으로 알려진 어설션 검토 또는 제거
pl: Przejrzyj lub usuń asercję, ponieważ wiadomo, że jej warunek ma zawsze wartość true
pt_br: Examine ou remova a asserção, pois a sua condição é conhecida por ser sempre verdadeira
ru: Проверьте или удалите утверждение, так как известно, что его условие всегда истинно.
tr: Koşulu her zaman true olarak bilinen onaylamayı gözden geçirin veya kaldırın
zh_hans: 查看或移除断言，因为已知其条件始终为 true
zh_hant: 檢閱或移除判斷提示，因為已知其條件一律為 True

# ReviewAlwaysTrueAssertConditionAnalyzerTitle
source: Assertion condition is always true
cs: Podmínka kontrolního výrazu je vždy true.
de: Bedingung der Assertion ist immer TRUE
es: La condición de aserción siempre es true
fr: La condition d’assertion est toujours vraie
it: La condizione dell’asserzione è sempre true
ja: アサーション条件は常に TRUE です
ko: 어설션 조건이 항상 true임
pl: Warunek asercji ma zawsze wartość true
pt_br: A condição de asserção é sempre verdadeira
ru: Условие проверочного утверждения всегда истинно
tr: Onaylama koşulu her zaman true'dur
zh_hans: 断言条件始终为 true
zh_hant: 判斷提示條件一律為 True

# PreferConstructorOverTestInitializeMessageFormat
source: Prefer constructors over TestInitialize methods
cs: Upřednostňovat konstruktory před metodami TestInitialize
de: Konstruktoren gegenüber TestInitialize-Methoden bevorzugen
es: Preferir constructores en lugar de métodos TestInitialize
fr: Préférer les constructeurs aux méthodes TestInitialize
it: Preferisci costruttori rispetto ai metodi TestInitialize
ja: TestInitialize メソッドよりもコンストラクターを優先する
ko: TestInitialize 메서드보다 생성자 선호
pl: Preferowanie konstruktorów niż metod TestInitialize
pt_br: Preferir construtores em vez de métodos TestInitialize
ru: Предпочитать конструкторы методам TestInitialize
tr: Oluşturucuları TestInitialize yöntemlerine tercih et
zh_hans: 首选构造函数而不是 TestInitialize 方法
zh_hant: 偏好建構函式勝於 TestInitialize 方法

# PreferConstructorOverTestInitializeTitle
source: Prefer constructors over TestInitialize methods
cs: Upřednostňovat konstruktory před metodami TestInitialize
de: Konstruktoren gegenüber TestInitialize-Methoden bevorzugen
es: Preferir constructores en lugar de métodos TestInitialize
fr: Préférer les constructeurs aux méthodes TestInitialize
it: Preferisci costruttori rispetto ai metodi TestInitialize
ja: TestInitialize メソッドよりもコンストラクターを優先する
ko: TestInitialize 메서드보다 생성자 선호
pl: Preferowanie konstruktorów niż metod TestInitialize
pt_br: Preferir construtores em vez de métodos TestInitialize
ru: Предпочитать конструкторы методам TestInitialize
tr: Oluşturucuları TestInitialize yöntemlerine tercih et
zh_hans: 首选构造函数而不是 TestInitialize 方法
zh_hant: 偏好建構函式勝於 TestInitialize 方法

# PreferDisposeOverTestCleanupMessageFormat
source: Prefer 'Dispose' over TestCleanup methods
cs: Upřednostňovat metody Dispose před metodami TestCleanup
de: “Dispose“ gegenüber TestCleanup-Methoden bevorzugen
es: Preferir "Dispose" sobre los métodos TestCleanup
fr: Préférer « Dispose » aux méthodes TestCleanup
it: Preferisci "Dispose" ai metodi TestCleanup
ja: TestCleanup メソッドよりも 'Dispose' を優先する
ko: TestCleanup 메서드보다 'Dispose' 선호
pl: Preferowanie metod „Dispose” niż TestCleanup
pt_br: Preferir métodos "Dispose" em vez de TestCleanup
ru: Предпочитать "Dispose" методам TestCleanup
tr: 'Dispose' yöntemlerini TestCleanup yöntemlerine tercih et
zh_hans: 首选 “Dispose” 而不是 TestCleanup 方法
zh_hant: 偏好 'Dispose' 勝於 TestCleanup 方法

# PreferDisposeOverTestCleanupTitle
source: Prefer 'Dispose' over TestCleanup methods
cs: Upřednostňovat metody Dispose před metodami TestCleanup
de: “Dispose“ gegenüber TestCleanup-Methoden bevorzugen
es: Preferir "Dispose" sobre los métodos TestCleanup
fr: Préférer « Dispose » aux méthodes TestCleanup
it: Preferisci "Dispose" ai metodi TestCleanup
ja: TestCleanup メソッドよりも 'Dispose' を優先する
ko: TestCleanup 메서드보다 'Dispose' 선호
pl: Preferowanie metod „Dispose” niż TestCleanup
pt_br: Preferir métodos "Dispose" em vez de TestCleanup
ru: Предпочитать "Dispose" методам TestCleanup
tr: 'Dispose' yöntemlerini TestCleanup yöntemlerine tercih et
zh_hans: 首选 “Dispose” 而不是 TestCleanup 方法
zh_hant: 偏好 'Dispose' 勝於 TestCleanup 方法

# PreferTestCleanupOverDisposeMessageFormat
source: Prefer TestCleanup over 'Dispose' methods
cs: Upřednostňovat metody TestCleanup před metodami Dispose
de: TestCleanup gegenüber Dispose-Methoden bevorzugen
es: Preferir TestCleanup en lugar de métodos "Dispose"
fr: Préférer TestCleanup aux méthodes « Dispose »
it: Preferisci TestCleanup ai metodi "Dispose".
ja: 'Dispose' メソッドよりも TestCleanup を優先する
ko: 'Dispose' 메서드보다 TestCleanup 선호
pl: Preferowanie TestCleanup niż metod „Dispose”
pt_br: Preferir métodos TestCleanup em vez de "Dispose"
ru: Предпочитать TestCleanup методам "Dispose"
tr: TestCleanup yöntemlerini 'Dispose' yöntemlerine tercih et
zh_hans: 首选 TestCleanup 而不是 “Dispose” 方法
zh_hant: 偏好 TestCleanup 勝於 'Dispose' 方法

# PreferTestCleanupOverDisposeTitle
source: Prefer TestCleanup over 'Dispose' methods
cs: Upřednostňovat metody TestCleanup před metodami Dispose
de: TestCleanup gegenüber Dispose-Methoden bevorzugen
es: Preferir TestCleanup en lugar de métodos "Dispose"
fr: Préférer TestCleanup aux méthodes « Dispose »
it: Preferisci TestCleanup ai metodi "Dispose".
ja: 'Dispose' メソッドよりも TestCleanup を優先する
ko: 'Dispose' 메서드보다 TestCleanup 선호
pl: Preferowanie TestCleanup niż metod „Dispose”
pt_br: Preferir métodos TestCleanup em vez de "Dispose"
ru: Предпочитать TestCleanup методам "Dispose"
tr: TestCleanup yöntemlerini 'Dispose' yöntemlerine tercih et
zh_hans: 首选 TestCleanup 而不是 “Dispose” 方法
zh_hant: 偏好 TestCleanup 勝於 'Dispose' 方法

# PreferTestInitializeOverConstructorMessageFormat
source: Prefer TestInitialize methods over constructors
cs: Upřednostňovat metody TestInitialize před konstruktory
de: TestInitialize-Methoden gegenüber Konstruktoren bevorzugen
es: Preferir métodos TestInitialize en lugar de constructores
fr: Préférer les méthodes TestInitialize aux constructeurs
it: Preferisci i metodi TestInitialize rispetto ai costruttori
ja: コンストラクターよりも TestInitialize メソッドを優先する
ko: 생성자보다 TestInitialize 메서드 선호
pl: Preferowanie metod TestInitialize niż konstruktorów
pt_br: Preferir métodos TestInitialize em vez de construtores
ru: Предпочитать методы TestInitialize конструкторам
tr: TestInitialize yöntemlerini oluşturuculara tercih et
zh_hans: 首选 TestInitialize 方法而不是构造函数
zh_hant: 偏好 TestInitialize 方法勝於建構函式

# PreferTestInitializeOverConstructorTitle
source: Prefer TestInitialize methods over constructors
cs: Upřednostňovat metody TestInitialize před konstruktory
de: TestInitialize-Methoden gegenüber Konstruktoren bevorzugen
es: Preferir métodos TestInitialize en lugar de constructores
fr: Préférer les méthodes TestInitialize aux constructeurs
it: Preferisci i metodi TestInitialize rispetto ai costruttori
ja: コンストラクターよりも TestInitialize メソッドを優先する
ko: 생성자보다 TestInitialize 메서드 선호
pl: Preferowanie metod TestInitialize niż konstruktorów
pt_br: Preferir métodos TestInitialize em vez de construtores
ru: Предпочитать методы TestInitialize конструкторам
tr: TestInitialize yöntemlerini oluşturuculara tercih et
zh_hans: 首选 TestInitialize 方法而不是构造函数
zh_hant: 偏好 TestInitialize 方法勝於建構函式

# PublicMethodShouldBeTestMethodAnalyzerDescription
source: Public methods should be test methods (marked with `[TestMethod]`).
cs: Veřejné metody by měly být testovací metody (označené jako [TestMethod]).
de: Öffentliche Methoden sollten Testmethoden sein (gekennzeichnet mit „[TestMethod]“).
es: Los métodos públicos deben ser métodos de prueba (marcados con `[TestMethod]`).
fr: Les méthodes publiques doivent être des méthodes de test (indiquées par « [TestMethod] »).
it: I metodi pubblici devono essere metodi di test (contrassegnati con '[TestMethod]').
ja: パブリック メソッドはテスト メソッドである必要があります ('[TestMethod]' でマーク)。
pl: Metody publiczne powinny być metodami testowymi (oznaczonymi znakiem „[TestMethod]”).
pt_br: Os métodos públicos devem ser métodos de teste (marcados com `[TestMethod]`).
ru: Общедоступные методы должны быть тестовыми методами (помеченными как "[TestMethod]").
tr: Genel metotlar test metotları olmalıdır ('[TestMethod]' ile işaretlendi).
zh_hans: 公共方法应为测试方法(标记为 `[TestMethod]`)。
zh_hant: 公用方法應為測試方法 (標示為 '[TestMethod]')。

# PublicMethodShouldBeTestMethodAnalyzerFormat
source: Public method '{0}' should be a test method
cs: Veřejná metoda {0} by měla být testovací metoda.
de: Die öffentliche Methode „{0}“ sollte eine Testmethode sein.
es: El método público "{0}" debe ser un método de prueba
fr: La méthode publique « {0} » doit être une méthode de test
it: Il metodo pubblico '{0}' deve essere un metodo di test
ja: パブリック メソッド '{0}' はテスト メソッドである必要があります
pl: Metoda publiczna „{0}” powinna być metodą testową
pt_br: O método público '{0}' deve ser um método de teste
ru: Общедоступный метод "{0}" должен быть тестовым методом.
tr: Genel metot '{0}' bir test metodu olmalıdır
zh_hans: 公共方法“{0}”应为测试方法
zh_hant: 公用方法 '{0}' 應為測試方法

# PublicMethodShouldBeTestMethodAnalyzerTitle
source: Public methods should be test methods
cs: Veřejné metody by měly být testovací metody
de: Öffentliche Methoden sollten Testmethoden sein.
es: Los métodos públicos deben ser métodos de prueba
fr: Les méthodes publiques doivent être des méthodes de test
it: I metodi pubblici devono essere metodi di test
ja: パブリック メソッドはテスト メソッドである必要があります
pl: Metody publiczne powinny być metodami testowymi
pt_br: Os métodos públicos devem ser métodos de teste
ru: Общедоступные методы должны быть тестовыми методами
tr: Genel metotlar test metotları olmalıdır
zh_hans: 公共方法应为测试方法
zh_hant: 公用方法應為測試方法

# PublicTypeShouldBeTestClassDescription
source: It's considered a good practice to have only test classes marked public in a test project.
cs: Osvědčeným postupem je označit jako veřejné v testovacím projektu jen testovací třídy.
de: Es wird als bewährte Methode angesehen, nur Testklassen in einem Testprojekt als öffentlich gekennzeichnet zu lassen.
es: Se considera una buena práctica tener solo clases de prueba marcadas como públicas en un proyecto de prueba.
fr: C’est considéré comme une bonne pratique d’avoir uniquement des classes de test marquées comme publiques dans un projet de test.
it: È consigliabile che solo le classi di test siano contrassegnate come pubbliche in un progetto di test.
ja: テスト プロジェクトでは、テスト クラスのみをパブリックとしてマークすることをお勧めします。
ko: 테스트 프로젝트에서 공용으로 표시된 테스트 클래스만 사용하는 것이 좋습니다.
pl: Uważa się, że dobrą praktyką jest oznaczanie tylko klas testowych jako publicznych w projekcie testowym.
pt_br: É considerado uma boa prática ter somente classes de teste marcadas como públicas em um projeto de teste.
ru: Рекомендуется использовать только тестовые классы, помеченные как общедоступные в тестовом проекте.
tr: Test projesinde yalnızca public olarak işaretlenmiş test sınıflarının olması iyi bir uygulama olarak kabul edilir.
zh_hans: 在测试项目中仅将测试类标记为“公开”是一种不错的做法。
zh_hant: 在測試專案中僅將測試類別標記為公開被認為是一種很好的做法。

# PublicTypeShouldBeTestClassMessageFormat
source: Public type '{0}' should be marked with '[TestClass]' or changed to 'internal'
cs: Veřejný typ {0} by měl být označen jako [TestClass] nebo změněn na internal.
de: Der öffentliche Typ "{0}" sollte mit "[TestClass]" gekennzeichnet oder in "internal" geändert werden.
es: El tipo público '{0}' debe marcarse con '[TestClass]' o cambiarse a 'internal'
fr: Le type public « {0} » doit être marqué avec « [TestClass] » ou remplacé par « interne »
it: Il tipo pubblico '{0}' deve essere contrassegnato con '[TestClass]' o modificato in 'interno'
ja: パブリック型 '{0}' は '[TestClass]' でマークするか、'internal' に変更する必要があります
ko: 공용 형식 '{0}'은(는) '[TestClass]'로 표시하거나 'internal'로 변경해야 합니다.
pl: Typ publiczny „{0}” powinien być oznaczony jako „[TestClass]” lub zmieniony na wartość „internal”
pt_br: O tipo público ''{0}'' deve ser marcado com ''[TestClass]'' ou alterado para 'interno'
ru: Общедоступный тип "{0}" должен быть помечен атрибутом "[TestClass]" или изменен на значение "internal"
tr: '{0}'' genel türü [TestClass]' ile işaretlenmeli ' veya 'internal' olarak değiştirilmelidir
zh_hans: 公共类型“{0}”应标记为“[TestClass]”或更改为“internal”
zh_hant: 公用類型 '{0}' 應標示為 '[TestClass]' 或變更為 'internal'

# PublicTypeShouldBeTestClassTitle
source: Public types should be test classes
cs: Veřejné typy by měly být testovací třídy.
de: Öffentliche Typen sollten Testklassen sein.
es: Los tipos públicos deben ser clases de prueba
fr: Les types publics doivent être des classes de test
it: I tipi di pubblico dovrebbero essere classi di test
ja: パブリック型はテスト クラスである必要があります
ko: 공용 형식은 테스트 클래스여야 합니다.
pl: Typy publiczne powinny być klasami testowymi
pt_br: Os tipos públicos devem ser classes de teste
ru: Общедоступные типы должны быть тестовыми классами
tr: Genel türler test sınıfları olmalıdır
zh_hans: 公共类型应为测试类
zh_hant: 公用類型應為測試類別

# StringAssertToAssertMessageFormat
source: Use 'Assert.{0}' instead of 'StringAssert.{1}'
cs: Použijte Assert.{0}' místo StringAssert.{1}'
de: Verwenden Sie „Assert.{0}“ anstelle von „StringAssert.{1}“.
es: Use 'Assert'{0}. en lugar de 'StringAssert.'{1}
fr: Utilisez « Assert.{0} » au lieu de « StringAssert.{1} »
it: Usa 'Assert.{0}' invece di 'StringAssert.{1}'
ja: 'StringAssert.{1}' の代わりに 'Assert.{0}' を使用します
pl: Użyj ciągu „Assert.{0}” zamiast ciągu „StringAssert.{1}”
pt_br: Use "Assert.{0}" em vez de "StringAssert.{1}"
ru: Используйте "Assert.{0}" вместо "StringAssert.{1}"
tr: ‘StringAssert.{1}’ yerine ‘Assert.{0}’ kullanın
zh_hans: 使用 'Assert.{0}' 而不是 'StringAssert.{1}'
zh_hant: 使用 'Assert.{0}' 而不是 'StringAssert.{1}'
