Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# StringAssertToAssertTitle
source: Use 'Assert' instead of 'StringAssert'
cs: Použijte Assert místo StringAssert
de: Verwenden Sie „Assert“ anstelle von „StringAssert“.
es: Usar 'Assert' en lugar de 'StringAssert'
fr: Utilisez « Assert » au lieu de « StringAssert »
it: Usa 'Assert' invece di 'StringAssert'
ja: 'StringAssert' の代わりに 'Assert' を使用
pl: Użyj ciągu „Assert” zamiast ciągu „StringAssert”
pt_br: Usar "Assert" em vez de "StringAssert"
ru: Используйте "Assert" вместо "StringAssert"
tr: ‘StringAssert’ yerine ‘Assert’ kullanın
zh_hans: 使用 'Assert' 而不是 'StringAssert'
zh_hant: 使用 'Assert' 而不是 'StringAssert'

# TestClassShouldBeValidMessageFormat
source: Test class '{0}' should be valid
cs: Testovací třída {0} by měla být platná.
de: Die Testklasse „{0}“ muss gültig sein
es: La clase de prueba '{0}' debe ser válida
fr: La classe de test « {0} » doit être valide
it: La classe di test '{0}' deve essere valida
ja: テスト クラス '{0}' は有効である必要があります
ko: 테스트 클래스 '{0}'은(는) 유효해야 합니다.
pl: Klasa testowa „{0}” powinna być prawidłowa
pt_br: A classe de teste ''{0}'' deve ser válida
ru: Тестовый класс "{0}" должен быть допустимым
tr: '{0}' test sınıfı geçerli olmalıdır
zh_hans: 测试类“{0}”应该有效
zh_hant: 測試類別 '{0}' 應為有效

# TestContextShouldBeValidMessageFormat
source: Property 'TestContext' should be valid
cs: Vlastnost TestContext by měla být platná.
de: Die Eigenschaft „TestContext“ muss gültig sein
es: La propiedad 'TestContext' debe ser válida
fr: La propriété « TestContext » doit être valide
it: La proprietà 'TestContext' deve essere valida
ja: プロパティ 'TestContext' は有効である必要があります
ko: 'TestContext' 속성은 유효해야 합니다.
pl: Właściwość „TestContext” powinna być prawidłowa
pt_br: A propriedade ''TestContext'' deve ser válida
ru: Свойство "TestContext" должно быть допустимым
tr: 'TestContext' özelliği geçerli olmalıdır
zh_hans: 属性 "TestContext" 应该有效
zh_hant: 屬性 'TestContext' 應為有效

# TestMethodAttributeShouldPropagateSourceInformationMessageFormat
source: TestMethodAttribute derived class '{0}' should add CallerFilePath and CallerLineNumber parameters to its constructor
pl: Klasa pochodna TestMethodAttribute „{0}” powinna dodać parametry CallerFilePath i CallerLineNumber do swojego konstruktora
zh_hant: TestMethodAttribute 衍生類別 '{0}' 應在其建構函式中新增 CallerFilePath 和 CallerLineNumber 參數

# TestMethodAttributeShouldPropagateSourceInformationTitle
source: TestMethodAttribute derived class should propagate source information
pl: Klasa pochodna atrybutu TestMethodAttribute powinna propagować informacje źródłowe
zh_hant: TestMethodAttribute 衍生類別應傳遞來源資訊

# TestMethodAttributeShouldSetDisplayNameCorrectlyMessageFormat
source: Use the 'DisplayName' property instead of passing a string argument to TestMethodAttribute
pl: Użyj właściwości „DisplayName” zamiast przekazywania argumentu ciągu do atrybutu TestMethodAttribute
zh_hant: 請使用 'DisplayName' 屬性，而非將字串引數傳遞給 TestMethodAttribute

# TestMethodAttributeShouldSetDisplayNameCorrectlyTitle
source: TestMethodAttribute should set DisplayName correctly
pl: Atrybut TestMethodAttribute powinien poprawnie ustawić nazwę DisplayName
zh_hant: TestMethodAttribute 應正確設定 DisplayName 屬性

# TestMethodShouldBeValidMessageFormat
source: Test method '{0}' signature is invalid
cs: Signatura {0} metody Test je neplatná.
de: Signatur der Testmethode "{0}" ist ungültig
es: La firma del método de prueba '{0}' no es válida
fr: La signature « {0} » de la méthode de test n’est pas valide
it: La firma del metodo di test '{0}' non è valida
ja: テスト メソッド '{0}' シグネチャが無効です
ko: 테스트 메서드 '{0}' 시그니처가 잘못되었습니다.
pl: Podpis metody testowej „{0}” jest nieprawidłowy
pt_br: A assinatura "{0}" do método de teste é inválida
ru: Подпись тестового метода "{0}" недействительна
tr: '{0}' test yöntemi imzası geçersiz
zh_hans: 测试方法“{0}”签名无效
zh_hant: 測試方法 '{0}' 簽章無效

# UseCancellationTokenPropertyDescription
source: TestContext.CancellationToken provides a more direct way to access the cancellation token compared to TestContext.CancellationTokenSource.Token.
pl: Element TestContext.CancellationToken zapewnia bardziej bezpośredni sposób uzyskiwania dostępu do tokenu anulowania w porównaniu z elementem TestContext.CancellationTokenSource.Token.
zh_hant: 相較於 TestContext.CancellationTokenSource.Token，TestContext.CancellationToken 提供存取取消權杖更直接的方法。

# UseCancellationTokenPropertyMessageFormat
source: Use 'TestContext.CancellationToken' instead of 'TestContext.CancellationTokenSource.Token'
pl: Użyj argumentu „TestContext.CancellationToken” zamiast argumentu „TestContext.CancellationTokenSource.Token”
zh_hant: 使用 'TestContext.CancellationToken' 而不是 'TestContext.CancellationTokenSource.Token'

# UseCancellationTokenPropertyTitle
source: Use TestContext.CancellationToken instead of TestContext.CancellationTokenSource.Token
pl: Użyj argumentu TestContext.CancellationToken zamiast argumentu TestContext.CancellationTokenSource.Token
zh_hant: 使用 TestContext.CancellationToken 而不是 TestContext.CancellationTokenSource.Token

# TestClassShouldBeValidDescription
source: Test classes, classes marked with the '[TestClass]' attribute, should respect the following layout to be considered valid by MSTest: - it should be 'public' (or 'internal' if '[assembly: DiscoverInternals]' attribute is set) - it should not be 'static' (except if it contains only 'AssemblyInitialize' and/or 'AssemblyCleanup' methods) - it should not be generic.
cs: Testovací třídy (třídy označené atributem [TestClass]) by měly respektovat následující rozložení, které MSTest považuje za platné: – musí být public (nebo internal, pokud je nastaven atribut [assembly: DiscoverInternals]), – nesmí být static (s výjimkou případů, kdy obsahuje pouze metody AssemblyInitialize nebo AssemblyCleanup), – nesmí být obecné.
de: Testklassen (mit dem „[TestClass]“-Attribut gekennzeichnete Klassen) müssen das folgende Layout berücksichtigen, um von MSTest als gültig betrachtet zu werden: – Sie müssen auf „public“ festgelegt sein (oder auf „internal“, falls das „[assembly: DiscoverInternals]“-Attribut festgelegt ist). – Sie dürfen nicht auf „static“ festgelegt sein (außer wenn sie nur die Methoden „AssemblyInitialize“ und/oder „AssemblyCleanup“ enthalten) – Sie dürfen nicht generisch sein.
es: Las clases de prueba, las clases marcadas con el atributo '[TestClass]', deben respetar el siguiente diseño para que MSTest lo considere válido: - debe ser 'public' (o 'internal' si se establece el atributo '[assembly: DiscoverInternals]') - no debe ser "static" (excepto si contiene solo los métodos "AssemblyInitialize" o "AssemblyCleanup") : no debe ser genérico.
fr: Les classes de test, à savoir les classes marquées par l’attribut « [TestClass] », doivent respecter la disposition suivante pour être considérées comme valides par MSTest : – Elle doit être « publique » (ou « interne » si l’attribut « [assembly : DiscoverInternals] » est défini) – Elle ne doit pas être « statique » (sauf si elle ne contient que des méthodes « AssemblyInitialize » et/ou « AssemblyCleanup ») – Elle ne doit pas être générique.
it: Le classi di test, classi contrassegnate con l'attributo '[TestClass]', dovrebbero rispettare il layout seguente per essere considerate valide da MSTest: - dovrebbe essere 'pubblica' (o 'interna' se l'attributo '[assembly: DiscoverInternals]' è impostato) - non dovrebbe essere 'statica' (a meno che contenga solo i metodi 'AssemblyInitialize' e/o 'AssemblyCleanup') - non dovrebbe essere generica.
ja: テスト クラス ('[TestClass]' 属性でマークされたクラス) は、MSTest によって有効と見なされるように、次のレイアウトを考慮する必要があります: - 'public' である必要があります ('[assembly: DiscoverInternals]' 属性が設定されている場合は 'internal' である必要があります) - 'static' にすることはできません ('AssemblyInitialize' メソッドおよび/または 'AssemblyCleanup' メソッドのみが含まれる場合は除きます) - ジェネリックにすることはできません。
ko: '[TestClass]' 특성으로 표시된 클래스인 테스트 클래스는 MSTest에서 유효하다고 간주하려면 다음 레이아웃을 준수해야 합니다. - 'public'(또는 '[assembly: DiscoverInternals]' 특성이 설정된 경우 'internal')이어야 합니다. - 'static'이 아니어야 합니다('AssemblyInitialize' 및/또는 'AssemblyCleanup' 메서드만 포함된 경우 제외). - 제네릭이 아니어야 합니다.
pl: Klasy testowe, czyli klasy oznaczone atrybutem „[TestClass]”, powinny uwzględniać następujący układ, który jest uznawany za prawidłowy przez platformę MSTest: — powinna to być wartość „public” (lub „internal”, jeśli ustawiono atrybut „[assembly: DiscoverInternals]”) - nie powinna być „statyczna” (chyba że zawiera tylko metody „AssemblyInitialize” i/lub „AssemblyCleanup”) — nie powinna to być wartość ogólna.
pt_br: Classes de teste, classes marcadas com o atributo ''[TestClass]'', devem respeitar o layout a seguir para serem consideradas válidas pelo MSTest: - deve ser "público" (ou "interno" se o atributo "[assembly: DiscoverInternals]" estiver definido) - não deve ser ''estático'' (exceto se contiver apenas os métodos ''AssemblyInitialize'' e/ou ''AssemblyCleanup'') - não deve ser genérico.
ru: В тестовых классах (с атрибутом "[TestClass]") должна быть следующая структура, чтобы эти классы считались допустимыми для MSTest: - у класса должно быть свойство "public" (или "internal", если задан атрибут "[assembly: DiscoverInternals]") - у класс не должно быть свойства "static" (кроме случаев, когда класс содержит только методы "AssemblyInitialize" и "AssemblyCleanup") - класс не должен быть универсальным.
tr: '[TestClass]' özniteliğiyle işaretlenen sınıflar olan test sınıfları, MSTest: tarafından geçerli kabul edilmeleri için aşağıdaki düzene uygum olmalıdır - 'public' (veya '[assembly: DiscoverInternals]' özniteliği ayarlanmışsa 'internal') olmalıdır - 'static' olmamalıdır (yalnızca 'AssemblyInitialize' ve/veya 'AssemblyCleanup' yöntemlerini içermesi hariç) - genel olmalıdır.
zh_hans: 测试类(标记有“[TestClass]”属性的类)应遵循以下布局，才能被 MSTest 视为有效: - 它应为 "public" (如果设置了“[assembly: DiscoverInternals]”属性，则应为 "internal") - 它不应为 "static" (除非它只包含 "AssemblyInitialize" 和/或 "AssemblyCleanup" 方法) - 它不应是泛型的。
zh_hant: 測試類別 (標示為 '[TestClass]' 屬性的類別) 應該遵循下列配置，讓 MSTest 視為有效: - 它應該是 'public' (如果設定 '[assembly: DiscoverInternals]' 屬性，則為 'internal') - 它不應該是 'static' (除非其僅包含 'AssemblyInitialize' 和/或 'AssemblyCleanup' 方法) - 它不能是泛型。

# TestClassShouldBeValidTitle
source: Test classes should have valid layout
cs: Testovací třídy by měly mít platné rozložení.
de: Testklassen müssen über ein gültiges Layout verfügen.
es: Las clases de prueba deben tener un diseño válido
fr: Les classes de test doivent avoir une disposition valide
it: Le classi di test dovrebbero avere un layout valido
ja: テスト クラスには有効なレイアウトが必要です
ko: 테스트 클래스에는 유효한 레이아웃이 있어야 합니다.
pl: Klasy testowe powinny mieć prawidłowy układ
pt_br: As classes de teste devem ter um layout válido
ru: Тестовые классы должны использовать допустимую структуру
tr: Test sınıfları geçerli bir düzene sahip olmalıdır
zh_hans: 测试类应具有有效的布局
zh_hant: 測試類別應具備有效的配置

# TestClassShouldHaveTestMethodDescription
source: Test class should have at least one test method or be 'static' with method(s) marked by '[AssemblyInitialize]' and/or '[AssemblyCleanup]'.
cs: Testovací třída by měla mít aspoň jednu testovací metodu nebo by měla být static s metodami s označením [AssemblyInitialize] a/nebo [AssemblyCleanup].
de: Die Testklasse muss mindestens eine Testmethode aufweisen oder "statisch" sein, wenn Methoden mit "[AssemblyInitialize]" und/oder "[AssemblyCleanup]" markiert sind.
es: La clase de prueba debe tener al menos un método de prueba o ser "static" con métodos marcados por "[AssemblyInitialize]" o "[AssemblyCleanup]".
fr: La classe de test doit avoir au moins une méthode de test ou être « statique » avec une ou plusieurs méthodes marquées par « [AssemblyInitialize] » et/ou « [AssemblyCleanup] ».
it: La classe di test deve avere almeno un metodo di test o essere 'static' con metodi contrassegnati da '[AssemblyInitialize]' e/o '[AssemblyCleanup]'.
ja: テスト クラスには、少なくとも 1 つのテスト メソッドがあるか、'[AssemblyInitialize]' または '[AssemblyCleanup]' によってマークされたメソッドを含む 'static' である必要があります。
ko: 테스트 클래스에는 하나 이상의 테스트 메서드가 있거나 '[AssemblyInitialization]' 및/또는 '[AssemblyCleanup]'으로 표시된 메서드가 있는 'static'이어야 합니다.
pl: Klasa testowa powinna mieć co najmniej jedną metodę testową lub być „statyczna” z metodami oznaczonymi jako „[AssemblyInitialize]” i/lub „[AssemblyCleanup]”.
pt_br: A classe de teste deve ter pelo menos um método de teste ou ser 'estática' com métodos marcados por '[AssemblyInitialize]' e/ou '[AssemblyCleanup]'.
ru: Тестовый класс должен содержать хотя бы один тестовый метод или быть "статическим" с методами, отмеченными "[AssemblyInitialize]" и (или) "[AssemblyCleanup]".
tr: Test sınıfı en az bir test yöntemine sahip olmalıdır veya '[AssemblyInitialize]' ve/veya '[AssemblyCleanup]' ile işaretlenen yöntemlere sahip 'static' olmalıdır.
zh_hans: 测试类应至少有一个测试方法，或者应为 "static" 且方法由 "[AssemblyInitialize]" 和/或 "[AssemblyCleanup]" 标记。
zh_hant: 測試類別至少應有一個測試方法或是 'static'，而其方法是以 '[AssemblyInitialization]' 和/或 '[AssemblyCleanup]'標示。

# TestClassShouldHaveTestMethodMessageFormat
source: Test class '{0}' should have at least one test method or be 'static' with method(s) marked by '[AssemblyInitialize]' and/or '[AssemblyCleanup]'
cs: Testovací třída {0} by měla mít aspoň jednu testovací metodu nebo by měla být static s metodami s označením [AssemblyInitialize] a/nebo [AssemblyCleanup].
de: Die Testklasse "{0}" muss mindestens eine Testmethode aufweisen oder "statisch" sein, wenn Methoden mit "[AssemblyInitialize]" und/oder "[AssemblyCleanup]" markiert sind.
es: La clase de prueba "{0}" debe tener al menos un método de prueba o ser "static" con métodos marcados por "[AssemblyInitialization]" o "[AssemblyCleanup]"
fr: La classe de test '{0}' doit avoir au moins une méthode de test ou être « statique » avec une ou plusieurs méthodes marquées par « [AssemblyInitialize] » et/ou « [AssemblyCleanup] »
it: La classe di test '{0}' deve avere almeno un metodo di test o essere 'static' con metodi contrassegnati da '[AssemblyInitializate]' e/o '[AssemblyCleanup]'
ja: テスト クラス '{0}' には、少なくとも 1 つのテスト メソッドがあるか、'[AssemblyInitialize]' または '[AssemblyCleanup]' によってマークされたメソッドを含む 'static' である必要があります。
ko: 테스트 클래스 '{0}'에 하나 이상의 테스트 메서드가 있거나 '[AssemblyInitialization]' 및/또는 '[AssemblyCleanup]'으로 표시된 메서드가 있는 'static'이어야 합니다.
pl: Klasa „{0}” testowa powinna mieć co najmniej jedną metodę testową lub być „statyczna” z metodami oznaczonymi jako „[AssemblyInitialize]” i/lub „[AssemblyCleanup]”.
pt_br: A classe de teste '{0}' deve ter pelo menos um método de teste ou ser 'estática' com métodos marcados por '[AssemblyInitialize]' e/ou '[AssemblyCleanup]'.
ru: Тестовый класс "{0}" должен содержать хотя бы один тестовый метод или быть "статическим" с методами, отмеченными "[AssemblyInitialize]" и (или) "[AssemblyCleanup]"
tr: '{0}' test sınıfı en az bir test yöntemine sahip olmalıdır veya '[AssemblyInitialize]' ve/veya '[AssemblyCleanup]' ile işaretlenen yöntemlere sahip 'static' olmalıdır
zh_hans: 测试类 "{0}" 应至少有一个测试方法，或者应为 "static" 且方法由 "[AssemblyInitialize]" 和/或 "[AssemblyCleanup]" 标记
zh_hant: 測試類別 '{0}' 至少應有一個測試方法或是 'static'，而其方法是以 '[AssemblyInitialization]' 和/或 '[AssemblyCleanup]'標示。

# TestClassShouldHaveTestMethodTitle
source: Test class should have test method
cs: Testovací třída by měla mít testovací metodu
de: Die Testklasse muss eine Testmethode aufweisen.
es: La clase de prueba debe tener un método de prueba
fr: La classe de test doit avoir une méthode de test
it: La classe di test deve avere un metodo di test
ja: テスト クラスにはテスト メソッドが必要です
ko: 테스트 클래스에는 테스트 메서드가 있어야 합니다.
pl: Klasa testowa powinna mieć metodę testową
pt_br: A classe de teste deve ter um método de teste
ru: Тестовый класс должен содержать тестовый метод
tr: Test sınıfı test yöntemine sahip olmalıdır
zh_hans: 测试类应具有测试方法
zh_hant: 測試類別應該要有測試方法
