Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AssemblyCleanupShouldBeValidDescription
source: Methods marked with '[AssemblyCleanup]' should follow the following layout to be valid: -it can't be declared on a generic class -it should be 'public' -it should be 'static' -it should not be 'async void' -it should not be a special method (finalizer, operator...). -it should not be generic -it should either not take any parameter, or take a single parameter of type 'TestContext' -return type should be 'void', 'Task' or 'ValueTask' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -The class should be marked with '[TestClass]' (or a derived attribute) -the class should not be generic.
cs: Aby byly metody s označením [AssemblyCleanup] platné, musí se řídit následujícím rozložením: – Nesmí být deklarované pro obecnou třídu. – Musí být public. – Musí být static. – Nesmí být async void. – Nesmí být speciální metodou (finalizační metoda, operátor...). – Nesmí být obecné. – Nesmí přijímat žádný parametr, nebo musí přijímat jediný parametr typu TestContext. – Návratový typ musí být void, Task nebo ValueTask. Typ deklarující tyto metody by měl také respektovat následující pravidla: – Typ by měl být třída. – Třída by měla být public nebo internal (pokud testovací projekt používá atribut [DiscoverInternals]). – Třída by neměla být static. – Třída by měla být označena atributem [TestClass] (nebo odvozeným atributem). – Třída by neměla být obecná.
de: Methoden, die mit „[AssemblyCleanup]“ gekennzeichnet sind, müssen dem folgenden Layout folgen, um gültig zu sein: – kann nicht für eine generische Klasse deklariert werden – muss „public“ sein – muss „static“ sein – darf nicht „async void“ sein – darf keine spezielle Methode sein (Finalizer, Operator...) – darf nicht „generic“ sein – sollte entweder keinen Parameter oder einen einzelnen Parameter vom Typ „TestContext“ verwenden – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein Der Typ, der diese Methoden deklariert, sollte auch die folgenden Regeln beachten: – Der Typ sollte eine Klasse sein – Die Klasse muss „public“ oder „internal“ sein (wenn das Testprojekt das Attribut „[DiscoverInternals]“ verwendet) – Die Klasse darf nicht „static“ sein – Die Klasse muss mit „[TestClass]“ (oder einem abgeleiteten Attribut) markiert werden - die Klasse darf nicht generisch sein.
es: Los métodos marcados con '[AssemblyCleanup]' deben seguir el siguiente diseño para ser válidos: -no se puede declarar en una clase genérica - debería ser 'público' - debería estar 'estático' -no debe ser 'async void' -no debe ser un método especial (finalizador, operador...). -no debe ser genérico -no debe tomar ningún parámetro o tomar un único parámetro de tipo 'TestContext' - El tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' El tipo que declara estos métodos también debe respetar las reglas siguientes: -El tipo debe ser una clase -La clase debe ser 'public' o 'internal' (si el proyecto de prueba usa el atributo '[DiscoverInternals]') -La clase no debe ser 'static' -La clase debe marcarse con '[TestClass]' (o un atributo derivado) -la clase no debe ser genérica.
fr: Les méthodes marquées par « [AssemblyCleanup] » doivent respecter le schéma suivant pour être valides : -il ne peut pas être déclarée dans une classe générique – il doit être « public » – il doit être « static » – il ne doit pas être « async void » – Il ne doit pas s’agir d’une méthode spéciale (finaliseur, opérateur...). – il ne doit pas être générique - il ne doit pas prendre de paramètre ou prendre un seul paramètre de type 'TestContext' - le type de retour doit être « vide », « Task » ou « ValueTask » Le type déclarant ces méthodes doit également respecter les règles suivantes : Le type doit être une classe -La classe doit être « public » ou « internal » (si le projet de test utilise l’attribut ’[DiscoverInternals]’) -La classe ne doit pas être» ’static » -La classe doit être marquée par « [TestClass] » (ou un attribut dérivé) -la classe ne doit pas être générique.
it: I metodi contrassegnati con ‘[AssemblyCleanup]' devono seguire il layout seguente per essere validi: -Non può essere dichiarato in una classe generica - Deve essere 'public' - Deve essere 'static' - Non deve essere 'async void' - Non deve essere un metodo speciale (finalizzatore, operatore...). - Non deve essere generico - Non deve accettare alcun parametro o accettare un singolo parametro di tipo 'TestContext' - il tipo restituito deve essere 'void', 'Task' o 'ValueTask' Anche il tipo che dichiara questi metodi deve rispettare le regole seguenti: -Il tipo deve essere una classe -La classe deve essere 'public' o 'internal' (se il progetto di test usa l'attributo '[DiscoverInternals]') -La classe non deve essere 'static' -La classe deve essere contrassegnata con '[TestClass]' (o un attributo derivato) -La classe non deve essere generica.
ja: '[AssemblyCleanup]' でマークされたメソッドを有効にするには、次のレイアウトに従う必要があります: - ジェネリック クラスで宣言することはできません - 'public' である必要があります - 'static' である必要があります - 'async void' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。 - ジェネリックにすることはできません - パラメーターを受け取らないか、'TestContext' 型の 1 つのパラメーターを受け取る必要があります - 戻り値の型が 'void'、'Task'、または 'ValueTask' である必要があります これらのメソッドを宣言する型も、次の規則に従う必要があります: - 型はクラスである必要があります - クラスは 'public' または 'internal' である必要があります (テスト プロジェクトが '[DiscoverInternals]' 属性を使用している場合) - クラスを 'static' にすることはできません - クラスは '[TestClass]' (または派生属性) でマークする必要があります - クラスをジェネリックにすることはできません。
pl: Metody oznaczone za pomocą „[AssemblyCleanup]” powinny być zgodne z następującym układem, aby były prawidłowe: — nie może być zadeklarowana w klasie ogólnej — powinna być typu „public” — powinna mieć wartość „static” — nie powinna to być wartość „async void” — nie powinna to być metoda specjalna (finalizator, operator...). — nie powinna być ogólna — nie powinien przyjmować żadnego parametru lub przyjmować pojedynczego parametru typu „TestContext” — zwracany typ powinien mieć wartość „void”, „Taks” lub „ValueTask” Typ deklarujący te metody powinien również przestrzegać następujących reguł: — typ powinien być klasą — klasa powinna mieć wartość „public” lub „internal” (jeśli projekt testowy używa atrybutu „[DiscoverInternals]”) — klasa nie powinna mieć wartości „static” — klasa powinna być oznaczona „[TestClass]” (lub atrybutem pochodnym) — klasa nie powinna być ogólna.
pt_br: Os métodos marcados com '[AssemblyCleanup]' devem seguir o seguinte layout para serem válidos: -não pode ser declarado em uma classe genérica -deve ser 'public' -deve ser 'static' -não deve ser 'async void' -não deve ser um método especial (finalizador, operador...). -ele não deve ser genérico -ele não deve ter nenhum parâmetro ou usar um único parâmetro do tipo 'TestContext' -o tipo de retorno deve ser 'void', 'Task' ou 'ValueTask' O tipo declarando esses métodos também deve respeitar as seguintes regras: -O tipo deve ser uma classe -A classe deve ser 'public' ou 'internal' (se o projeto de teste estiver usando o '[DiscoverInternals]' atributo) -A classe não deve ser 'static' -A classe deve ser marcada com '[TestClass]' (ou um atributo derivado) -a classe não deve ser genérica.
ru: Чтобы метод, помеченный "[AssemblyCleanup]", был допустимым, он должен соответствовать следующим правилам: – не может быть объявлен для универсального класса ("generic"); – должен быть общедоступным ("public"); – должен быть статическим ("static"); – не должен быть асинхронным и не возвращающим значения ("async void") – не должен быть специальным (метод завершения, оператор…). – не должен быть общим ("generic") ; – не должен принимать никаких параметров или должен принимать один параметр типа TestContext ; – должен иметь тип возвращаемого значения "void", "Task" или "ValueTask"; Тип, объявляющий такие методы, также должен соответствовать следующим правилам: – должен быть классом; – класс должен быть объявлен как "public" или "internal" (если тестовый проект использует атрибут "[DiscoverInternals]"); – не должен быть статическим ("static"); – должен быть помечен как "[TestClass]" (или производный атрибут); – не должен быть универсальным ("generic").
tr: '[AssemblyCleanup]' ile işaretlenen yöntemlerin geçerli olması için aşağıdaki düzeni takip etmesi gerekir: -genel bir sınıfta tanımlanamaz -'public' olmalıdır -'static' olmalıdır -'async void' olmamalıdır -özel bir metot (sonlandırıcı, işleç...) olmamalıdır. - genel olmamalıdır -herhangi bir parametre almamalı veya 'TestContext' türünde tek bir parametre almalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalıdır Bu metotları bildiren türün ayrıca aşağıdaki kurallara uyması gerekir: -Tür bir sınıf olmalıdır -Sınıf 'public' veya 'internal' olmalıdır (test projesi '[DiscoverInternals]' niteliğini kullanıyorsa) -Sınıf 'static' olmamalıdır -Sınıf '[TestClass]' (veya türetilmiş bir öznitelik) ile işaretlenmelidir -sınıf genel olmamalıdır.
zh_hans: 标记有“[AssemblyCleanup]”的方法应遵循以下布局才会有效: -不能在泛型类上声明它 - 它应为“public” - 它应为“static” - 它不应为“async void” - 它不应是特殊方法（终结器、运算符...）。 - 它不应是泛型的 -它不应采用任何参数，或采用类型为“TestContext”的单个参数 - 返回类型应为“void”、“Task”或“ValueTask” 声明这些方法的类型还应遵循以下规则： -类型应为类 -类应为“public”或“internal”（如果测试项目正在使用“[DiscoverInternals]”属性） -类不应为“static” -应使用“[TestClass]”（或派生属性）标记类 -类不应是泛型的。
zh_hant: 標示為 '[AssemblyCleanup]' 的方法應該遵循下列配置才能有效: -其不能在泛型類別上宣告 -其應為 'public' -其應為 'static' -其不應為 'async void' -其不應為特殊方法 (完成項、運算子...)。 -其不應為泛型 -其不應接受任何參數，或接受類型為 'TestContext' 的單一參數 -傳回類型應為 'void'、'Task' 或 'ValueTask' 宣告這些方法的類型還應遵循以下規則: -類型應為類別 -類別應為 'public' 或 'internal' (如果測試專案使用 '[DiscoverInternals]' 屬性) -類別不應為 'static' -類別應標示為 '[TestClass]' (或衍生屬性) -類別不應為泛型。

# AssemblyCleanupShouldBeValidMessageFormat
source: AssemblyCleanup method '{0}' signature is invalid
cs: Signatura „{0}“ metody AssemblyCleanup je neplatná
de: Signatur der AssemblyCleanup-Methode "{0}" ist ungültig
es: La signatura "{0}" del método AssemblyCleanup no es válida
fr: La signature de la méthode AssemblyCleanup '{0}' n’est pas valide
it: La firma del metodo AssemblyCleanup '{0}' non è valida
ja: AssemblyCleanup メソッド '{0}' シグネチャが無効です
ko: AssemblyCleanup 메서드 '{0}' 시그니처가 잘못되었습니다.
pl: Podpis metody AssemblyCleanup „{0}” jest nieprawidłowy
pt_br: A assinatura do método AssemblyCleanup "{0}" é inválida
ru: Подпись метода AssemblyCleanup "{0}" недопустима
tr: AssemblyCleanup yöntemi '{0}' imzası geçersiz
zh_hans: AssemblyCleanup 方法“{0}”签名无效
zh_hant: AssemblyCleanup 方法 '{0}' 簽章無效

# AssemblyCleanupShouldBeValidTitle
source: AssemblyCleanup methods should have valid layout
cs: Metody AssemblyCleanup musí mít platné rozložení
de: AssemblyCleanup-Methoden müssen über ein gültiges Layout verfügen.
es: Los métodos AssemblyCleanup deben tener un diseño válido
fr: La méthode AssemblyCleanup doit avoir une disposition valide
it: Il metodo AssemblyCleanup deve avere un layout valido
ja: AssemblyCleanup メソッドには有効なレイアウトが必要です
ko: AssemblyCleanup 메서드에는 올바른 레이아웃이 있어야 합니다.
pl: Metody AssemblyCleanup powinny mieć prawidłowy układ
pt_br: Os métodos AssemblyCleanup devem ter um layout válido
ru: Методы AssemblyCleanup должны использовать допустимый макет
tr: AssemblyCleanup yöntemleri geçerli bir düzene sahip olmalıdır
zh_hans: AssemblyCleanup 方法应具有有效的布局
zh_hant: AssemblyCleanup 方法應該具有有效的配置

# AssemblyInitializeShouldBeValidDescription
source: Methods marked with '[AssemblyInitialize]' should follow the following layout to be valid: -it can't be declared on a generic class -it should be 'public' -it should be 'static' -it should not be 'async void' -it should not be a special method (finalizer, operator...). -it should not be generic -it should take one parameter of type 'TestContext' -return type should be 'void', 'Task' or 'ValueTask' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -The class should be marked with '[TestClass]' (or a derived attribute) -the class should not be generic.
cs: Aby byly metody s označením [AssemblyInitialize] platné, musí se řídit následujícím rozložením: – Nesmí být deklarované pro obecnou třídu. – Musí být public. – Musí být static. – Nesmí být async void. – Nesmí být speciální metodou (finalizační metoda, operátor...). – Nesmí být obecné. – Musí mít jeden parametr typu TestContext. – Návratový typ musí být void, Task nebo ValueTask. Typ deklarující tyto metody by měl také respektovat následující pravidla: – Typ by měl být třída. – Třída by měla být public nebo internal (pokud testovací projekt používá atribut [DiscoverInternals]). – Třída by neměla být static. – Třída by měla být označena atributem [TestClass] (nebo odvozeným atributem). – Třída by neměla být obecná.
de: Methoden, die mit „[AssemblyInitialize]“ gekennzeichnet sind, müssen dem folgenden Layout folgen, um gültig zu sein: – kann nicht für eine generische Klasse deklariert werden. – muss „public“ sein – muss „static“ sein – darf nicht „async void“ sein – darf keine spezielle Methode sein (Finalizer, Operator...) – darf nicht „generic“ sein – muss einen Parameter vom Typ „TestContext“ annehmen – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein Der Typ, der diese Methoden deklariert, sollte auch die folgenden Regeln beachten: – Der Typ sollte eine Klasse sein. – Die Klasse muss „public“ oder „internal“ sein (wenn das Testprojekt das Attribut „[DiscoverInternals]“ verwendet) – Die Klasse darf nicht „static“ sein. – Die Klasse muss mit „[TestClass]“ (oder einem abgeleiteten Attribut) markiert werden. - die Klasse darf nicht generisch sein.
es: Los métodos marcados con [AssemblyInitialize] deberían seguir el siguiente diseño para ser válidos: -no se puede declarar en una clase genérica - debería ser 'público' - debería estar 'estático' - no debería ser 'async void' -no debe ser un método especial (finalizador, operador...). -no debe ser genérico -debe tomar un parámetro de tipo 'TestContext' - El tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' El tipo que declara estos métodos también debe respetar las reglas siguientes: -El tipo debe ser una clase -La clase debe ser 'public' o 'internal' (si el proyecto de prueba usa el atributo '[DiscoverInternals]') -La clase no debe ser 'statico' -La clase debe marcarse con '[TestClass]' (o un atributo derivado) -la clase no debe ser genérica.
fr: Les méthodes marquées par « [AssemblyInitialize] » doivent respecter le schéma suivant pour être valides : -il ne peut pas être déclarée dans une classe générique – il doit être « public » – il doit être « static » – il ne doit pas être « async void » – Il ne doit pas s’agir d’une méthode spéciale (finaliseur, opérateur...). – il ne doit pas être générique – il doit prendre un paramètre de type « TestContext » - le type de retour doit être « vide », « Task » ou « ValueTask » Le type déclarant ces méthodes doit également respecter les règles suivantes : Le type doit être une classe -La classe doit être « public » ou « internal » (si le projet de test utilise l’attribut ’[DiscoverInternals]’) -La classe ne doit pas être» ’static » -La classe doit être marquée par « [TestClass] » (ou un attribut dérivé). -la classe ne doit pas être générique.
it: I metodi contrassegnati con ‘[AssemblyInitialize]’ devono seguire il layout seguente per essere validi: -Non può essere dichiarato in una classe generica - Deve essere 'public' - Deve essere 'static' - Non deve essere 'async void' - Non deve essere un metodo speciale (finalizzatore, operatore...). - Non deve essere generico - Deve accettare un parametro di tipo 'TestContext' - il tipo restituito deve essere 'void', 'Task' o 'ValueTask' Anche il tipo che dichiara questi metodi deve rispettare le regole seguenti: -Il tipo deve essere una classe -La classe deve essere 'public' o 'internal' (se il progetto di test usa l'attributo '[DiscoverInternals]') -La classe non deve essere 'static' -La classe deve essere contrassegnata con '[TestClass]' (o un attributo derivato). -La classe non deve essere generica.
ja: '[AssemblyInitialize]' でマークされたメソッドを有効にするには、次のレイアウトに従う必要があります: - ジェネリック クラスで宣言することはできません - 'public' である必要があります - 'static' である必要があります - 'async void' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。 - ジェネリックにすることはできません - 'TestContext' 型のパラメーターを 1 つ受け取る必要があります - 戻り値の型が 'void'、'Task'、または 'ValueTask' である必要があります これらのメソッドを宣言する型も、次の規則に従う必要があります: - 型はクラスである必要があります - クラスは 'public' または 'internal' である必要があります (テスト プロジェクトが '[DiscoverInternals]' 属性を使用している場合) - クラスを 'static' にすることはできません - クラスは '[TestClass]' (または派生属性) でマークする必要があります - クラスをジェネリックにすることはできません。
ko: '[AssemblyInitialize]'로 표시된 메서드가 유효하려면 다음 레이아웃을 따라야 합니다. -제네릭 클래스에서 선언할 수 없습니다. - 'public'이어야 합니다. - 'static'이어야 합니다. - 'async void'가 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다. - 제네릭이 아니어야 합니다. - 'TestContext' 형식의 매개 변수를 하나 사용해야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. 이러한 메서드를 선언하는 형식은 다음 규칙도 준수해야 합니다. -형식은 클래스여야 합니다. -클래스는 'public' 또는 'internal'이어야 합니다(테스트 프로젝트에서 '[DiscoverInternals]' 특성을 사용하는 경우). -클래스는 'static'이 되어서는 안 됩니다. -클래스는 '[TestClass]'(또는 파생 특성)로 표시되어야 합니다. -클래스는 제네릭이 아니어야 합니다.
pl: Metody oznaczone za pomocą „[AssemblyInitialize]” powinny być zgodne z następującym układem, aby były prawidłowe: — nie może być zadeklarowana w klasie ogólnej — powinna być typu „public” — powinna mieć wartość „static” — nie powinna to być wartość „async void” — nie powinna to być metoda specjalna (finalizator, operator...). — nie powinna być ogólna — powinna przyjmować jeden parametr typu „TestContext” — zwracany typ powinien mieć wartość „void”, „Taks” lub „ValueTask” Typ deklarujący te metody powinien również przestrzegać następujących reguł: — Typ powinien być klasą — Klasa powinna mieć wartość „public” lub „internal” (jeśli projekt testowy używa atrybutu „[DiscoverInternals]”) — Klasa nie powinna mieć wartości „static” — Klasa powinna być oznaczona znakiem „[TestClass]” (lub atrybutem pochodnym) — Klasa nie powinna być ogólna.
pt_br: Os métodos marcados com “[AssemblyInitialize]” devem seguir o seguinte layout para serem válidos: -não podem ser declarados em uma classe genérica -devem ser "públicos" -devem ser "estáticos" -não devem ser "nulos assíncronos" -não devem ser um método especial (finalizador, operador...). -não devem ser genéricos -devem usar um parâmetro do tipo “TestContext” -o tipo de retorno deve ser “nulo”, “Tarefa” ou “ValueTask” O tipo que declara esses métodos também deve respeitar as seguintes regras: -O tipo deve ser uma classe -A classe deve ser “público” ou '”interno” (se o projeto de teste estiver usando o atributo “[DiscoverInternals]”) -A classe não deve ser “estático” -A classe deve ser marcada com “[TestClass]” (ou um atributo derivado) -a classe não deve ser genérica.
ru: Чтобы метод, помеченный "[AssemblyInitialize]", был допустимым, он должен соответствовать следующим правилам: – не может быть объявлен для универсального класса ("generic"); – должен быть общедоступным ("public"); – должен быть статическим ("static"); – не быть асинхронным и не возвращающим значения ("async void") – не быть специальным (метод завершения, оператор…). – не быть общим ("generic") ; – должен принимать один параметр типа "TestContext"; – тип возвращаемого значения должен быть "void", "Task" или "ValueTask"; Тип, объявляющий такие методы, также должен соответствовать следующим правилам: – должен быть классом; – класс должен быть объявлен как "public" или "internal" (если тестовый проект использует атрибут "[DiscoverInternals]"); – не должен быть статическим ("static"); – должен быть помечен как "[TestClass]" (или производный атрибут); – не должен быть универсальным ("generic").
tr: '[AssemblyInitialize]' ile işaretlenen yöntemlerin geçerli olması için aşağıdaki düzeni izlemesi gerekir: -genel bir sınıfta tanımlanamaz -'public' olmalıdır -'static' olmalıdır -'async void' olmamalıdır -özel bir yöntem (sonlandırıcı, işleç...) olmamalıdır. - genel olmamalıdır - 'TestContext' türünden bir parametre almalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalı Bu yöntemleri bildiren tipin ayrıca aşağıdaki kurallara uyması gerekir: -Tür bir sınıf olmalıdır -Sınıf 'public' veya 'internal' olmalıdır (test projesi '[DiscoverInternals]' niteliğini kullanıyorsa) -Sınıf 'static' olmamalıdır -Sınıf '[TestClass]' (veya türetilmiş bir öznitelik) ile işaretlenmelidir -sınıf genel olmamalıdır.
zh_hans: 标记有“[AssemblyInitialize]”的方法应遵循以下布局才会有效: -不能在泛型类上声明它 - 它应为“public” - 它应为“static” - 它不应为“async void” - 它不应是特殊方法(终结器、运算符...)。 - 它不应是泛型的 - 它应采用“TestContext”类型的一个参数 - 返回类型应为“void”、“Task”或“ValueTask” 声明这些方法的类型还应遵循以下规则: -类型应为类 -类应为“public”或“internal”(如果测试项目正在使用“[DiscoverInternals]”属性) -类不应为“static” -应使用“[TestClass]”(或派生属性)标记类 -类不应是泛型的。
zh_hant: 標示為 '[AssemblyInitialize]' 的方法應該遵循下列配置才能有效: -其不能在泛型類別上宣告 - 其應為 'public' - 其應為 'static' - 其不應為 'async void' - 其不應為特殊方法 (完成項、運算子...)。 - 其不應為泛型 - 其應該接受類型為 'TestContext' 的一個參數 - 傳回類型應為 'void'、'Task' 或 'ValueTask' 宣告這些方法的類型還應遵循以下規則: -類型應為類別 -類別應為 'public' 或 'internal' (如果測試專案使用 '[DiscoverInternals]' 屬性) -類別不應為 'static' -類別應標示為 '[TestClass]' (或衍生屬性)。 -類別不應為泛型。

# AssemblyInitializeShouldBeValidMessageFormat
source: AssemblyInitialize method '{0}' signature is invalid
cs: Signatura „{0}“ metody AssemblyInitialize je neplatná
de: Signatur der AssemblyInitialize-Methode "{0}" ist ungültig
es: La signatura "{0}" del método AssemblyInitialize no es válida
fr: La signature de la méthode AssemblyInitialize '{0}' n’est pas valide
it: La firma del metodo AssemblyInitialize '{0}' non è valida
ja: AssemblyInitialize メソッド '{0}' シグネチャが無効です
ko: AssemblyInitialize 메서드 '{0}' 시그니처가 잘못되었습니다.
pl: Podpis metody AssemblyInitialize „{0}” jest nieprawidłowy
pt_br: A assinatura do método AssemblyInitialize "{0}" é inválida
ru: Подпись метода AssemblyInitialize "{0}" недопустима
tr: AssemblyInitialize yöntemi '{0}' imzası geçersiz
zh_hans: AssemblyInitialize 方法“{0}”签名无效
zh_hant: AssemblyInitialize 方法 '{0}' 簽章無效

# AssemblyInitializeShouldBeValidTitle
source: AssemblyInitialize methods should have valid layout
cs: Metody AssemblyInitialize musí mít platné rozložení
de: AssemblyInitialize-Methoden müssen über ein gültiges Layout verfügen.
es: Los métodos AssemblyInitialize deben tener un diseño válido
fr: La méthode AssemblyInitialize doit avoir une disposition valide
it: Il metodo AssemblyInitialize deve avere un layout valido
ja: AssemblyInitialize メソッドには有効なレイアウトが必要です
ko: AssemblyInitialize 메서드에는 유효한 레이아웃이 있어야 합니다.
pl: Metody AssemblyInitialize powinny mieć prawidłowy układ
pt_br: Os métodos AssemblyInitialize devem ter um layout válido
ru: Методы AssemblyInitialize должны использовать допустимый макет
tr: AssemblyInitialize yöntemleri geçerli bir düzene sahip olmalıdır
zh_hans: AssemblyInitialize 方法应具有有效的布局
zh_hant: AssemblyInitialize 方法應該具有有效的配置
