Repository: microsoft/testfx
Catalog: src/Analyzers/MSTest.Analyzers/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TestCleanupShouldBeValidDescription
source: Methods marked with '[TestCleanup]' should follow the following layout to be valid: -it should be 'public' -it should not be 'abstract' -it should not be 'async void' -it should not be 'static' -it should not be a special method (finalizer, operator...). -it should not be generic -it should not take any parameter -return type should be 'void', 'Task' or 'ValueTask' The type declaring these methods should also respect the following rules: -The type should be a class -The class should be 'public' or 'internal' (if the test project is using the '[DiscoverInternals]' attribute) -The class shouldn't be 'static' -If the class is 'sealed', it should be marked with '[TestClass]' (or a derived attribute).
cs: Aby byly metody s označením [TestCleanup] platné, musí se řídit následujícím rozložením: – Musí být public. – Nesmí být abstract. – Nesmí být async void. – Nesmí být static. – Nesmí být speciální metodou (finalizační metoda, operátor...). – Nesmí být obecné. – Nesmí přijímat žádný parametr. – Návratový typ musí být void, Task nebo ValueTask. Typ deklarující tyto metody by měl také respektovat následující pravidla: – Typ by měl být třída. – Třída by měla být public nebo internal (pokud testovací projekt používá atribut [DiscoverInternals]). – Třída by neměla být static. – Pokud je třída sealed, měla by být označena atributem [TestClass] (nebo odvozeným atributem).
de: Methoden, die mit „[TestCleanup]“ gekennzeichnet sind, müssen dem folgenden Layout folgen, um gültig zu sein: – muss „public“ sein – darf nicht „abstract“ sein – darf nicht „async void“ sein – darf nicht „static“ sein – darf keine spezielle Methode sein (Finalizer, Operator...) – darf nicht „generic“ sein – darf keinen Parameter annehmen – der Rückgabetyp muss „void“, „Task“ oder „ValueTask“ sein Der Typ, der diese Methoden deklariert, sollte auch die folgenden Regeln beachten: – Der Typ sollte eine Klasse sein. – Die Klasse muss „public“ oder „internal“ sein (wenn das Testprojekt das Attribut „[DiscoverInternals]“ verwendet) – Die Klasse darf nicht „static“ sein. – Wenn die Klasse „sealed“ ist, sollte sie mit „[TestClass]“ (oder einem abgeleiteten Attribut) markiert werden.
es: Los métodos marcados con '[TestCleanup]' deben seguir el siguiente diseño para ser válidos: - debería ser 'público' -no debe ser 'abstracta' - no debería ser 'async void' -no debe ser 'statico' -no debe ser un método especial (finalizador, operador...). -no debe ser genérico -no debe tomar ningún parámetro - El tipo de valor devuelto debe ser 'void', 'Task' o 'ValueTask' El tipo que declara estos métodos también debe respetar las reglas siguientes: -El tipo debe ser una clase -La clase debe ser 'public' o 'internal' (si el proyecto de prueba usa el atributo '[DiscoverInternals]') -La clase no debe ser 'statico' -Si la clase es 'sealed', debe marcarse con '[TestClass]' (o un atributo derivado).
fr: Les méthodes marquées par « [TestCleanup] » doivent respecter le schéma suivant pour être valides : – il doit être « public » – il ne doit pas être « abstract » – il ne doit pas être « async void » – il ne devrait pas être « static » – Il ne doit pas s’agir d’une méthode spéciale (finaliseur, opérateur...). – il ne doit pas être générique – il ne doit accepter aucun paramètre - le type de retour doit être « vide », « Task » ou « ValueTask » Le type déclarant ces méthodes doit également respecter les règles suivantes : Le type doit être une classe -La classe doit être « public » ou « internal » (si le projet de test utilise l’attribut ’[DiscoverInternals]’) -La classe ne doit pas être» ’static » -Si la classe est « sealed », elle doit être marquée avec « [TestClass] » (ou un attribut dérivé).
it: I metodi contrassegnati con ‘[TestCleanup]’ devono seguire il layout seguente per essere validi: - Deve essere 'public' - Non deve essere 'abstract' - Non deve essere 'async void' - Non deve essere 'static' - Non deve essere un metodo speciale (finalizzatore, operatore...). - Non deve essere generico - Non deve accettare alcun parametro - il tipo restituito deve essere 'void', 'Task' o 'ValueTask' Anche il tipo che dichiara questi metodi deve rispettare le regole seguenti: -Il tipo deve essere una classe -La classe deve essere 'public' o 'internal' (se il progetto di test usa l'attributo '[DiscoverInternals]') -La classe non deve essere 'static' -Se la classe è 'sealed', deve essere contrassegnata con '[TestClass]' (o un attributo derivato).
ja: '[TestCleanup]' でマークされたメソッドを有効にするには、次のレイアウトに従う必要があります: - 'public' である必要があります - 'abstract' にすることはできません - 'async void' にすることはできません - 'static' にすることはできません - 特殊なメソッド (ファイナライザー、演算子...) にすることはできません。 - ジェネリックにすることはできません - パラメーターを受け取ることができません - 戻り値の型が 'void'、'Task'、または 'ValueTask' である必要があります これらのメソッドを宣言する型も、次の規則に従う必要があります: - 型はクラスである必要があります - クラスは 'public' または 'internal' である必要があります (テスト プロジェクトが '[DiscoverInternals]' 属性を使用している場合) - クラスを 'static' にすることはできません -クラスが 'sealed' の場合は、'[TestClass]' (または派生属性) でマークする必要があります。
ko: '[TestCleanup]'으로 표시된 메서드가 유효하려면 다음 레이아웃을 따라야 합니다. - 'public'이어야 합니다. - 'abstract'가 아니어야 합니다. - 'async void'가 아니어야 합니다. - 'static'이 아니어야 합니다. - 특수 메서드(종료자, 연산자...)가 아니어야 합니다. - 제네릭이 아니어야 합니다. - 매개 변수를 사용하지 않아야 합니다. - 반환 형식은 'void', 'Task' 또는 'ValueTask'여야 합니다. 이러한 메서드를 선언하는 형식은 다음 규칙도 준수해야 합니다. -형식은 클래스여야 합니다. -클래스는 'public' 또는 'internal'이어야 합니다(테스트 프로젝트에서 '[DiscoverInternals]' 특성을 사용하는 경우). -클래스는 'static'이 되어서는 안 됩니다. -클래스가 'sealed'인 경우 '[TestClass]'(또는 파생 특성)로 표시되어야 합니다.
pl: Metody oznaczone jako „[TestCleanup]” powinny być zgodne z następującym układem, aby były prawidłowe: — powinna być typu „public” — nie powinna być typu „abstract” — nie powinna to być wartość „async void” — nie powinna być typu „static” — nie powinna to być metoda specjalna (finalizator, operator...). — nie powinna być ogólna — nie powinna przyjmować żadnego parametru — zwracany typ powinien mieć wartość „void”, „Taks” lub „ValueTask” Typ deklarujący te metody powinien również przestrzegać następujących reguł: — Typ powinien być klasą — Klasa powinna mieć wartość „public” lub „internal” (jeśli projekt testowy używa atrybutu „[DiscoverInternals]”) — Klasa nie powinna mieć wartości „static” — Jeśli klasa jest zapieczętowana, powinna być oznaczona znakiem „[TestClass]” (lub atrybutem pochodnym).
pt_br: Os métodos marcados com “[TestCleanup]” devem seguir o seguinte layout para serem válidos: -devem ser "públicos" -não devem ser “abstratos” -não devem ser "nulos assíncronos" -não devem ser "estáticos" -não devem ser um método especial (finalizador, operador...). -não devem ser genéricos -não devem usar nenhum parâmetro -o tipo de retorno deve ser “nulo”, “Tarefa” ou “ValueTask” O tipo que declara esses métodos também deve respeitar as seguintes regras: -O tipo deve ser uma classe -A classe deve ser “público” ou '”interno” (se o projeto de teste estiver usando o atributo “[DiscoverInternals]”) -A classe não deve ser “estático” -Se a classe for “selado”, ela deverá ser marcada com “[TestClass]” (ou um atributo derivado).
ru: Чтобы метод, помеченный "[TestCleanup]", был допустимым, он должен соответствовать следующим правилам: – быть общедоступным ("public") ; – не быть абстрактным ("abstract") ; – не быть асинхронным и не возвращающим значения ("async void") – не быть статическим ("static") – не быть специальным (метод завершения, оператор…). – не быть общим ("generic") ; – не принимать никаких параметров; – тип возвращаемого значения должен быть "void", "Task" или "ValueTask"; Тип, объявляющий такие методы, также должен соответствовать следующим правилам: – должен быть классом; – класс должен быть объявлен как "public" или "internal" (если тестовый проект использует атрибут "[DiscoverInternals]"); – не должен быть статическим ("static"); – если класс запечатанный, его следует пометить как "[TestClass]" (или производный атрибут).
tr: '[TestCleanup]' ile işaretlenen yöntemlerin geçerli olması için aşağıdaki düzeni takip etmesi gerekir: -'public' olmalıdır - 'abstract' olmamalıdır -'async void' olmamalıdır -'static' olmamalıdır -özel bir yöntem (sonlandırıcı, işleç...) olmamalıdır. - genel olmamalıdır - herhangi bir parametre almamalıdır - dönüş türü 'void', 'Task' veya 'ValueTask' olmalı Bu yöntemleri bildiren tipin ayrıca aşağıdaki kurallara uyması gerekir: -Tür bir sınıf olmalıdır --Sınıf 'public' veya 'internal' olmalıdır (test projesi '[DiscoverInternals]' niteliğini kullanıyorsa) -Sınıf 'static' olmamalıdır -Sınıf 'sealed' ise '[TestClass]' (veya türetilmiş bir öznitelik) ile işaretlenmelidir.
zh_hans: 标记有“[TestCleanup]”的方法应遵循以下布局才会有效: - 它应为“public” - 它不应为“abstract” - 它不应为“async void” - 它不应为“static” - 它不应是特殊方法(终结器、运算符...)。 - 它不应是泛型的 - 它不应采用任何参数 - 返回类型应为“void”、“Task”或“ValueTask” 声明这些方法的类型还应遵循以下规则: -类型应为类 -类应为“public”或“internal”(如果测试项目正在使用“[DiscoverInternals]”属性) -类不应为“static” -如果类为“sealed”，则应使用“[TestClass]”(或派生属性)标记该类。
zh_hant: 標示為 '[TestCleanup]' 的方法應該遵循下列配置才能有效: - 其應為 'public' - 其不應為 'abstract' - 其不應為 'async void' - 其不應為 'static' - 其不應為特殊方法 (完成項、運算子...)。 - 其不應為泛型 - 其不應接受任何參數 - 傳回類型應為 'void'、'Task' 或 'ValueTask' 宣告這些方法的類型還應遵循以下規則: -類型應為類別 -類別應為 'public' 或 'internal' (如果測試專案使用 '[DiscoverInternals]' 屬性) -類別不應為 'static' -如果類別是 'sealed'，則應標示為 '[TestClass]' (或衍生屬性)。

# TestCleanupShouldBeValidMessageFormat
source: TestCleanup method '{0}' signature is invalid
cs: Signatura „{0}“ metody TestCleanup je neplatná
de: Signatur der TestCleanup-Methode "{0}" ist ungültig
es: La signatura "{0}" del método TestCleanup no es válida
fr: La signature «{0}» de la méthode TestCleanup n’est pas valide
it: La firma del metodo TestCleanup '{0}' non è valida
ja: TestCleanup メソッド '{0}' シグネチャが無効です
ko: TestCleanup 메서드 '{0}' 시그니처가 잘못되었습니다.
pl: Podpis metody TestCleanup „{0}” jest nieprawidłowy
pt_br: A assinatura do método TestCleanup "{0}" é inválida
ru: Подпись метода TestCleanup "{0}" недопустима
tr: TestCleanup yöntemi '{0}' imzası geçersiz
zh_hans: TestCleanup 方法“{0}”签名无效
zh_hant: TestCleanup 方法 '{0}' 簽章無效

# TestCleanupShouldBeValidTitle
source: TestCleanup method should have valid layout
cs: Metoda TestCleanup by měla mít platné rozložení
de: Die TestCleanup-Methode muss über ein gültiges Layout verfügen.
es: El método TestCleanup debería tener un diseño válido
fr: La méthode TestCleanup doit avoir une disposition valide
it: Il metodo TestCleanup deve avere un layout valido
ja: TestCleanup メソッドには有効なレイアウトが必要です
ko: TestCleanup 메서드에는 유효한 레이아웃이 있어야 합니다.
pl: Metoda TestCleanup powinna mieć prawidłowy układ
pt_br: O método TestCleanup deve ter um layout válido
ru: Метод TestCleanup должен использовать допустимый макет
tr: TestCleanup yöntemi geçerli bir düzene sahip olmalıdır
zh_hans: TestCleanup 方法应该具有有效的布局
zh_hant: TestCleanup 方法應具有有效的配置

# TestContextShouldBeValidDescription
source: 'TestContext' should be a non-static field or property assigned in constructor or for a property set by MSTest, it should follow the layout: - it should be 'public' regardless of whether '[assembly: DiscoverInternals]' attribute is set or not. - it should not be 'static' - it should have a setter.
cs: TestContext musí být nestatické pole nebo vlastnost přiřazené v konstruktoru nebo pro vlastnost nastavenou přes MSTest. Musí se řídit následujícím rozložením: – Musí být public bez ohledu na to, jestli je nastavený atribut [assembly: DiscoverInternals]. – Nesmí být static. – Musí mít metodu setter.
de: „TestContext“ muss ein nicht statisches Feld oder eine nicht statische Eigenschaft sein, das im Konstruktor zugewiesen ist, oder für eine von MSTest festgelegte Eigenschaft sollte es dem Layout folgen: – es sollte „public“ sein, unabhängig davon, ob das Attribut „[assembly: DiscoverInternals]“ festgelegt ist oder nicht. – sie darf nicht „static“ sein – es sollte einen Setter aufweisen.
es: "TestContext" debe ser un campo no estático o una propiedad asignada en el constructor o para una propiedad establecida por MSTest, debe seguir el diseño: - debe ser "public" independientemente de si el atributo "[assembly: DiscoverInternals]" está establecido o no. - No debe ser "static" - debe tener un establecedor.
fr: « TestContext » doit être un champ ou une propriété non statique affecté dans le constructeur ou pour une propriété définie par MSTest, il doit suivre la disposition : - il doit être « public », que l’attribut « [assembly: DiscoverInternals] » soit défini ou non. - il ne devrait pas être « statique » - il doit avoir un setter.
it: 'TestContext' deve essere una proprietà o un campo non statico assegnato nel costruttore o per un insieme di proprietà da MSTest. Deve seguire il layout: - deve essere “pubblico” indipendentemente dal fatto che l'attributo “[assembly: DiscoverInternals]” sia impostato o meno. - non deve essere “statico” - deve avere un setter.
ja: 'TestContext' は、コンストラクターまたは MSTest によって設定されたプロパティに割り当てられた非静的フィールドまたはプロパティである必要があります。レイアウトに従う必要があります: - '[assembly: DiscoverInternals]' 属性が設定されているかどうかに関係なく、'public' である必要があります。 - 'static' にすることはできません - セッターが必要です。
pl: Element „TestContext” powinien być niestatycznym polem lub właściwością przypisaną w konstruktorze lub dla właściwości ustawionej przez narzędzie MSTest, powinien być zgodny z układem: — powinien mieć wartość „public” niezależnie od tego, czy ustawiono atrybut „[assembly: DiscoverInternals]”. — nie powinien mieć wartości „static” — powinien mieć metodę ustawiającą.
pt_br: 'TestContext' deve ser um campo ou propriedade não estática atribuída no construtor ou, para uma propriedade definida pelo MSTest, deve seguir o layout: - deve ser 'public' independentemente de o atributo '[assembly: DiscoverInternals]' estar definido ou não. - não deve ser 'static' - deve ter um setter.
ru: "TestContext" должно быть нестатическим полем или свойством, присваиваемым в конструкторе, или — для свойства, установленного MSTest — должно следовать набору правил: — оно должно быть объявлено как "public", независимо от того, задан ли атрибут "[assembly: DiscoverInternals]"; — оно не может быть объявлено как "static"; — для него должен быть определен метод задания.
tr: 'TestContext' statik olmayan bir alan veya oluşturucuda atanan bir özellik olmalıdır veya MSTest tarafından ayarlanan bir özellik kümesi için şu düzeni izlemelidir: - '[assembly: DiscoverInternals]' özniteliğinin ayarlanıp ayarlanmadığına bakılmaksızın 'public' olmalıdır. - 'static' olmamalıdır - bir ayarlayıcı içermelidir.
zh_hans: "TestContext" 应该是构造函数中分配的非静态字段或属性，或者对于 MSTest 设置的属性，它应遵循以下布局: - 无论是否设置 "[assembly: DiscoverInternals]" 属性，它都应为 "public"。 - 它不应为 "static" - 它应具有一个资源库。
zh_hant: 'TestContext' 應是在建構函式中指派的非靜態欄位或屬性，或是針對由 MSTest 所設定的屬性，其應遵循下列配置: - 它應該是 'public' (無論是否有設定 '[assembly: DiscoverInternals]' 屬性)。 - 它不應該是 'static' - 它應該有 setter。

# TestContextShouldBeValidTitle
source: Test context property should have valid layout
cs: Vlastnost kontextu testu by měla mít platné rozložení.
de: Die Testkontexteigenschaft muss ein gültiges Layout aufweisen.
es: La propiedad de contexto de prueba debe tener un diseño válido
fr: La propriété de contexte de test doit avoir une disposition valide
it: La proprietà di contesto del test deve avere un layout valido
ja: テスト コンテキスト プロパティには有効なレイアウトが必要です
ko: 테스트 컨텍스트 속성에 유효한 레이아웃이 있어야 합니다.
pl: Właściwość kontekstu testu powinna mieć prawidłowy układ
pt_br: A propriedade de contexto de teste deve ter um layout válido
ru: Тестовое контекстное свойство должно использовать допустимый макет
tr: Test bağlamı özelliğinin geçerli düzeni olmalıdır
zh_hans: 测试上下文属性应具有有效的布局
zh_hant: 測試內容屬性應該具有有效的配置
