Repository: microsoft/testfx
Catalog: src/Adapter/MSTestAdapter.PlatformServices/Resources/xlf/Resource.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hant

# AssemblyCleanupTimedOut
source: Assembly cleanup method '{0}.{1}' timed out after {2}ms
pt_br: O método de limpeza da montagem '{0}.{1}' atingiu o tempo limite após {2}ms
zh_hant: 組件清理方法 '{0}.{1}' 在 {2} 毫秒後已逾時

# AssemblyCleanupWasCancelled
source: Assembly cleanup method '{0}.{1}' was canceled
pt_br: O método de limpeza do assembly "{0}.{1}" foi cancelado
zh_hant: 已取消組件清理方法 '{0}.{1}'

# AssemblyInitializeTimedOut
source: Assembly initialize method '{0}.{1}' timed out after {2}ms
pt_br: O método de inicialização da montagem '{0}.{1}' atingiu o tempo limite após {2}ms
zh_hant: 組件初始化方法 '{0}.{1}' 在 {2} 毫秒後已逾時

# AssemblyInitializeWasCancelled
source: Assembly initialize method '{0}.{1}' was canceled
pt_br: O método de inicialização do assembly "{0}.{1}" foi cancelado
zh_hant: 已取消組件初始化方法 '{0}.{1}'

# CannotEnumerateIDataSourceAttribute
source: Exception occurred while enumerating IDataSource attribute on "{0}.{1}": {2}
pt_br: Ocorreu uma exceção ao enumerar o atributo IDataSource em "{0}.{1}": {2}
zh_hant: 列舉「{0}.{1}」上的 IDataSource 屬性時發生例外狀況: {2}

# CannotExpandIDataSourceAttribute
source: Exception occurred while expanding IDataSource rows from attribute on "{0}.{1}": {2}
pt_br: Ocorreu uma exceção ao expandir as linhas IDataSource do atributo em "{0}.{1}": {2}
zh_hant: 從「{0}.{1}」上的屬性展開 IDataSource 資料列時發生例外狀況: {2}

# CannotExpandIDataSourceAttribute_CannotSerialize
source: Data on index {0} for "{1}" cannot be serialized. All data provided through "IDataSource" should be serializable. If you need to test non-serializable data sources, please make sure you add "TestDataSourceDiscovery" attribute on your test assembly and set the discovery option to "DuringExecution".
pt_br: Os dados no índice {0} para "{1}" não podem ser serializados. Todos os dados fornecidos por meio de "IDataSource" devem ser serializáveis. Se você precisar testar fontes de dados não serializáveis, certifique-se de adicionar o atributo "TestDataSourceDiscovery" em seu assembly de teste e defina a opção de descoberta como "DuringExecution".
zh_hant: 無法序列化「{1}"」索引 {0} 上的資料。透過「IDataSource」提供的所有資料應可序列化。如果您需要測試不可序列化的資料來源，請務必在測試元件上新增「TestDataSourceDiscovery」屬性，並將探索選項設定為「DuringExecution」。

# CannotExpandIDataSourceAttribute_DuplicateDisplayName
source: Display name "{2}" on indexes {0} and {1} are duplicate. Display names should be unique.
pt_br: O nome de exibição "{2}" nos índices {0} e {1} são duplicados. Os nomes de exibição devem ser exclusivos.
zh_hant: 索引 {0} 和 {1} 上的顯示名稱「{2}」重複。顯示名稱必須是唯一的。

# CannotFindFile
source: Could not find file '{0}'.
cs: Soubor {0} se nenašel.
de: Die Datei "{0}" konnte nicht gefunden werden.
es: No se pudo encontrar el archivo '{0}'.
fr: Le fichier '{0}' est introuvable.
it: Il file '{0}' non è stato trovato.
ja: ファイル '{0}' が見つかりませんでした。
ko: '{0}' 파일을 찾을 수 없습니다.
pl: Nie można odnaleźć pliku „{0}”.
pt_br: Não foi possível encontrar o arquivo '{0}'.
ru: Не удалось найти файл "{0}".
tr: '{0}' adlı dosya bulunamadı.
zh_hant: 找不到檔案 '{0}'。

# CannotRunTestArgumentsMismatchError
source: Cannot run test method '{0}.{1}': Test data doesn't match method parameters. Either the count or types are different. Test expected {2} parameter(s), with types '{3}', but received {4} argument(s), with types '{5}'.
pt_br: Não é possível executar o método de teste '{0}.{1}': Os dados de teste não correspondem aos parâmetros do método. A contagem ou os tipos são diferentes. Testar {2} parâmetros esperados, com tipos '{3}', mas {4} argumentos recebidos, com tipos '{5}'.
zh_hant: 無法執行測試方法 '{0}.{1}': 測試資料不符合方法參數。計數或類型不同。 測試預期的 {2} 參數，類型為 '{3}'， 但收到 {4} 引數，類型為 '{5}'。

# CannotRunTestMethodNoDataError
source: Cannot run test method '{0}.{1}': Method has parameters, but does not define any test source. Use '[DataRow]', '[DynamicData]', or a custom 'ITestDataSource' data source to provide test data.
pt_br: Não é possível executar o método de teste '{0}.{1}': o método tem parâmetros, mas não define nenhuma fonte de teste. Use '[DataRow]', '[DynamicData]' ou uma fonte de dados 'ITestDataSource' personalizada para fornecer dados de teste.
zh_hant: 無法執行測試方法 '{0}.{1}': 方法具有參數，但未定義任何測試來源。使用 '[DataRow]'、'[DynamicData]' 或自訂 'ITestDataSource' 資料來源來提供測試資料。

# ClassCleanupTimedOut
source: Class cleanup method '{0}.{1}' timed out after {2}ms
pt_br: O método de limpeza da classe '{0}.{1}' atingiu o tempo limite após {2}ms
zh_hant: 類別清理方法 '{0}.{1}' 在 {2} 毫秒後已逾時

# ClassCleanupWasCancelled
source: Class cleanup method '{0}.{1}' was canceled
pt_br: O método de limpeza de classe "{0}.{1}" foi cancelado
zh_hant: 已取消類別清理方法 '{0}.{1}'

# ClassInitializeTimedOut
source: Class initialize method '{0}.{1}' timed out after {2}ms
pt_br: O método de inicialização da classe '{0}.{1}' atingiu o tempo limite após {2}ms
zh_hant: 類別初始化方法 '{0}.{1}' 在 {2} 毫秒後已逾時

# ClassInitializeWasCancelled
source: Class initialize method '{0}.{1}' was canceled
pt_br: O método de inicialização de classe "{0}.{1}" foi cancelado
zh_hant: 已取消類別初始化方法 '{0}.{1}'

# Common_CannotBeNullOrEmpty
source: The parameter should not be null or empty.
cs: Parametr nemůže být null nebo prázdný.
de: Der Parameter darf nicht NULL oder leer sein.
es: El parámetro no debe ser NULL ni estar vacío.
fr: Le paramètre ne doit pas être une valeur Null ou être vide.
it: Il parametro non deve essere vuoto o Null.
ja: パラメーターを null または空にすることはできません。
ko: 매개 변수는 null이거나 비워 둘 수 없습니다.
pl: Parametr nie może mieć wartości null ani być pusty.
pt_br: O parâmetro não deve ser nulo ou vazio.
ru: Этот параметр не должен быть пустым или иметь значение NULL.
tr: Parametre null veya boş olmamalıdır.
zh_hant: 參數不可為 null 或空白。

# CouldNotInspectTypeDuringDiscovery
source: MSTestAdapter failed to discover tests in class '{0}' of assembly '{1}' because {2}.
pt_br: O MSTestAdapter não conseguiu descobrir testes na classe '{0}' do assembly '{1}' devido a {2}.
zh_hant: MSTestAdapter 無法在組件 '{1}' 的類別 '{0}' 中探索測試，因為 {2}。

# DataDrivenResultDisplayName
source: {0} (Data Row {1})
pt_br: {0} (Linha de Dados {1})
zh_hant: {0} (資料列 {1})

# DebugTraceBanner
source: Debug Trace:
pt_br: Rastreamento de Depuração:
zh_hant: 偵錯追蹤:

# DeploymentErrorBadDeploymentItem
source: Test Run deployment issue: Bad deployment item: '{0}': output directory '{1}' specifies the item to be deployed outside deployment root directory which is not allowed.
cs: Problém nasazení testovacího běhu: Chybná položka nasazení: {0}: výstupní adresář {1} určuje položku, která se má nasadit mimo kořenový adresář nasazení, což není povolené.
de: Problem bei der Testlaufbereitstellung: Ungültiges Bereitstellungselement: "{0}". Das Ausgabeverzeichnis "{1}" gibt das unzulässige Element an, das außerhalb des Bereitstellungsstammverzeichnisses bereitgestellt werden soll.
es: Problema de implementación en la serie de pruebas: elemento de implementación incorrecto '{0}': el directorio de salida '{1}' especifica el elemento que se va a implementar fuera del directorio raíz de implementación, lo cual no está permitido.
fr: Problème de déploiement de la série de tests : élément de déploiement incorrect : '{0}' : le répertoire de sortie '{1}' spécifie l'élément à déployer en dehors du répertoire racine du déploiement, ce qui n'est pas autorisé.
it: Problema di distribuzione dell'esecuzione dei test: l'elemento di distribuzione '{0}' non è corretto. La directory di output '{1}' specifica l'elemento da distribuire all'esterno della directory radice della distribuzione e questa operazione non consentita.
ja: テストの実行の配置問題です: 配置項目が正しくありません: '{0}': 出力ディレクトリ '{1}' は、項目が配置ルート ディレクトリ外に配置されるように指定していますが、それは許可されません。
ko: 테스트 실행 배포 문제: 잘못된 배포 항목: '{0}': 출력 디렉터리 '{1}'에서 항목을 배포 루트 디렉터리 외부에 배포하도록 지정하며 이는 허용되지 않습니다.
pl: Problem wdrażania przebiegu testu: nieprawidłowy element wdrożenia: „{0}”: katalog wyjściowy „{1}” określa element do wdrożenia poza głównym katalogiem wdrożenia. Taka sytuacja jest niedozwolona.
pt_br: Problema de implantação de Execução de Teste: item de implantação inválido: '{0}': o diretório de saída '{1}' especifica o item a ser implantado fora do diretório raiz de implantação, o que não é permitido.
ru: Ошибка развертывания при тестовом запуске: недопустимый элемент развертывания "{0}". В выходном каталоге "{1}" указано, что развертывание этого элемента должно быть выполнено не в корневом каталоге развертывания, что запрещено.
tr: Test Çalıştırması dağıtım sorunu: '{0}' dağıtım öğesi hatalı: '{1}' çıktı dizininde öğenin dağıtım kök dizini dışında dağıtılması gerektiği belirtilmiş, ancak buna izin verilmiyor.
zh_hant: 測試回合部署問題: 部署項目錯誤: '{0}': 輸出目錄 '{1}' 指定要將項目部署到部署根目錄之外，但不允許這情況。

# DeploymentErrorFailedToAccesOutputDirectory
source: Test Run deployment issue: Failed to access output directory '{1}' specified by deployment item '{0}', the item will not be deployed: {2}: {3}
cs: Problém nasazení testovacího běhu: Nepodařilo se získat přístup k výstupnímu adresáři {1} zadanému položkou nasazení {0}, položka se nenasadí: {2}: {3}
de: Problem bei der Testlaufbereitstellung: Fehler beim Zugriff auf das vom Bereitstellungselement "{0}" angegebene Ausgabeverzeichnis "{1}". Das Element wird nicht bereitgestellt: {2}: {3}
es: Problema de implementación en la serie de pruebas: no se pudo acceder al directorio de salida '{1}' especificado por el elemento de implementación '{0}', el elemento no se implementará {2}: {3}
fr: Problème de déploiement de la série de tests : échec de l'accès au répertoire de sortie '{1}' spécifié par l'élément de déploiement '{0}', l'élément ne sera pas déployé : {2} : {3}
it: Problema di distribuzione dell'esecuzione dei test: non è stato possibile accedere alla directory di output '{0}' specificata dall'elemento di distribuzione '{1}'. L'elemento non verrà distribuito: {2}: {3}
ja: テストの実行の配置問題です: 配置項目 '{0}' によって指定された出力ディレクトリ '{1}' にアクセスできません。項目は配置されません: {2}: {3}
ko: 테스트 실행 배포 문제: 배포 항목 '{0}'에 의해 지정된 출력 디렉터리 '{1}'에 액세스하지 못했습니다. 항목이 배포되지 않음: {2}: {3}
pl: Problem wdrażania przebiegu testu: nie można uzyskać dostępu do katalogu wyjściowego „{1}” określonego przy użyciu elementu wdrożenia „{0}”. Nie można wdrożyć elementu: {2}: {3}
pt_br: Problema de implantação de Execução de Teste: falha ao acessar o diretório de saída '{1}' especificado pelo item de implantação '{0}', o item não será implantado: {2}: {3}
ru: Ошибка развертывания тестового запуска: не удалось получить доступ к выходному каталогу "{1}", указанному элементом развертывания "{0}"; элемент не будет развернут: {2}: {3}
tr: Test Çalıştırması dağıtım sorunu: '{0}' dağıtım öğesi tarafından belirtilen '{1}' çıktı dizinine erişilemedi, öğe dağıtılmayacak: {2}: {3}
zh_hant: 測試回合部署問題: 無法存取由部署項目 '{0}' 指定的輸出目錄 '{1}'，將不會部署該項目: {2}: {3}

# DeploymentErrorFailedToAccessFile
source: Test Run deployment issue: Failed to access the file '{0}': {1}: {2}
cs: Problém nasazení testovacího běhu: Nepodařilo se získat přístup k souboru {0}: {1}: {2}
de: Problem bei der Testlaufbereitstellung: Fehler beim Zugriff auf die Datei "{0}": {1}: {2}
es: Problema de implementación en la serie de pruebas: no se pudo acceder al archivo '{0}': {1}: {2}
fr: Problème de déploiement de la série de tests : échec de l'accès au fichier '{0}' : {1} : {2}
it: Problema di distribuzione dell'esecuzione dei test: non è stato possibile accedere al file '{0}': {1}: {2}
ja: テストの実行の配置問題です: ファイル '{0}' にアクセスできませんでした: {1}: {2}
ko: 테스트 실행 배포 문제: '{0}' 파일에 액세스하지 못함: {1}: {2}
pl: Problem wdrażania przebiegu testu: nie można uzyskać dostępu do pliku „{0}”: {1}: {2}
pt_br: Problema de implantação de Execução de Teste: falha ao acessar o arquivo '{0}': {1}: {2}
ru: Ошибка развертывания тестового запуска: не удалось получить доступ к файлу "{0}": {1}: {2}
tr: Test Çalıştırması dağıtım sorunu: '{0}' adlı dosyaya erişilemedi: {1}: {2}
zh_hant: 測試回合部署問題: 無法存取檔案 '{0}': {1}: {2}

# DeploymentErrorFailedToCopyWithOverwrite
source: Test Run deployment issue: Failed to copy file '{0}' to '{1}': {2}: {3}
cs: Problém nasazení testovacího běhu: Nepodařilo se zkopírovat soubor {0} do {1}: {2}: {3}
de: Problem bei der Testlaufbereitstellung: Fehler beim Kopieren der Datei "{0}" nach "{1}": {2}: {3}
es: Problema de implementación en la serie de pruebas: no se pudo copiar el archivo '{0}' en '{1}': {2}: {3}
fr: Problème de déploiement de la série de tests : échec de la copie du fichier '{0}' dans '{1}' : {2} : {3}
it: Problema di distribuzione dell'esecuzione dei test: non è stato possibile copiare il file '{0}' in '{1}': {2}: {3}
ja: テストの実行の配置問題です: ファイル '{0}' を '{1}' にコピーできませんでした: {2}: {3}
ko: 테스트 실행 배포 문제: '{0}' 파일을 '{1}'에 복사하지 못함: {2}: {3}
pl: Problem wdrażania przebiegu testu: nie można skopiować pliku „{0}” do „{1}”: {2}: {3}
pt_br: Problema de implantação de Execução de Teste: falha ao copiar o arquivo '{0}' em '{1}': {2}: {3}
ru: Ошибка развертывания тестового запуска: не удалось скопировать файл "{0}" в "{1}": {2}: {3}
tr: Test Çalıştırması dağıtım sorunu: '{0}' dosyası '{1}' hedefine kopyalanamadı: {2}: {3}
zh_hant: 測試回合部署問題: 無法將檔案 '{0}' 複製到 '{1}': {2}: {3}

# DeploymentErrorFailedToDeployDependencies
source: Test Run deployment issue: Failed to deploy dependencies for test storage '{0}': {1}
cs: Problém nasazení testovacího běhu: Nepodařilo se nasadit závislosti úložiště testů {0}: {1}
de: Problem bei der Testlaufbereitstellung: Fehler beim Bereitstellen der Abhängigkeiten für den Testspeicher "{0}": {1}
es: Problema de implementación en la serie de pruebas: no se pudo implementar dependencias para el almacenamiento de prueba '{0}': {1}
fr: Problème de déploiement de la série de tests : échec du déploiement des dépendances pour le stockage de test '{0}' : {1}
it: Problema di distribuzione dell'esecuzione dei test: non è stato possibile distribuire le dipendenze per l'archivio dei test '{0}': {1}
ja: テストの実行の配置問題です: テスト ストレージ '{0}' の依存関係を配置できませんでした: {1}
ko: 테스트 실행 배포 문제: 테스트 스토리지 '{0}'에 대한 종속성을 배포하지 못함: {1}
pl: Problem wdrażania przebiegu testu: nie można wdrożyć zależności dla magazynu testowego „{0}”: {1}
pt_br: Problema de implantação de Execução de Teste: falha ao implantar dependências para o armazenamento de teste '{0}': {1}
ru: Ошибка развертывания тестового запуска: не удалось развернуть зависимости для тестового хранилища "{0}": {1}
tr: Test Çalıştırması dağıtım sorunu: '{0}' adlı test depolama alanı için bağımlılıklar dağıtılamadı: {1}
zh_hant: 測試回合部署問題: 無法部署測試儲存區 '{0}' 的相依性: {1}

# DeploymentErrorFailedToGetFileForDeploymentItem
source: Test Run deployment issue: Failed to get the file for {0}: {1}: {2}
cs: Problém nasazení testovacího běhu: Nepodařilo se získat soubor pro {0}: {1}: {2}
de: Problem bei der Testlaufbereitstellung: Fehler beim Abrufen der Datei für {0}: {1}: {2}
es: Problema de implementación en la serie de pruebas: no se pudo obtener el archivo para {0}: {1}: {2}
fr: Problème de déploiement de la série de tests : échec de l'obtention du fichier pour {0} : {1} : {2}
it: Problema di distribuzione dell'esecuzione dei test: non è stato possibile ottenere il file per {0}: {1}: {2}
ja: テストの実行の配置問題です: {0} のファイルを取得できませんでした: {1}: {2}
ko: 테스트 실행 배포 문제: {0}에 대한 파일을 가져오지 못함: {1}: {2}
pl: Problem wdrażania przebiegu testu: nie można uzyskać pliku dla elementu {0}: {1}: {2}
pt_br: Problema de implantação de Execução de Teste: falha ao obter o arquivo para {0}: {1}: {2}
ru: Ошибка развертывания тестового запуска: не удалось получить файл для {0}: {1}: {2}
tr: Test Çalıştırması dağıtım sorunu: {0} için dosya alınamadı: {1}: {2}
zh_hant: 測試回合部署問題: 無法取得 {0} 的檔案: {1}: {2}

# DeploymentErrorGettingSatellite
source: Test Run deployment issue: an error occurred while getting satellite assemblies for {0}: {1}: {2}
cs: Problém nasazení testovacího běhu: Během získávání satelitních sestavení pro {0}: {1}: {2} došlo k chybě
de: Problem bei der Testlaufbereitstellung: Fehler beim Abrufen der Satellitenassemblys für {0}: {1}: {2}
es: Problema de implementación en la serie de pruebas: no se pudo obtener los ensamblados satélite para {0}: {1}: {2}
fr: Problème de déploiement de la série de tests : une erreur s'est produite durant l'obtention des assemblys satellites pour {0} : {1} : {2}
it: Problema di distribuzione dell'esecuzione dei test: si è verificato un errore durante il recupero degli assembly satellite per {0}: {1}: {2}
ja: テストの実行の配置問題です: {0} のサテライト アセンブリを取得中にエラーが発生しました: {1}: {2}
ko: 테스트 실행 배포 문제: {0}에 대한 위성 어셈블리를 가져오는 동안 오류 발생: {1}: {2}
pl: Problem wdrażania przebiegu testu: wystąpił błąd podczas pobierania zestawów satelickich dla elementu {0}: {1}: {2}
pt_br: Problema de implantação de Execução de Teste: ocorreu um erro ao obter assemblies satélites para {0}: {1}: {2}
ru: Ошибка развертывания тестового запуска: произошла ошибка при получении вспомогательных сборок для {0}: {1}: {2}
tr: Test Çalıştırması dağıtım sorunu: {0} için uydu bütünleştirilmiş kodları alınırken bir hata oluştu: {1}: {2}
zh_hant: 測試回合部署問題: 取得 {0} 的附屬組件時發生錯誤: {1}: {2}

# DeploymentItem
source: deployment item '{0}'
cs: položka nasazení {0}
de: Bereitstellungselement "{0}"
es: elemento de implementación '{0}'
fr: élément de déploiement '{0}'
it: elemento di distribuzione '{0}'
ja: 配置項目 '{0}'
ko: 배포 항목 '{0}'
pl: element wdrożenia „{0}”
pt_br: item de implantação '{0}'
ru: элемент развертывания "{0}"
tr: '{0}' dağıtım öğesi
zh_hant: 部署項目 '{0}'

# DeploymentItemContainsInvalidCharacters
source: Invalid deployment item: the specified path '{0}' or output directory '{1}' contains illegal characters.
cs: Neplatná položka nasazení: Zadaná cesta {0} nebo adresář výstupu {1} obsahuje neplatné znaky.
de: Ungültiges Bereitstellungselement: Der angegebene Pfad "{0}" oder das angegebene Ausgabeverzeichnis "{1}" enthält unzulässige Zeichen.
es: Elemento de implementación no válido: la ruta de acceso '{0}' o el directorio de salida '{1}' especificados contienen caracteres no válidos.
fr: Élément de déploiement non valide : le chemin '{0}' ou le répertoire de sortie '{1}' spécifié contient des caractères non conformes.
it: Elemento di distribuzione non valido: la directory di output '{1}' o il percorso specificato '{0}' contiene caratteri non validi.
ja: 無効な配置項目です: 指定されたパス '{0}' または出力ディレクトリ '{1}' に使用できない文字が含まれています。
ko: 잘못된 배포 항목: 지정된 경로 '{0}' 또는 출력 디렉터리 '{1}'에 잘못된 문자가 들어 있습니다.
pl: Nieprawidłowy element wdrożenia: wybrana ścieżka „{0}” lub katalog wyjściowy „{1}” zawiera niedozwolone znaki.
pt_br: Item de implantação inválido: o caminho especificado '{0}' ou o diretório de saída '{1}' contém caracteres ilegais.
ru: Недопустимый элемент развертывания: указанный путь "{0}" или выходной каталог "{1}" содержат недопустимые символы.
tr: Geçersiz dağıtım öğesi: Belirtilen '{0}' yolu veya '{1}' çıktı dizini geçersiz karakterler içeriyor.
zh_hant: 部署項目無效: 指定的路徑 '{0}' 或輸出目錄 '{1}' 含有非法字元。

# DeploymentItemOutputDirectoryCannotBeNull
source: Invalid deployment item: the output directory cannot be null.
cs: Neplatná položka nasazení: Adresář výstupu nemůže být null.
de: Ungültiges Bereitstellungselement: Das Ausgabeverzeichnis darf nicht NULL sein.
es: Elemento de implementación no válido: el directorio de salida no puede ser un valor nulo.
fr: Élément de déploiement non valide : le répertoire de sortie doit être défini.
it: Elemento di distribuzione non valido: la directory di output non può essere Null.
ja: 無効な配置項目です: 出力ディレクトリを null にすることはできません。
ko: 잘못된 배포 항목: 출력 디렉터리는 null일 수 없습니다.
pl: Nieprawidłowy element wdrożenia: katalog wyjściowy nie może mieć wartości null.
pt_br: Item de implantação inválido: o diretório de saída não pode ser nulo.
ru: Недопустимый элемент развертывания: выходной каталог не может быть NULL.
tr: Geçersiz dağıtım öğesi: Çıktı dizini null olamaz.
zh_hant: 部署項目無效: 輸出目錄不可為 null。

# DeploymentItemOutputDirectoryMustBeRelative
source: Invalid deployment item: the specified output directory '{0}' is not relative.
cs: Neplatná položka nasazení: Zadaný adresář výstupu {0} nemá relativní adresu.
de: Ungültiges Bereitstellungselement: Das angegebene Ausgabeverzeichnis "{0}" ist nicht relativ.
es: Elemento de implementación no válido: el directorio de salida especificado '{0}' no es relativo.
fr: Élément de déploiement non valide : le répertoire de sortie '{0}' spécifié n'est pas relatif.
it: Elemento di distribuzione non valido: la directory di output specificata '{0}' non è relativa.
ja: 無効な配置項目です: 指定された出力ディレクトリ '{0}' は相対ではありません。
ko: 잘못된 배포 항목: 지정된 출력 디렉터리 '{0}'이(가) 상대 디렉터리가 아닙니다.
pl: Nieprawidłowy element wdrożenia: wybrany katalog wyjściowy „{0}” nie jest względny.
pt_br: Item de implantação inválido: o diretório de saída '{0}' especificado não é relativo.
ru: Недопустимый элемент развертывания: указанный выходной каталог "{0}" не является относительным.
tr: Geçersiz dağıtım öğesi: Belirtilen '{0}' çıktı dizini göreli değil.
zh_hant: 部署項目無效: 指定的輸出目錄 '{0}' 不是相對目錄。

# DeploymentItemPathCannotBeNullOrEmpty
source: Invalid deployment item: the path must contain at least one character.
cs: Neplatná položka nasazení: Cesta musí obsahovat minimálně jeden znak.
de: Ungültiges Bereitstellungselement: Der Pfad muss mindestens ein Zeichen enthalten.
es: Elemento de implementación no válido: la ruta de acceso debe contener al menos un carácter.
fr: Élément de déploiement non valide : le chemin doit contenir au moins un caractère.
it: Elemento di distribuzione non valido: il percorso deve contenere almeno un carattere.
ja: 無効な配置項目です: パスは少なくとも 1 つの文字を含んでいなければなりません。
ko: 잘못된 배포 항목: 경로에는 하나 이상의 문자가 포함되어 있어야 합니다.
pl: Nieprawidłowy element wdrożenia: ścieżka musi zawierać co najmniej jeden znak.
pt_br: Item de implantação inválido: o caminho deve conter ao menos um caractere.
ru: Недопустимый элемент развертывания: путь должен содержать по меньшей мере один символ.
tr: Geçersiz dağıtım öğesi: Yol, en az bir karakter içermelidir.
zh_hant: 部署項目無效: 路徑至少必須包含一個字元。

# DeploymentItemWithOutputDirectory
source: deployment item '{0}' (output directory '{1}')
cs: položka nasazení {0} (adresář výstupu {1})
de: Bereitstellungselement "{0}" (Ausgabeverzeichnis "{1}")
es: elemento de implementación '{0}' (directorio de salida '{1}')
fr: élément de déploiement '{0}' (répertoire de sortie '{1}')
it: elemento di distribuzione '{0}' (directory di output '{1}')
ja: 配置項目 '{0}' (出力ディレクトリ '{1}')
ko: 배포 항목 '{0}'(출력 디렉터리 '{1}')
pl: element wdrożenia „{0}” (katalog wyjściowy „{1}”)
pt_br: item de implantação '{0}' (diretório de saída '{1}')
ru: элемент развертывания "{0}" (выходной каталог "{1}")
tr: '{0}' dağıtım öğesi (çıktı dizini '{1}')
zh_hant: 部署項目 '{0}' (輸出目錄 '{1}')

# DiscoveryWarning
source: [MSTest][Discovery][{0}] {1}
pt_br: [MSTest][Descoberta][{0}] {1}

# DuplicateConfigurationError
source: Both '.runsettings' and '.testconfig.json' files have been detected. Please select only one of these test configuration files.
pt_br: Ambos os arquivos '.runsettings' e '.testconfig.json' foram detectados. Selecione apenas um desses arquivos de configuração de teste.
zh_hant: 偵測到 '.runsettings' 和 '.testconfig.json' 檔案。請只選取其中一個測試設定檔。

# ExceptionOccuredWhileGettingTheExceptionDescription
source: "{0}": (Failed to get exception description due to an exception of type "{1}".
pt_br: "{0}": (Falha ao obter a descrição da exceção devido a uma exceção do tipo "{1}".
zh_hant: 「{0}」: (因為類型「{1}」的例外狀況而無法取得例外狀況描述。

source: Exceptions thrown:
pt_br: Exceções lançadas:
zh_hant: 擲回的例外狀況數:

# Execution_Test_Cancelled
source: Test '{0}' was canceled
pt_br: O teste "{0}" foi cancelado
zh_hant: 測試 '{0}' 已取消

# Execution_Test_Timeout
source: Test '{0}' timed out after {1}ms
pt_br: O teste "{0}" atingiu o tempo limite após {1}ms
zh_hant: 測試 '{0}' 在 {1} 毫秒後逾時

# FailedToGetCustomAttribute
source: Getting custom attributes for type {0} threw exception (will ignore and use the reflection way): {1}
pt_br: A obtenção de atributos personalizados para o tipo {0} gerou uma exceção (irá ignorar e usar o modo de reflexão): {1}
zh_hant: 取得類型 {0} 擲回例外狀況的自訂屬性 (將會略過並使用反映方式): {1}
