Repository: microsoft/testfx
Catalog: src/Adapter/MSTestAdapter.PlatformServices/Resources/xlf/Resource.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hant

# GenericParameterCantBeInferred
source: The type of the generic parameter '{0}' could not be inferred.
pt_br: O tipo do parâmetro genérico "{0}" não pôde ser inferido.
zh_hant: 無法推斷泛型參數 '{0}' 的類型。

# GenericParameterCantBeInferredBecauseNoArguments
source: The generic test method '{0}' doesn't have arguments, so the generic parameter cannot be inferred.
pt_br: O método de teste genérico "{0}" não tem argumentos; portanto, o parâmetro genérico não pode ser inferido.
zh_hant: 泛型測試方法 '{0}' 沒有引數，因此無法推斷泛型參數。

# GenericParameterConflict
source: Found two conflicting types for generic parameter '{0}'. The conflicting types are '{1}' and '{2}'.
pt_br: Foram encontrados dois tipos conflitantes para o parâmetro genérico "{0}". Os tipos conflitantes são "{1}" e "{2}".
zh_hant: 發現泛型參數 '{0}' 有兩個衝突類型。衝突類型為 '{1}' 和 '{2}'。

# InvalidClassCleanupLifecycleValue
source: Invalid value '{0}' specified for 'ClassCleanupLifecycle'. Supported scopes are {1}.
pt_br: Valor inválido '{0}' especificado para 'ClassCleanupLifecycle'. Os escopos suportados são {1}.
zh_hant: 為 'ClassCleanupLifecycle' 指定的值 '{0}' 無效。支援的範圍為 {1}。

# InvalidParallelScopeValue
source: Invalid value '{0}' specified for 'Scope'. Supported scopes are {1}.
pt_br: Valor inválido '{0}' especificado para 'Scope'. Os escopos compatíveis são {1}.
zh_hant: 為 'Scope' 指定的值 '{0}' 無效。支援的範圍為 {1}。

# InvalidParallelWorkersValue
source: Invalid value '{0}' specified for 'Workers'. The value should be a non-negative integer.
pt_br: Valor inválido '{0}' especificado para 'Workers'. O valor deve ser um inteiro não negativo.
zh_hant: 為 'Workers' 的值 '{0}' 無效。值應為非負整數。

# InvalidSettingsXmlAttribute
source: Invalid settings '{0}'. Unexpected XmlAttribute: '{1}'.
pt_br: Configurações inválidas '{0}'. XmlAttribute inesperado: '{1}'.
zh_hant: 設定 '{0}' 無效。未預期的 XmlAttribute: '{1}'。

# InvalidSettingsXmlElement
source: MSTestAdapter encountered an unexpected element '{0}' in its settings '{1}'. Remove this element and try again.
cs: Nástroj MSTestAdapter zjistil neočekávaný prvek {0} v nastavení {1}. Odeberte tento prvek a zkuste to znovu.
de: "MSTestAdapter" hat ein unerwartetes Element "{0}" in den Einstellungen "{1}" ermittelt. Entfernen Sie dieses Element, und versuchen Sie es erneut.
es: MSTestAdapter encontró un elemento inesperado '{0}' en su configuración '{1}'. Quite este elemento e inténtelo de nuevo.
fr: MSTestAdapter a rencontré un élément inattendu '{0}' dans ses paramètres '{1}'. Supprimez cet élément, puis réessayez.
it: MSTestAdapter ha rilevato un elemento imprevisto '{0}' nelle impostazioni '{1}'. Rimuovere l'elemento e riprovare.
ja: MSTestAdapter で設定 '{1}' に予期しない要素 '{0}' が見つかりました。この要素を削除して、もう一度お試しください。
ko: MSTestAdapter의 '{1}' 설정에서 예기치 않은 요소 '{0}'이(가) 발견되었습니다. 이 요소를 제거하고 다시 시도하세요.
pl: Adapter MSTestAdapter napotkał nieoczekiwany element „{0}” w ustawieniach „{1}”. Usuń ten element i spróbuj ponownie.
pt_br: MSTestAdapter encontrou um elemento inesperado '{0}' em suas configurações '{1}'. Remova este elemento e tente novamente.
ru: MSTestAdapter обнаружил непредвиденный элемент "{0}" в параметрах "{1}". Удалите этот элемент и повторите попытку.
tr: MSTestAdapter, '{1}' ayarlarında beklenmedik bir öğeyle ('{0}') karşılaştı. Bu öğeyi kaldırıp yeniden deneyin.
zh_hant: MSTestAdapter 在其設定 '{1}' 中遇到未預期的項目 '{0}'。請移除此項目，然後再試一次。

# InvalidSettingsXmlElement1
source: Invalid settings '{0}'. Unexpected XmlElement: '{1}'.
pt_br: Configurações inválidas '{0}'. XmlElement inesperado: '{1}'.
zh_hant: 設定 '{0}' 無效。未預期的 XmlElement: '{1}'。

# InvalidValue
source: Invalid value '{0}' for runsettings entry '{1}', setting will be ignored.
pt_br: Valor inválido "{0}" para a entrada runsettings "{1}", a configuração será ignorada.
zh_hant: runsettings 項目 '{1}' 的值 '{0}' 無效，將忽略設定。

# InvalidValue1
source: Invalid value '{0}' for runsettings entry '{1}', setting will be ignored.
pt_br: Valor inválido "{0}" para a entrada runsettings "{1}", a configuração será ignorada.
zh_hant: runsettings 項目 '{1}' 的值 '{0}' 無效，將忽略設定。

# LegacyScenariosNotSupportedWarning
source: Warning : A testsettings file or a vsmdi file is not supported with the MSTest V2 Adapter.
pt_br: Aviso: um arquivo testsettings ou um arquivo vsmdi não tem suporte no MSTest V2 Adapter.
zh_hant: 警告: MSTest V2 配接器不支援 testsettings 檔案 vsmdi 檔案。

# MissingDeploymentDependency
source: Test Run deployment issue: The assembly or module '{0}' was not found. Reason: {1}
cs: Problém nasazení testovacího běhu: Sestavení nebo modul {0} se nenašly. Důvod: {1}
de: Problem bei der Testlaufbereitstellung: Die Assembly oder das Modul "{0}" wurde nicht gefunden. Ursache: {1}
es: Problema de implementación en la serie de pruebas: no se encontró el ensamblado o el módulo '{0}'. Motivo: {1}
fr: Problème de déploiement de la série de tests : l'assembly ou le module '{0}' est introuvable. Raison : {1}
it: Problema di distribuzione dell'esecuzione dei test: l'assembly o il modulo '{0}' non è stato trovato. Motivo: {1}
ja: テストの実行の配置問題です: アセンブリまたはモジュール '{0}' が見つかりませんでした。理由: {1}
ko: 테스트 실행 배포 문제: 어셈블리 또는 모듈 '{0}'을(를) 찾을 수 없습니다. 이유: {1}
pl: Problem wdrażania przebiegu testu: nie znaleziono zestawu lub modułu „{0}”. Przyczyna: {1}
pt_br: Problema de implantação de Execução de Teste: o assembly ou módulo '{0}' não foi encontrado. Motivo: {1}
ru: Ошибка развертывания тестового запуска: не удалось найти сборку или модуль "{0}". Причина: {1}
tr: Test Çalıştırması dağıtım sorunu: '{0}' adlı bütünleştirilmiş kod veya modül bulunamadı. Nedeni: {1}
zh_hant: 測試回合部署問題: 找不到組件或模組 '{0}'。原因: {1}

# MissingDeploymentDependencyWithoutReason
source: Test Run deployment issue: The assembly or module '{0}' was not found.
cs: Problém nasazení testovacího běhu: Sestavení nebo modul {0} se nenašly.
de: Problem bei der Testlaufbereitstellung: Die Assembly oder das Modul "{0}" wurde nicht gefunden.
es: Problema de implementación en la serie de pruebas: no se encontró el ensamblado o el módulo '{0}'.
fr: Problème de déploiement de la série de tests : l'assembly ou le module '{0}' est introuvable.
it: Problema di distribuzione dell'esecuzione dei test: l'assembly o il modulo '{0}' non è stato trovato.
ja: テストの実行の配置問題です: アセンブリまたはモジュール '{0}' が見つかりませんでした。
ko: 테스트 실행 배포 문제: 어셈블리 또는 모듈 '{0}'을(를) 찾을 수 없습니다.
pl: Problem wdrażania przebiegu testu: nie znaleziono zestawu lub modułu „{0}”.
pt_br: Problema de implantação de Execução de Teste: o assembly ou módulo '{0}' não foi encontrado.
ru: Ошибка развертывания тестового запуска: не удалось найти сборку или модуль "{0}".
tr: Test Çalıştırması dağıtım sorunu: '{0}' adlı bütünleştirilmiş kod veya modül bulunamadı.
zh_hant: 測試回合部署問題: 找不到組件或模組 '{0}'。

# OlderTFMVersionFound
source: An older version of MSTestV2 package is loaded in assembly, test discovery might fail to discover all data tests if they depend on `.runsettings` file.
pt_br: Uma versão mais antiga do pacote MSTestV2 é carregada no assembly, a descoberta de teste pode falhar ao descobrir todos os testes de dados se eles dependerem do arquivo `.runsettings`.
zh_hant: 元件中已載入舊版的 MSTestV2 套件，如果測試探索相依於 '.runsettings' 檔案，則測試探索可能無法探索所有資料測試。

# STAIsOnlySupportedOnWindowsWarning
source: Runsettings entry '<ExecutionApartmentState>STA</ExecutionApartmentState>' is not supported on non-Windows OSes.
pt_br: Não há suporte para a entrada runsettings "<ExecutionApartmentState>STA</ExecutionApartmentState>" em sistemas operacionais que não sejam Windows.
zh_hant: 非 Windows OS 不支援 Runsettings 項目 '<ExecutionApartmentState>STA</ExecutionApartmentState>'。

# SourcesNotSupported
source: Running tests in any of the provided sources is not supported for the selected platform
pt_br: Não há suporte para execução de teste em qualquer uma das origens fontes fornecidas para a plataforma selecionada
zh_hant: 所選取的平台不支援在任何提供的來源中執行測試

# TestAssembly_AssemblyDiscoveryFailure
source: Failed to discover tests from assembly {0}. Reason:{1}
pt_br: Falha ao descobrir testes por meio do assembly {0}. Motivo: {1}
zh_hant: 無法從組件 {0} 中探索測試。原因:{1}

# TestAssembly_FileDoesNotExist
source: File does not exist: {0}
pt_br: O arquivo não existe: {0}
zh_hant: 檔案不存在: {0}

# TestCleanupTimedOut
source: Test cleanup method '{0}.{1}' timed out after {2}ms
pt_br: O método de limpeza do teste '{0}.{1}' atingiu o tempo limite após {2}ms
zh_hant: 測試清理方法 '{0}.{1}' 在 {2} 毫秒後已逾時

# TestCleanupWasCancelled
source: Test cleanup method '{0}.{1}' was canceled
pt_br: O método de limpeza de teste "{0}.{1}" foi cancelado
zh_hant: 已取消測試清理方法 '{0}.{1}'

# TestContextIsNull
source: TestContext cannot be Null.
pt_br: TestContext não pode ser Nulo.
zh_hant: TestContext 不可為 Null。

# TestContextMessageBanner
source: TestContext Messages:
pt_br: Mensagens TestContext:
zh_hant: TestContext 訊息:

# TestInitializeTimedOut
source: Test initialize method '{0}.{1}' timed out after {2}ms
pt_br: O método de inicialização do teste '{0}.{1}' atingiu o tempo limite após {2}ms
zh_hant: 測試初始化方法 '{0}.{1}' 在 {2} 毫秒後已逾時

# TestInitializeWasCancelled
source: Test initialize method '{0}.{1}' was canceled
pt_br: O método de inicialização de teste "{0}.{1}" foi cancelado
zh_hant: 已取消測試初始化方法 '{0}.{1}'

# TestNotFound
source: Test method {0} was not found.
pt_br: O método de teste {0} não foi encontrado.
zh_hant: 找不到測試方法 {0}。

# TypeLoadFailed
source: Unable to load types from the test source '{0}'. Some or all of the tests in this source may not be discovered. Error: {1}
pt_br: Não é possível carregar tipos da fonte de teste '{0}'. Alguns ou todos os testes nessa fonte podem não ser descobertos. Erro: {1}
zh_hant: 無法從測試來源 '{0}' 載入類型。有可能無法探索此來源中的部分或所有測試。 錯誤: {1}

# UTA_AssemblyCleanupMethodWasUnsuccesful
source: Assembly Cleanup method {0}.{1} failed. Error Message: {2}. StackTrace: {3}
pt_br: Falha no método de Limpeza de Assembly {0}.{1}. Mensagem de Erro: {2}. StackTrace: {3}
zh_hant: 組件清除方法 {0}.{1} 失敗。錯誤訊息: {2}。堆疊追蹤: {3}

# UTA_AssemblyInitMethodThrows
source: Assembly Initialization method {0}.{1} threw exception. {2}: {3}. Aborting test execution.
pt_br: O método de Inicialização de Assembly {0}.{1} lançou uma exceção. {2}: {3}. Anulando execução de teste.
zh_hant: 組件初始設定方法 {0}.{1} 擲回例外狀況。{2}: {3}。正在中止測試執行。

# UTA_ClassCleanupMethodWasUnsuccesful
source: Class Cleanup method {0}.{1} failed. Error Message: {2}. Stack Trace: {3}
pt_br: Falha no método de Limpeza de Classe {0}.{1}. Mensagem de Erro: {2}. Rastreamento de Pilha: {3}
zh_hant: 類別清除方法 {0}.{1} 失敗。錯誤訊息: {2}。堆疊追蹤: {3}

# UTA_ClassInitMethodThrows
source: Class Initialization method {0}.{1} threw exception. {2}: {3}.
pt_br: O método de Inicialização de Classe {0}.{1} lançou uma exceção. {2}: {3}.
zh_hant: 類別初始設定方法 {0}.{1} 擲回例外狀況。{2}: {3}。

# UTA_ClassOrAssemblyCleanupMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be static, public, does not return a value and should not take any parameter. Additionally, if you are using async-await in method then return-type must be 'Task' or 'ValueTask'.
pt_br: O método {0}.{1} tem a assinatura incorreta. O método deve ser estático, público, não deve retornar um valor nem receber parâmetro. Além disso, se você estiver usando async-await no método, o return-type deverá ser "Task" ou "ValueTask".
zh_hant: 方法 {0}.{1} 有錯誤的簽章。方法必須為靜態、公用、不傳回值，並且不應該接受任何參數。此外，如果您在方法中使用 async-await，則傳回類型必須是 'Task' 或 'ValueTask'。

# UTA_ClassOrAssemblyInitializeMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be static, public, does not return a value and should take a single parameter of type TestContext. Additionally, if you are using async-await in method then return-type must be 'Task' or 'ValueTask'.
pt_br: O método {0}.{1} tem a assinatura incorreta. O método deve ser estático, público, não retornar um valor e deve usar um único parâmetro do tipo TestContext. Além disso, se você estiver usando async-await no método, o return-type deverá ser "Task" ou "ValueTask".
zh_hant: 方法 {0}.{1} 有錯誤的簽章。方法必須為靜態、公用、不傳回值，並且應接受類型為 TestContext 的單一參數。此外，如果您在方法中使用 async-await，則傳回類型必須是 'Task' 或 'ValueTask'。

# UTA_CleanupMethodThrows
source: TestCleanup method {0}.{1} threw exception. {2}.
pt_br: O método TestCleanup {0}.{1} gerou a exceção. {2}.
zh_hant: TestCleanup 方法 {0}.{1} 擲回例外狀況。{2}。

# UTA_CleanupMethodThrowsGeneralError
source: Error calling Test Cleanup method for test class {0}: {1}
pt_br: Erro ao chamar o método Test Cleanup para a classe de teste {0}: {1}
zh_hant: 呼叫測試類別 {0} 的測試清除方法時發生錯誤: {1}

# UTA_CleanupStackTrace
source: TestCleanup Stack Trace
pt_br: Rastreamento de pilha TestCleanup
zh_hant: TestCleanup 堆疊追蹤

# UTA_DataSourceConfigurationSectionMissing
source: Data source '{0}' cannot be found in the test configuration settings
cs: Zdroj dat {0} se v nastavení konfigurace testu nenašel.
de: Die Datenquelle "{0}" wurde in den Testkonfigurationseinstellungen nicht gefunden.
es: No se encuentra el origen de datos '{0}' en los valores de configuración de prueba
fr: Source de données '{0}' introuvable dans les paramètres de configuration de test
it: L'origine dati '{0}' non è stata trovata nelle impostazioni della configurazione di test
ja: データ ソース '{0}' がテスト構成の設定に見つかりません
ko: 테스트 구성 설정에서 데이터 원본 '{0}'을(를) 찾을 수 없습니다.
pl: W ustawieniach konfiguracji testu nie można znaleźć źródła danych „{0}”
pt_br: A fonte de dados '{0}' não pode ser encontrada nas configurações de teste
ru: Не удалось найти источник данных "{0}" в параметрах конфигурации теста
tr: Test yapılandırması ayarlarında '{0}' adlı veri kaynağı bulunamıyor
zh_hant: 在測試組態設定中找不到資料來源 '{0}'

# UTA_EndOfInnerExceptionTrace
source: --- End of inner exception stack trace ---
pt_br: --- Fim do rastreamento de pilha de exceção interna ---
zh_hant: --- 已到達內部例外狀況堆疊追蹤的結尾 ---

# UTA_ErrorDataConnectionFailed
source: The unit test adapter failed to connect to the data source or to read the data. For more information on troubleshooting this error, see "Troubleshooting Data-Driven Unit Tests" (http://go.microsoft.com/fwlink/?LinkId=62412) in the MSDN Library. Error details: {0}
cs: Adaptéru testování částí se buď nepodařilo připojit ke zdroji dat, nebo přečíst data. Další informace o odstraňování této chyby najdete v knihovně MSDN v tématu Troubleshooting Data-Driven Unit Tests (http://go.microsoft.com/fwlink/?LinkId=62412). Podrobnosti o chybě: {0}
de: Der Komponententestadapter konnte keine Verbindung mit der Datenquelle herstellen bzw. die Daten nicht lesen. Weitere Informationen zur Problembehandlung dieses Fehlers finden Sie unter "Problembehandlung von datengesteuerten Komponententests" (http://go.microsoft.com/fwlink/?LinkId=62412) in der MSDN Library. Fehlerdetails: {0}
es: El adaptador de pruebas unitarias no puede conectarse al origen de datos o leer los datos. Para obtener más información acerca de cómo solucionar este error, consulte "Solución de problemas de pruebas unitarias orientadas a datos" (http://go.microsoft.com/fwlink/?LinkId=62412) en la biblioteca de MSDN. Detalles del error: {0}
fr: L'adaptateur de test unitaire n'a pas réussi à se connecter à la source de données ou à lire les données. Pour plus d'informations sur le dépannage de l'erreur, consultez "Résolution des problèmes liés aux tests unitaires pilotés par les données" (http://go.microsoft.com/fwlink/?LinkId=62412) dans MSDN Library. Détails de l'erreur : {0}
it: L'adattatore di unit test non è riuscito a connettersi all'origine dati o a leggere i dati. Per altre informazioni sulla risoluzione di questo errore, vedere "Risoluzione dei problemi relativi a unit test basati su dati" (http://go.microsoft.com/fwlink/?LinkId=62412) in MSDN Library. Dettagli errore: {0}
ja: 単体テスト アダプターがデータ ソースに接続できなかったか、データを読み取れませんでした。このエラーのトラブルシューティングの詳細については、MSDN ライブラリの「方法: データ ドリブン単体テストを作成する」(http://go.microsoft.com/fwlink/?LinkId=62412) をご覧ください。エラーの詳細: {0}
ko: 단위 테스트 어댑터가 데이터 원본에 연결하거나 데이터를 읽지 못했습니다. 이 오류를 해결하는 방법에 대한 자세한 내용은 MSDN 라이브러리에서 "데이터 기반 단위 테스트 문제 해결"(http://go.microsoft.com/fwlink/?LinkId=62412)을 참조하십시오. 오류 세부 정보: {0}
pl: Adapter testu jednostkowego nie mógł połączyć się ze źródłem danych lub odczytać danych. Aby uzyskać więcej informacji o rozwiązywaniu tego błędu, zobacz „Rozwiązywanie problemów z testami jednostkowymi sterowanymi danymi” (http://go.microsoft.com/fwlink/?LinkId=62412) w bibliotece MSDN. Szczegóły błędu: {0}
pt_br: O adaptador de teste de unidade falhou ao conectar-se à fonte de dados ou ao ler os dados. Para obter mais informações sobre como solucionar esse erro, consulte "Solucionando Problemas em Testes de Unidade Controlados por Dados" (http://go.microsoft.com/fwlink/?LinkId=62412) na Biblioteca do MSDN. Detalhes do erro: {0}
ru: Адаптеру модульных тестов не удалось подключиться к источнику данных, чтобы считать данные. Дополнительные сведения об устранении этой ошибки см. в разделе "Устранение неполадок в модульных тестах на основе данных" (http://go.microsoft.com/fwlink/?LinkId=62412) в библиотеке MSDN. Подробности об ошибке: {0}
tr: Birim test bağdaştırıcısı, veri kaynağına bağlanamadı veya verileri okuyamadı. Bu hata ile ilgili daha fazla sorun giderme bilgisi için MSDN Kitaplığı'ndaki "Veri Temelli Birim Testleriyle İlgili Sorunları Giderme" (http://go.microsoft.com/fwlink/?LinkId=62412) konusuna bakın. Hata ayrıntıları: {0}
zh_hant: 單元測試配接器無法連接至資料來源或無法讀取資料。如需為此錯誤進行疑難排解的詳細資訊，請參閱 MSDN Library 上的＜如何: 建立資料驅動型單元測試＞(http://go.microsoft.com/fwlink/?LinkId=62412)。錯誤詳細資料: {0}

# UTA_ErrorInValidTestContextSignature
source: UTA031: class {0} does not have valid TestContext property. TestContext must be of type TestContext, must be non-static, and must be public. For example: public TestContext TestContext.
pt_br: UTA031: a classe {0} não tem uma propriedade TestContext válida. TestContext deve ser do tipo TestContext, não deve ser estático e deve ser público. Por exemplo: public TestContext TestContext.
zh_hant: UTA031: 類別 {0}不具備有效的 TestContext 屬性。TestContext 必須是 TestContext 類型、必須是非靜態的，而且必須是公用的。例如: public TestContext TestContext。

# UTA_ErrorIncorrectTestMethodSignature
source: UTA007: Method {1} defined in class {0} does not have correct signature. Test method marked with the [TestMethod] attribute must be non-static, public, return-type as void and should not take any parameter. Example: public void Test.Class1.Test(). Additionally, if you are using async-await in test method then return-type must be 'Task' or 'ValueTask'. Example: public async Task Test.Class1.Test2()
pt_br: UTA007: o método {1} definido na classe {0} não tem a assinatura correta. O método de teste marcado com o atributo [TestMethod] deve ser não estático, público, com tipo de retorno nulo e não deve receber parâmetros. Exemplo: Test.Class1.Test() público nulo. Além disso, se você estiver usando async-await no método de teste, return-type deverá ser "Task" ou "ValueTask". Exemplo: public async Task Test.Class1.Test2()
zh_hant: UTA007: 類別 {0} 中定義的方法 {1} 沒有正確的簽章。標記 [TestMethod] 屬性的測試方法必須為非靜態、公用、傳回類型為 void，而且不應該接受任何參數。範例: public void Test.Class1.Test()。此外，如果您在測試方法中使用 async-await，則傳回類型必須是 'Task' 或 'ValueTask'。範例: public async Task Test.Class1.Test2()

# UTA_ErrorInvalidTimeout
source: UTA054: {0}.{1} has invalid Timeout attribute. The timeout must be an integer value greater than 0.
pt_br: UTA054: {0}.{1} tem atributo Timeout inválido. O tempo limite deve ser um valor inteiro maior que 0.
zh_hant: UTA054: {0}。{1} 中具有無效的 Timeout 屬性。逾時必須為大於 0 的整數值。

# UTA_ErrorMultiAssemblyClean
source: UTA014: {0}: Cannot define more than one method with the AssemblyCleanup attribute inside an assembly.
pt_br: UTA014: {0}: não é possível definir mais de um método com o atributo AssemblyCleanup em um assembly.
zh_hant: UTA014: {0}: 組件內不可定義一個以上具有 AssemblyCleanup 屬性的方法。

# UTA_ErrorMultiAssemblyInit
source: UTA013: {0}: Cannot define more than one method with the AssemblyInitialize attribute inside an assembly.
pt_br: UTA013: {0}: não é possível definir mais de um método com o atributo AssemblyInitialize dentro de um assembly.
zh_hant: UTA013: {0}: 組件內不可定義一個以上具有 AssemblyInitialize 屬性的方法。

# UTA_ErrorMultiClassClean
source: UTA026: {0}: Cannot define more than one method with the ClassCleanup attribute inside a class.
pt_br: UTA026: {0}: não é possível definir mais de um método com o atributo ClassCleanup dentro de uma classe.
zh_hant: UTA026: {0}: 類別內不可定義一個以上具有 ClassCleanup 屬性的方法。

# UTA_ErrorMultiClassInit
source: UTA025: {0}: Cannot define more than one method with the ClassInitialize attribute inside a class.
pt_br: UTA025: {0}: não é possível definir mais de um método com o atributo ClassInitialize em uma classe.
zh_hant: UTA025: {0}: 類別內不可定義一個以上具有 ClassInitialize 屬性的方法。

# UTA_ErrorMultiClean
source: UTA024: {0}: Cannot define more than one method with the TestCleanup attribute.
pt_br: UTA024: {0}: não é possível definir mais de um método com o atributo TestCleanup.
zh_hant: UTA024: {0}: 不可定義一個以上具有 TestCleanup 屬性的方法。

# UTA_ErrorMultiInit
source: UTA018: {0}: Cannot define more than one method with the TestInitialize attribute.
pt_br: UTA018: {0}: não é possível definir mais de um método com o atributo TestInitialize.
zh_hant: UTA018: {0}: 不可定義一個以上具有 TestInitialize 屬性的方法。

# UTA_ErrorNonPublicTestClass
source: UTA001: TestClass attribute defined on non-public class {0}
pt_br: UTA001: atributo TestClass definido em classe não pública {0}
zh_hant: UTA001: 在非公用類別 {0} 上定義了 TestClass 屬性

# UTA_ErrorPredefinedTestProperty
source: UTA023: {0}: Cannot define predefined property {2} on method {1}.
pt_br: UTA023: {0}: não é possível definir a propriedade predefinida {2} no método {1}.
zh_hant: UTA023: {0}: 不可在方法 {1} 上定義預先定義的屬性 {2}。

# UTA_ErrorTestClassIsGenericNonAbstract
source: TestClass attribute defined on generic non-abstract class {0}
pt_br: Atributo TestClass definido em uma classe genérica não abstrata {0}
zh_hant: 在一般非抽象類別上定義的 TestClass 屬性 {0}

# UTA_ErrorTestPropertyNullOrEmpty
source: UTA021: {0}: Null or empty custom property defined on method {1}. The custom property must have a valid name.
pt_br: UTA021: {0}: Propriedade personalizada nula ou vazia definida no método {1}. A propriedade personalizada deve ter um nome válido.
zh_hant: UTA021: {0}: 在方法 {1} 上定義了 Null 或空白的自訂屬性。自訂屬性的名稱必須有效。

# UTA_ExecuteThrewException
source: An unhandled exception was thrown by the 'Execute' method. Please report this error to the author of the attribute '{0}'. {1}
pt_br: Uma exceção sem tratamento foi lançada pelo método "Execute". Relate esse erro ao autor do atributo "{0}". {1}
zh_hant: 'Execute' 方法擲回未處理的例外狀況。請將此錯誤回報給屬性 '{0}' 的作者。 {1}

# UTA_ExpectedExceptionAttributeConstructionException
source: The ExpectedException attribute defined on test method {0}.{1} threw an exception during construction. {2}
pt_br: O atributo ExpectedException definido no método de teste {0}.{1} emitiu uma exceção durante a construção. {2}
zh_hant: 測試方法 {0} 上定義的 ExpectedException 屬性。{1} 在建構期間擲回例外狀況。 {2}

# UTA_FailedToGetTestMethodException
source: Failed to obtain the exception thrown by test method {0}.{1}.
pt_br: Falha ao obter a exceção lançada pelo método de teste {0}.{1}.
zh_hant: 無法取得測試方法 {0}.{1} 所擲回的例外狀況。

# UTA_InitMethodThrows
source: Initialization method {0}.{1} threw exception. {2}.
pt_br: O método de inicialização {0}.{1} gerou exceção. {2}.
zh_hant: 初始設定方法 {0}.{1} 擲回例外狀況。{2}。

# UTA_InstanceCreationError
source: Unable to create instance of class {0}. Error: {1}.
pt_br: Não é possível criar instância da classe {0}. Erro: {1}.
zh_hant: 無法建立類別 {0} 的執行個體。錯誤: {1}。

# UTA_MethodDoesNotExists
source: Method {0}.{1} does not exist.
pt_br: O método {0}.{1} não existe.
zh_hant: 方法 {0}.{1} 不存在。
