Repository: microsoft/testfx
Catalog: src/Adapter/MSTestAdapter.PlatformServices/Resources/xlf/Resource.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hant

# UTA_MultipleAttributesOnTestMethod
source: The test method '{0}.{1}' has multiple attributes derived from '{2}' defined on it. Only one such attribute is allowed.
pt_br: O método de teste '{0}.{1}' tem várias características derivadas de '{2}' definidas nele. Apenas uma dessas características tem permissão.
zh_hant: 測試方法 '{0}.{1}' 具有多個衍生自 '{2}' 的屬性根據其定義。只允許一個此類屬性。

# UTA_NoTestResult
source: Error in executing test. No result returned by extension. If using extension of TestMethodAttribute then please contact vendor.
pt_br: Erro ao executar o teste. Nenhum resultado retornado pela extensão. Se usar a extensão de TestMethodAttribute, entre em contato com o fornecedor.
zh_hant: 執行測試時發生錯誤。擴充功能未傳回任何結果。如果您使用 TestMethodAttribute 的擴充功能，請連絡廠商。

# UTA_NoValidConstructor
source: Cannot find a valid constructor for test class '{0}'. Valid constructors are 'public' and either parameterless or with one parameter of type 'TestContext'.
pt_br: Não é possível localizar um construtor válido para a classe de teste '{0}'. Construtores válidos são 'public' e sem parâmetros ou com um parâmetro do tipo 'TestContext'.
zh_hant: 找不到測試類別 '{0}' 的有效建構函式。有效的建構函式為 'public' 且無參數或具有一個類型為 'TestContext' 的參數。

# UTA_TestContextLoadError
source: Unable to find property {0}.TestContext. Error:{1}.
pt_br: Não é possível encontrar propriedade {0}.TestContext. Erro:{1}.
zh_hant: 找不到屬性 {0}.TestContext。錯誤: {1}。

# UTA_TestContextSetError
source: Unable to set TestContext property for the class {0}. Error: {1}.
pt_br: Não é definir a propriedade TestContext para a classe {0}. Erro: {1}.
zh_hant: 無法設定類別 {0} 的 TestContext 屬性。錯誤: {1}。

# UTA_TestContextTypeMismatchLoadError
source: The {0}.TestContext has incorrect type.
pt_br: O {0}.TestContext é do tipo incorreto.
zh_hant: {0}.TestContext 有不正確的類型。

# UTA_TestInitializeAndCleanupMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be non-static, public, does not return a value and should not take any parameter. Additionally, if you are using async-await in method then return-type must be 'Task' or 'ValueTask'.
pt_br: O método {0}.{1} tem a assinatura incorreta. O método deve ser não estático, público, não deve retornar um valor e não deve receber nenhum parâmetro. Além disso, se você estiver usando async-await no método, o return-type deverá ser "Task" ou "ValueTask".
zh_hant: 方法 {0}.{1} 有錯誤的簽章。方法必須為非靜態、公用、不傳回值，並且不應該接受任何參數。此外，如果您在方法中使用 async-await，則傳回類型必須是 'Task' 或 'ValueTask'。

# UTA_TestMethodThrows
source: Test method {0}.{1} threw exception: {2}
pt_br: O método de teste {0}.{1} lançou a exceção: {2}

# UTA_TypeLoadError
source: Unable to get type {0}. Error: {1}.
pt_br: Não é possível obter o tipo {0}. Erro: {1}.
zh_hant: 無法取得類型 {0}。錯誤: {1}。

# UTA_UserCodeThrewNullValueException
source: The called code threw an exception that was caught, but the exception value was null
pt_br: O código chamado lançou uma exceção que foi capturada, mas o valor da exceção era nulo
zh_hant: 被呼叫的程式碼擲回攔截到的例外狀況，但例外狀況值為 Null

# UTA_WrongThread
source: {0} For UWP projects, if you are using UI objects in test consider using [UITestMethod] attribute instead of [TestMethod] to execute test in UI thread.
pt_br: {0} Para projetos UWP, se você está usando objetos de IU no teste, considere usar o atributo [UITestMethod] em vez de [TestMethod] para executar o teste no thread da IU.
zh_hant: {0} 針對 UWP 專案，如果您在測試中使用 UI 物件，請考慮使用 [UITestMethod] 屬性取代 [TestMethod] 在 UI 執行緒中執行測試。

# UTF_FailedToGetExceptionMessage
source: (Failed to get the message for an exception of type {0} due to an exception.)
pt_br: (Falha ao obter a mensagem para uma exceção do tipo {0} devido a uma exceção.)
zh_hant: (因為發生例外狀況，所以無法取得類型 {0} 之例外狀況的訊息。)

# VersionMismatchBetweenAdapterAndFramework
source: 'MSTest.TestAdapter' and 'MSTest.TestFramework' must have the same version. Found 'MSTest.TestAdapter' version '{0}' and 'MSTest.TestFramework' version '{1}'. Please make sure that the versions of 'MSTest.TestAdapter' and 'MSTest.TestFramework' NuGet packages have the same version.
pt_br: 'MSTest.TestAdapter' e 'MSTest.TestFramework' devem ter a mesma versão. Encontrada a versão '{0}' do 'MSTest.TestAdapter' e a versão '{1}' do 'MSTest.TestFramework'. Por favor, verifique se as versões dos pacotes NuGet 'MSTest.TestAdapter' e 'MSTest.TestFramework' são iguais.
zh_hant: 'MSTest.TestAdapter' 和 'MSTest.TestFramework' 必須使用相同的版本。發現 'MSTest.TestAdapter' 的版本為 '{0}'，而 'MSTest.TestFramework' 的版本為 '{1}'。請確保 'MSTest.TestAdapter' 和 'MSTest.TestFramework' 的 NuGet 套件版本一致。

# WrongNumberOfObjects
source: Wrong number of objects for permutation. Should be greater than zero.
cs: Chybný počet objektů pro permutaci. Počet musí být větší než nula.
de: Falsche Anzahl von Objekten für die Permutation. Die Anzahl muss größer als NULL sein.
es: Número incorrecto de objetos para permutación. Debe ser una cantidad mayor que cero.
fr: Nombre d'objets erroné pour la permutation. Il doit être supérieur à zéro.
it: Il numero di oggetti non è corretto per la permutazione. Deve essere maggiore di zero.
ja: 順列のオブジェクト数が正しくありません。ゼロより大きくなければなりません。
ko: 순열의 개체 수가 잘못되었습니다. 개체 수는 0보다 커야 합니다.
pl: Nieprawidłowa liczba obiektów permutacji. Ta liczba powinna być większa od zera.
pt_br: Número incorreto de objetos para permutação. Deve ser maior que zero.
ru: Неправильное число объектов для перестановки. Оно должно быть больше нуля.
tr: Permütasyon için nesne sayısı yanlış. Değer, sıfırdan büyük olmalıdır.
zh_hant: 排列的物件數目錯誤。應大於零。

# TestParallelizationBanner
source: Test Parallelization enabled for {0} (Workers: {1}, Scope: {2})
zh_hant: 已為 {0} 啟用平行測試 (Workers: {1}, Scope: {2})

# AssemblyResolutionIsOnlyWorkingWithNetFramework
source: The runsettings 'AssemblyResolution' entries are only supported in .NET Framework. If your tests are working consider removing this entry otherwise you will need to make sure all dependent assemblies are found in the ouput directory of your test.
cs: Položky runsettings AssemblyResolution jsou podporovány pouze v .NET Framework. Pokud vám testy fungují, zvažte odebrání této položky, jinak budete muset zajistit, aby se všechna závislá sestavení nacházela ve výstupním adresáři vašeho testu.
it: Le voci 'AssemblyResolution' di runsettings sono supportate solo in .NET Framework. Se i test funzionano, provare a rimuovere questa voce, altrimenti sarà necessario assicurarsi che tutti gli assembly dipendenti siano presenti nella directory di output del test.
