Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TelemetryNotice
source: Telemetry --------- Microsoft Testing Platform collects usage data in order to help us improve your experience. The data is collected by Microsoft and are not shared with anyone. You can opt-out of telemetry by setting the TESTINGPLATFORM_TELEMETRY_OPTOUT or DOTNET_CLI_TELEMETRY_OPTOUT environment variable to '1' or 'true' using your favorite shell. Read more about Microsoft Testing Platform telemetry: https://aka.ms/testingplatform/telemetry
cs: Telemetrie --------- Microsoft Testing Platform shromažďuje data o využití, která nám pomáhají dále vylepšovat prostředí a práci s produktem. Data shromažďuje společnost Microsoft a s nikým je nesdílí. Výslovný nesouhlas s telemetrií můžete vyjádřit tak, že pomocí svého oblíbeného prostředí nastavíte proměnnou prostředí TESTINGPLATFORM_TELEMETRY_OPTOUT nebo DOTNET_CLI_TELEMETRY_OPTOUT na hodnotu 1 nebo true. Přečtěte si další informace o telemetrii Microsoft Testing Platform: https://aka.ms/testingplatform/telemetry
de: Telemetrie --------- Die Microsoft Testing Platform erfasst Nutzungsdaten, damit wir die Plattform stetig verbessern können. Die Daten werden von Microsoft gesammelt und nicht mit anderen geteilt. Sie können das Erfassen von Telemetriedaten deaktivieren, indem Sie die Umgebungsvariable TESTINGPLATFORM_TELEMETRY_OPTOUT or DOTNET_CLI_TELEMETRY_OPTOUT in Ihrer bevorzugten Shell auf „1“ oder TRUE festlegen. Weitere Informationen zu Microsoft Testing Platform-Telemetriedaten: https://aka.ms/testingplatform/telemetry
es: Telemetría --------- La Plataforma de pruebas de Microsoft recopila datos de uso para ayudarnos a mejorar su experiencia. Microsoft recopila datos y no se comparten con nadie. Puede optar por no participar en la telemetría si establece la variable de entorno TESTINGPLATFORM_TELEMETRY_OPTOUT o DOTNET_CLI_TELEMETRY_OPTOUT como "1" o "true" mediante su shell preferido. Más información sobre la telemetría de la Plataforma de pruebas de Microsoft: https://aka.ms/testingplatform/telemetry
fr: Télémétrie --------- La plateforme de tests Microsoft collecte des données d’utilisation afin de nous aider à améliorer votre expérience. Les données sont collectées par Microsoft et ne sont partagées avec personne. Vous pouvez refuser la télémétrie en fixant la variable d’environnement TESTINGPLATFORM_TELEMETRY_OPTOUT ou DOTNET_CLI_TELEMETRY_OPTOUT à « 1 » ou « true » à l’aide de votre interpréteur de commandes préféré. En savoir plus sur la télémétrie de la plateforme de tests Microsoft : https://aka.ms/testingplatform/telemetry
it: Telemetria --------- La piattaforma di test Microsoft raccoglie i dati di utilizzo per consentirci di migliorare l'esperienza dell'utente. I dati vengono raccolti da Microsoft e non vengono condivisi con terzi. È possibile rifiutare esplicitamente la telemetria impostando la variabile di ambiente TESTINGPLATFORM_TELEMETRY_OPTOUT o DOTNET_CLI_TELEMETRY_OPTOUT su '1' o 'true' tramite la shell preferita. Altre informazioni sulla telemetria della piattaforma di test Microsoft: https://aka.ms/testingplatform/telemetry
ja: テレメトリ --------- Microsoft Testing Platform は、お客様のエクスペリエンスの向上に役立てるために使用状況データを収集します。データは Microsoft によって収集され、誰とも共有されません。 テレメトリをオプトアウトするには、お気に入りのシェルを使用して、TESTINGPLATFORM_TELEMETRY_OPTOUT または DOTNET_CLI_TELEMETRY_OPTOUT 環境変数を '1' または 'true' に設定します。 Microsoft Testing Platform テレメトリの詳細: https://aka.ms/testingplatform/telemetry
ko: 원격 분석 --------- Microsoft 테스트 플랫폼은 사용자 환경 개선을 위해 사용량 데이터를 수집합니다. 데이터는 Microsoft에서 수집하며 누구와도 공유되지 않습니다. 즐겨 찾는 셸을 사용하여 TESTINGPLATFORM_TELEMETRY_OPTOUT 또는 DOTNET_CLI_TELEMETRY_OPTOUT 환경 변수를 '1' 또는 'true'로 설정하여 원격 분석을 옵트아웃할 수 있습니다. Microsoft 테스트 플랫폼 원격 분석에 대해 자세히 알아보기: https://aka.ms/testingplatform/telemetry
pl: Telemetria --------- Platforma testowania firmy Microsoft zbiera dane dotyczące użycia, aby pomóc nam w ulepszaniu środowiska użytkownika. Dane są zbierane przez firmę Microsoft i nie są nikomu udostępniane. Możesz zrezygnować z telemetrii, ustawiając zmienną środowiskową TESTINGPLATFORM_TELEMETRY_OPTOUT lub DOTNET_CLI_TELEMETRY_OPTOUT na wartość „1” lub „true” przy użyciu ulubionej powłoki. Więcej informacji o telemetrii platformy testowej firmy Microsoft: https://aka.ms/testingplatform/telemetry
pt_br: Telemetria --------- A Plataforma de Testes da Microsoft coleta dados de uso para nos ajudar a melhorar sua experiência. Os dados são coletados pela Microsoft e não são compartilhados com ninguém. Você pode cancelar a telemetria definindo a variável de ambiente TESTINGPLATFORM_TELEMETRY_OPTOUT ou DOTNET_CLI_TELEMETRY_OPTOUT como “1” ou “verdadeiro” usando seu shell favorito. Leia mais sobre a telemetria da Plataforma de Testes da Microsoft: https://aka.ms/testingplatform/telemetry
ru: Телеметрия --------- Платформа тестирования Майкрософт собирает данные об использовании для повышения удобства. Данные собираются корпорацией Майкрософт и никому не предоставляются. Вы можете отключить отправку данных телеметрии, установив значение "1" или "true" для переменной среды TESTINGPLATFORM_TELEMETRY_OPTOUT или DOTNET_CLI_TELEMETRY_OPTOUT в подходящей оболочке. Дополнительные сведения о телеметрии платформы тестирования Майкрософт: https://aka.ms/testingplatform/telemetry
tr: Telemetri --------- Microsoft Test Platformu, deneyiminizi geliştirmemize yardımcı olmak için kullanım verilerini toplar. Veriler Microsoft tarafından toplanır ve hiç kimseyle paylaşılmaz. Sık kullandığınız kabukla TESTINGPLATFORM_TELEMETRY_OPTOUT veya DOTNET_CLI_TELEMETRY_OPTOUT ortam değişkenini '1' veya 'true' olarak ayarlayarak telemetriyi geri çevirebilirsiniz. Microsoft Test Platformu telemetrisi hakkında daha fazla bilgi edinin: https://aka.ms/testingplatform/telemetry
zh_hans: 遥测 --------- Microsoft 测试平台会收集使用数据，帮助我们改善体验。该数据由 Microsoft 收集，不会与任何人共享。 可通过使用喜欢的 shell 将 TESTINGPLATFORM_TELEMETRY_OPTOUT 或 DOTNET_CLI_TELEMETRY_OPTOUT 环境变量设置为 '1' 或 'true' 来选择退出遥测。 阅读有关 Microsoft 测试平台遥测功能的详细信息: https://aka.ms/testingplatform/telemetry
zh_hant: 遙測 --------- Microsoft 測試平台會收集使用量資料，以協助我們改善您的體驗。資料由 Microsoft 收集，且不會與任何人共用。 您可以使用您喜愛的殼層，將 TESTINGPLATFORM_TELEMETRY_OPTOUT 或 DOTNET_CLI_TELEMETRY_OPTOUT 環境變數設定為 '1' 或 'true'，以選擇退出遙測。 閱讀更多關於 Microsoft 測試平台遙測: https://aka.ms/testingplatform/telemetry

# TelemetryProviderAlreadySetErrorMessage
source: Telemetry provider is already set
cs: Zprostředkovatel telemetrie je už nastavený.
de: Der Telemetrieanbieter ist bereits festgelegt
es: El proveedor de telemetría ya está establecido
fr: Le fournisseur de télémétrie est déjà défini
it: Il provider di telemetria è già impostato
ja: テレメトリ プロバイダーは既に設定されています
ko: 원격 분석 공급자가 이미 설정되어 있습니다.
pl: Dostawca telemetrii jest już ustawiony
pt_br: O provedor de telemetria já está definido
ru: Поставщик телеметрии уже настроен
tr: Telemetri sağlayıcısı zaten ayarlanmış
zh_hans: 已设置遥测提供程序
zh_hant: 遙測提供者已設定

# TerminalNoAnsiOptionDescription
source: Disable outputting ANSI escape characters to screen.
cs: Zakažte výstup řídicích znaků ANSI na obrazovku.
de: Deaktivieren Sie die Ausgabe von ANSI-Escape-Zeichen auf dem Bildschirm.
es: Deshabilite la salida de caracteres de escape ANSI en la pantalla.
fr: Désactiver la sortie des caractères d’échappement ANSI à l’écran.
it: Disabilita l'output dei caratteri di escape ANSI sullo schermo.
ja: 画面への ANSI エスケープ文字の出力を無効にします。
ko: ANSI 이스케이프 문자를 화면에 출력하지 않도록 설정합니다.
pl: Wyłącz wyprowadzanie znaków ucieczki ANSI na ekran.
pt_br: Desabilite a saída de caracteres de escape ANSI para a tela.
ru: Отключить вывод escape-символов ANSI на экран.
tr: ANSI kaçış karakterlerinin ekrana çıkışını devre dışı bırakın.
zh_hans: 禁用将 ANSI 转义字符输出到屏幕。
zh_hant: 停用將 ANSI 逸出字元輸出至螢幕。

# TerminalNoProgressOptionDescription
source: Disable reporting progress to screen.
cs: Zakažte zobrazování průběhu vytváření sestav na obrazovce.
de: Deaktivieren Sie die Berichterstellung für den Status des Bildschirms.
es: Deshabilite el progreso de los informes en la pantalla.
fr: Désactiver la progression des rapports à l’écran.
it: Disabilita la segnalazione dello stato sullo schermo.
ja: 画面への進行状況の報告を無効にします。
ko: 화면에 보고 진행률을 사용하지 않도록 설정합니다.
pl: Wyłącz raportowanie postępu na ekranie.
pt_br: Desabilite o progresso do relatório na tela.
ru: Отключить отчеты о ходе выполнения на экране.
tr: Ekrana yansıtılan ilerleme durumu raporlamasını devre dışı bırakın.
zh_hans: 禁用向屏幕报告进度。
zh_hant: 停用向螢幕報告進度。

# TerminalOutputOptionDescription
source: Output verbosity when reporting tests. Valid values are 'Normal', 'Detailed'. Default is 'Normal'.
cs: Podrobnosti výstupu při vytváření sestav testů. Platné hodnoty jsou Normal a Detailed. Výchozí hodnota je Normal.
de: Ausgabeausführlichkeit beim Melden von Tests. Gültige Werte sind „Normal“, „Detailed“. Der Standardwert ist „Normal“.
es: Nivel de detalle de la salida al crear informes de pruebas. Los valores válidos son 'Normal', 'Detallado'. El valor predeterminado es 'Normal'.
fr: Verbosité de la sortie lors de l’établissement des rapports de tests. Les valeurs valides sont « Normal » et « Détaillé ». La valeur par défaut est « Normal ».
it: Livello di dettaglio di output durante la creazione di report di test. I valori validi sono 'Normal', 'Detailed'. L'impostazione predefinita è 'Normal'.
ja: テストを報告する際の出力の詳細。 有効な値は 'Normal'、'Detailed' です。既定値は 'Normal' です。
ko: 테스트를 보고할 때 세부 정보 표시를 출력합니다. 유효한 값은 'Normal', 'Detailed'입니다. 기본값은 'Normal'입니다.
pl: Szczegółowość danych wyjściowych podczas raportowania testów. Prawidłowe wartości to „Normalne”, „Szczegółowe”. Wartość domyślna to „Normalne”.
pt_br: Detalhamento da saída ao relatar testes Os valores válidos são “Normal”, “Detalhado”. O padrão é “Normal”.
ru: Уровень детализации вывода при отправке отчетов о тестах. Допустимые значения: "Normal", "Detailed". Значение по умолчанию: "Normal".
tr: Testleri bildirirken çıkış ayrıntı düzeyi. Geçerli değerler: ‘Normal’, ‘Ayrıntılı’. Varsayılan değer: ‘Normal’.
zh_hans: 报告测试时的输出详细程度。 有效值为 "Normal"、"Detailed"。默认值为 "Normal"。
zh_hant: 報告測試時的輸出詳細程度。 有效值為 'Normal'、'Detailed'。預設為 'Normal'。

# TerminalOutputOptionInvalidArgument
source: --output expects a single parameter with value 'Normal' or 'Detailed'.
cs: --output očekává jeden parametr s hodnotou Normal nebo Detailed.
de: „--output“ erwartet einen einzelnen Parameter mit dem Wert „Normal“ oder „Detailed“.
es: --output espera un único parámetro con el valor "Normal" o "Detallado".
fr: --output attend un seul paramètre avec la valeur « Normal » ou « Détaillé ».
it: --l’output prevede un singolo parametro con un valore 'Normal' o 'Detailed'.
ja: --output には、値が 'Normal' または 'Detailed' の単一のパラメーターが必要です。
ko: --output에는 값이 'Normal' 또는 'Detailed'인 단일 매개 변수가 필요합니다.
pl: Parametr --output oczekuje pojedynczego parametru o wartości „Normalne” lub „Szczegółowe”.
pt_br: --saída espera um único parâmetro com o valor “Normal” ou “Detalhado”.
ru: --output ожидает один параметр со значением "Normal" или "Detailed".
tr: --çıkışta ‘Normal’ veya ‘Ayrıntılı’ değerine sahip tek bir parametre beklenir.
zh_hans: -- 输出应为值为“常规”或“详细”的单个参数。
zh_hant: --輸出需要值為 'Normal' 或 'Detailed' 的單一參數。

# TerminalTestReporterDescription
source: Writes test results to terminal.
cs: Zapíše výsledky testu do terminálu.
de: Schreibt Testergebnisse in das Terminal.
es: Escribe los resultados de pruebas en el terminal.
fr: Écrit les résultats des tests dans le terminal.
it: Scrive i risultati del test nel terminale.
ja: テスト結果をターミナルに書き込みます。
ko: 테스트 결과를 터미널에 씁니다.
pl: Zapisuje wyniki testu w terminalu.
pt_br: Grava resultados de teste no terminal.
ru: Записывает результаты теста в терминал.
tr: Test sonuçlarını terminale yazar.
zh_hans: 将测试结果写入终端。
zh_hant: 將測試結果寫入終端機。

# TerminalTestReporterDisplayName
source: Terminal test reporter
cs: Oznamovatel testu terminálu
es: Informador de pruebas de terminal
fr: Rapporteur de test terminal
it: Reporter test terminale
ja: ターミナル テストの報告者
ko: 터미널 테스트 보고자
pl: Raport testowy terminalu
pt_br: Relator de teste do terminal
ru: Средство отчетности о тесте для терминала
tr: Terminal test raporlayıcısı
zh_hans: 终端测试报告器
zh_hant: 終端機測試報告者

# TestAdapterInvokerFactoryAlreadySetErrorMessage
source: An 'ITestFrameworkInvoker' factory is already set
cs: Objekt pro vytváření ITestFrameworkInvoker je už nastavený.
de: Eine "ITestFrameworkInvoker"-Factory ist bereits festgelegt
es: Ya se ha establecido una fábrica "ITestFrameworkInvoker"
fr: Désolé, une fabrique « ITestFrameworkInvoker » est déjà définie
it: Una factory 'ITestFrameworkInvoker' è già impostata
ja: 'ITestFrameworkInvoker' ファクトリは既に設定されています
ko: 'ITestFrameworkInvoker' 팩터리가 이미 설정됨
pl: Fabryka „ITestFrameworkInvoker” jest już ustawiona
pt_br: Uma fábrica “ITestFrameworkInvoker” já está definida
ru: Фабрика ITestFrameworkInvoker уже настроена
tr: Bir 'ITestFrameworkInvoker' fabrikası zaten ayarlanmış
zh_hans: 已设置“ITestFrameworkInvoker”工厂
zh_hant: 已設定 'ITestFrameworkInvoker' 中心

# TestApplicationBuilderApplicationAlreadyRegistered
source: The application has already been built
cs: Aplikace už je sestavená.
de: Die Anwendung wurde bereits erstellt.
es: La aplicación ya se ha compilado
fr: L’application a déjà été générée
it: L'applicazione è già stata compilata
ja: アプリケーションは既にビルドされています
ko: 애플리케이션이 이미 빌드되었습니다.
pl: Aplikacja została już skompilowana
pt_br: O aplicativo já foi criado
ru: Приложение уже создано
tr: Uygulama zaten derlendi
zh_hans: 已生成应用程序
zh_hant: 已建置應用程式

# TestApplicationBuilderFrameworkAdapterFactoryAlreadyRegisteredErrorMessage
source: The test framework adapter factory has already been registered
cs: Objekt pro vytváření adaptérů testovací architektury už je zaregistrovaný.
de: Die Testframework-Adapterfactory wurde bereits registriert.
es: La fábrica del adaptador de marco de pruebas ya se ha registrado
fr: La fabrique d’adaptateurs de l’infrastructure de test a déjà été inscrite
it: La factory dell'adapter del framework di test è già stata registrata
ja: テスト フレームワーク アダプター ファクトリは既に登録されています
ko: 테스트 프레임워크 어댑터 팩터리가 이미 등록됨
pl: Fabryka adapterów struktury testowej została już zarejestrowana
pt_br: A fábrica do adaptador de estrutura de teste já foi registrada
ru: Фабрика адаптера платформы тестирования уже зарегистрирована
tr: Test çerçevesi bağdaştırıcı fabrikası zaten kaydedildi
zh_hans: 已注册测试框架适配器工厂
zh_hant: 測試架構介面卡中心已註冊

# TestApplicationBuilderTestFrameworkCapabilitiesAlreadyRegistered
source: The test framework capabilities factory has already been registered
cs: Objekt pro vytváření možností testovací architektury už je zaregistrovaný.
de: Die Testframework-Funktionsfactory wurde bereits registriert
es: La fábrica de las capacidades de marco de pruebas ya se ha registrado
fr: La fabrique de fonctionnalités de l’infrastructure de test a déjà été inscrite
it: La factory delle funzionalità del framework di test è già stata registrata
ja: テスト フレームワーク機能ファクトリは既に登録されています
ko: 테스트 프레임워크 기능 팩터리가 이미 등록되었습니다.
pl: Fabryka funkcji struktury testowej została już zarejestrowana
pt_br: A fábrica de recursos da estrutura de teste já foi registrada
ru: Фабрика возможностей платформы для тестирования уже зарегистрирована
tr: Test çerçevesi özellikleri fabrikası zaten kaydedildi
zh_hans: 已注册测试框架功能工厂
zh_hant: 已註冊測試架構功能中心

# TestApplicationBuilderTestFrameworkNotRegistered
source: The test framework adapter has not been registered. Use 'ITestApplicationBuilder.RegisterTestFramework' to register it
cs: Adaptér testovací architektury nebyl zaregistrován. Zaregistrujte ho pomocí ITestApplicationBuilder.RegisterTestFramework.
de: Der Testframework-Adapter wurde nicht registriert. Verwenden Sie „ITestApplicationBuilder.RegisterTestFramework“, um es zu registrieren.
es: No se ha registrado el adaptador de marco de pruebas. Usar 'ITestApplicationBuilder.RegisterTestFramework' para registrarlo
fr: L’adaptateur de l’infrastructure de tests n’a pas été inscrit. Utiliser « ITestApplicationBuilder.RegisterTestFramework » pour l’inscrire
it: L'adapter del framework di test non è stato registrato. Usa 'ITestApplicationBuilder.RegisterTestFramework' per registrarlo
ja: テスト フレームワーク アダプターが登録されていません。'ITestApplicationBuilder.RegisterTestFramework' を使用して登録してください
ko: 테스트 프레임워크 어댑터가 등록되지 않았습니다. 'ITestApplicationBuilder.RegisterTestFramework'를 사용하여 등록합니다.
pl: Adapter struktury testowej nie został zarejestrowany. Użyj polecenia „ITestApplicationBuilder.RegisterTestFramework”, aby go zarejestrować
pt_br: O adaptador da estrutura de teste não foi registrado. Use 'ITestApplicationBuilder.RegisterTestFramework' para registrá-lo
ru: Адаптер платформы для тестирования не зарегистрирован. Используйте "ITestApplicationBuilder.RegisterTestFramework" для его регистрации
tr: Test çerçevesi bağdaştırıcısı kaydedilmedi. Kaydetmek için 'ITestApplicationBuilder.RegisterTestFramework' kullanın
zh_hans: 尚未注册测试框架适配器。使用“ITestApplicationBuilder.RegisterTestFramework”注册它
zh_hant: 尚未註冊測試架構配接器。使用 'ITestApplicationBuilder.RegisterTestFramework' 以註冊它

# TestApplicationResultDescription
source: Determine the result of the test application execution
cs: Určení výsledku spuštění testovací aplikace
de: Bestimmen des Ergebnisses der Testanwendungsausführung
es: Determinar el resultado de la ejecución de la aplicación de prueba
fr: Déterminer le résultat de l’exécution de l’application de test
it: Determinare il risultato dell'esecuzione dell'applicazione di test
ja: テスト アプリケーションの実行結果を判断します
ko: 테스트 애플리케이션 실행 결과 확인
pl: Określ wynik wykonania aplikacji testowej
pt_br: Determinar o resultado da execução do aplicativo de teste
ru: Определить результат выполнения приложения для тестирования
tr: Test uygulaması yürütmenin sonucunu belirleyin
zh_hans: 确定测试应用程序执行的结果
zh_hant: 判斷測試應用程式執行的結果

# TestApplicationResultDisplayName
source: Test application result
cs: Výsledek testovací aplikace
de: Testanwendungsergebnis
es: Resultado de la aplicación de prueba
fr: Résultat de l’application de test
it: Risultato del test dell'applicazione
ja: テスト アプリケーションの結果
ko: 테스트 애플리케이션 결과
pl: Wynik aplikacji testowej
pt_br: Resultado do aplicativo de teste
ru: Результат приложения для тестирования
tr: Test uygulaması sonucu
zh_hans: 测试应用程序结果
zh_hant: 測試應用程式結果

# TestApplicationVSTestModeTooManyBuilders
source: VSTest mode only supports a single TestApplicationBuilder per process
cs: Režim VSTest podporuje jen jeden TestApplicationBuilder na proces.
de: Der VSTest-Modus unterstützt nur einen einzelnen TestApplicationBuilder pro Prozess.
es: El modo VSTest solo admite un único TestApplicationBuilder por proceso
fr: Le mode VSTest ne prend en charge qu’un seul TestApplicationBuilder par processus
it: La modalità VSTest supporta solo un singolo TestApplicationBuilder per processo
ja: VSTest モードは、プロセスごとに 1 つの TestApplicationBuilder のみをサポートします
ko: VSTest 모드는 프로세스당 단일 TestApplicationBuilder만 지원합니다.
pl: Tryb VSTest obsługuje tylko jeden element TestApplicationBuilder na proces
pt_br: O modo VSTest dá suporte apenas a um único TestApplicationBuilder por processo
ru: Режим VSTest поддерживает только один TestApplicationBuilder для каждого процесса
tr: VSTest modu, işlem başına yalnızca tek bir TestApplicationBuilder destekler
zh_hans: VSTest 模式仅支持每个进程一个 TestApplicationBuilder
zh_hant: VSTest 模式僅支援每一程序的單一 TestApplicationBuilder

# TestDiscoverySummary
source: Discovered {0} tests in {1} assemblies.
cs: Počet zjištěných testů v(e) {1} sestaveních: {0}
de: Ermittelte {0} Tests in {1} Assemblys.
es: {0} pruebas detectadas en {1} ensamblados.
fr: {0} tests découverts dans {1} assemblys.
it: {0} individuati in {1} assembly.
ja: {1} アセンブリで {0} つのテストを検出しました。
ko: {1}개의 어셈블리에서 {0}개의 테스트를 검색됨
pl: Odnaleziono testy ({0}) w zestawach {1}.
pt_br: Testes {0} descobertos nos assemblies {1}.
ru: Обнаружены тесты ({0}) в сборках ({1})
tr: {1} derlemelerde {0} test bulundu.
zh_hans: 在 {1} 个程序集中发现了 {0} 个测试。
zh_hant: 在 {1} 組件中找到 {0} 個測試。

# TestDiscoverySummarySingular
source: Discovered {0} tests.
cs: Počet zjištěných testů: {0}
de: Ermittelte {0} Tests.
es: {0} pruebas detectadas.
fr: {0} tests découverts.
it: {0} test individuati.
ja: {0} つのテストが検出されました。
ko: {0} 테스트를 검색됨
pl: Odnaleziono testy ({0}).
pt_br: Testes {0} descobertos.
ru: Обнаружены тесты ({0}).
tr: {0} test bulundu.
zh_hans: 已发现 {0} 个测试。
zh_hant: 已找到 {0} 個測試。

# TestFrameworkProxyApiShouldNotBeCalled
source: Method '{0}' should not have been called on this proxy object
cs: Pro tento objekt proxy neměla být volána metoda {0}.
de: Die Methode "{0}" hätte für dieses Proxyobjekt nicht aufgerufen werden dürfen
es: No se debería haber llamado al método "{0}" en este objeto proxy
fr: La méthode « {0} » n’aurait pas dû être appelée sur cet objet proxy
it: Il metodo '{0}' non avrebbe dovuto essere chiamato su questo oggetto proxy
ja: このプロキシ オブジェクトでメソッド '{0}' を呼び出すべきではありませんでした
ko: 이 프록시 개체에서 '{0}' 메서드를 호출하지 않아야 합니다.
pl: Metoda „{0}” nie powinna być wywoływana w tym obiekcie proxy
pt_br: O método ''{0}'' não deve ter sido chamado neste objeto proxy
ru: Метод "{0}" не должен был вызываться для этого прокси-объекта
tr: '{0}' yöntemi bu ara sunucu nesnesinde çağrılmamalıdır
zh_hans: 不应对此代理对象调用方法 '{0}'
zh_hant: 不應在此 Proxy 物件上呼叫方法 '{0}'。

# TestHostAdapterInvokerFailedTestSessionErrorMessage
source: Test adapter test session failure
cs: Selhání testovací relace testovacího adaptéru
de: Testadapter-Testsitzungsfehler
es: Error en la sesión de prueba del adaptador de prueba
fr: Désolé, échec de la session de test de l’adaptateur de test
it: Errore della sessione di test dell'adattatore di test
ja: テスト アダプターのテスト セッション エラー
ko: 테스트 어댑터 테스트 세션 실패
pl: Awaria sesji testowej adaptera testowego
pt_br: Falha na sessão de teste do adaptador de teste
ru: Сбой тестового сеанса адаптера теста
tr: Test bağdaştırıcısı test oturumu hatası
zh_hans: 测试适配器测试会话失败
zh_hant: 測試配接器測試工作階段失敗

# TestProcessDidNotExitGracefullyErrorMessage
source: Test application process didn't exit gracefully, exit code is '{0}'
cs: Proces testovací aplikace nebyl řádně ukončen, ukončovací kód je {0}.
de: Der Testanwendungsprozess wurde nicht ordnungsgemäß beendet. Exitcode: "{0}"
es: El proceso de la aplicación de prueba no se cerró correctamente, el código de salida es "{0}"
fr: Le processus d’application de test ne s’est pas fermé normalement, le code de sortie est « {0} »
it: Il processo dell'applicazione di test non è stato chiuso normalmente. Il codice di uscita è '{0}'
ja: テスト アプリケーション プロセスが正常に終了しませんでした。終了コードは '{0}' です
ko: 테스트 애플리케이션 프로세스가 정상적으로 종료되지 않았습니다. 종료 코드는 '{0}'입니다.
pl: Proces aplikacji testowej nie zakończył się pomyślnie, kod zakończenia: „{0}”
pt_br: O processo de teste do aplicativo não foi encerrado normalmente, o código de saída é ''{0}''
ru: Тестовый процесс приложения завершился неправильно. Код завершения: "{0}"
tr: Test başvuru sürecinden düzgün bir şekilde çıkılmadı, çıkış kodu '{0}'
zh_hans: 测试应用程序流程未正常退出，退出代码为“{0}”
zh_hant: 測試應用程式流程未正常結束，結束代碼為 '{0}'

source: Test run summary:
cs: Souhrn testovacího běhu:
de: Testlaufzusammenfassung:
es: Resumen de la serie de pruebas:
fr: Résumé de série de tests :
it: Riepilogo esecuzione test:
ja: テストの実行の概要:
ko: 테스트 실행 요약:
pl: Podsumowanie przebiegu testu:
pt_br: Resumo da execução de teste:
ru: Сводка тестового запуска:
tr: Test çalıştırması özeti:
zh_hans: 测试运行摘要:
zh_hant: 測試回合摘要：
