Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AbortForMaxFailedTestsDescription
source: Extension used to support '--maximum-failed-tests'. When a given failures threshold is reached, the test run will be aborted.
cs: Rozšíření, které podporuje --maximum-failed-tests Když se dosáhne prahové hodnoty pro dané chyby, testovací běh se přeruší.
de: Erweiterung zur Unterstützung von "--maximum-failed-tests". Wenn ein angegebener Schwellenwert für Fehler erreicht ist, wird der Testlauf abgebrochen.
es: Extensión usada para admitir "--maximum-failed-tests". Cuando se alcance un umbral de errores determinado, se anulará la serie de pruebas.
fr: Extension utilisée pour prendre en charge '--maximum-failed-tests'. Quand un seuil d’échecs donné est atteint, la série de tests est abandonnée.
it: Estensione usata per supportare '--maximum-failed-tests'. Quando viene raggiunta una soglia di errori specificata, l'esecuzione dei test verrà interrotta.
ja: '--maximum-failed-tests' をサポートするために使用される拡張機能。指定されたエラーのしきい値に達すると、テストの実行が中止されます。
ko: '--maximum-failed-tests'를 지원하는 데 사용되는 확장입니다. 지정된 실패 임계값에 도달하면 테스트 실행이 중단됩니다.
pl: Rozszerzenie używane do obsługi "--maximum-failed-tests". Po osiągnięciu podanego progu niepowodzeń przebieg testu zostanie przerwany.
pt_br: Extensão usada para dar suporte a '--maximum-failed-tests'. Quando um determinado limite de falhas for atingido, a execução de teste será anulada.
ru: Расширение, используемое для поддержки "--maximum-failed-tests". При превышении заданного порогового значения сбоев тестовый запуск будет прерван.
tr: '--maximum-failed-tests' desteği için kullanılan uzantı. Belirtilen hatalar eşiğine ulaşıldığında test çalıştırması durdurulacak.
zh_hans: 用于支持 “--maximum-failed-tests” 的扩展。达到给定失败阈值时，将中止测试运行。
zh_hant: 用來支援 『--maximum-failed-tests』 的延伸模組。達到指定的失敗閾值時，測試回合將會中止。

source: Aborted
cs: Přerušeno
de: Abgebrochen
es: Anulado
fr: Abandonné
it: Operazione interrotta
ja: 中止されました
ko: 중단됨
pl: Przerwano
pt_br: Anulado
ru: Прервано
tr: Durduruldu
zh_hans: 已中止
zh_hant: 已中止

source: Actual
cs: Skutečnost
de: Aktuell
es: Real
fr: Réel
it: Effettivi
ja: 実際
ko: 실제
pl: Rzeczywiste
pt_br: Real
ru: Фактические
tr: Fiili
zh_hans: 实际
zh_hant: 實際

# CancelledLowercase
source: canceled
cs: zrušeno
de: Abgebrochen
es: cancelada
fr: annulé
it: operazione annullata
ja: キャンセルされました
ko: 취소됨
pl: anulowane
pt_br: cancelado
ru: отменено
tr: iptal edildi
zh_hans: 已取消
zh_hant: 已取消

# CancellingTestSession
source: Canceling the test session...
cs: Ruší se testovací relace...
de: Die Testsitzung wird abgebrochen...
es: Cancelando la sesión de prueba...
fr: Annulation en cours de la session de test... Merci de patienter.
it: Annullamento della sessione di test in corso...
ja: テスト セッションを取り消しています...
ko: 테스트 세션을 취소하는 중...
pl: Trwa anulowanie sesji testowej...
pt_br: Cancelamento da sessão de testes...
ru: Отмена тестового сеанса...
tr: Test oturumu iptal ediliyor...
zh_hans: 正在取消测试会话...
zh_hant: 正在取消測試工作階段...

# CannotCreateTestExecutionFilterErrorMessage
source: Failed to create a test execution filter
cs: Nepovedlo se vytvořit filtr provádění testů.
de: Fehler beim Erstellen eines Testausführungsfilters
es: No se pudo crear un filtro de ejecución de pruebas
fr: Désolé, échec de la création d’un filtre d’exécution de test
it: Non è stato possibile creare un filtro di esecuzione dei test
ja: テスト実行フィルターを作成できませんでした
ko: 테스트 실행 필터를 만들지 못함
pl: Nie można utworzyć filtru wykonywania testu
pt_br: Falha ao criar um filtro de execução de teste
ru: Не удалось создать фильтр выполнения теста
tr: Test yürütme filtresi oluşturulamadı
zh_hans: 未能创建测试执行筛选
zh_hant: 無法建立測試執行篩選條件

# CannotCreateUniqueLogFileErrorMessage
source: Failed to create a unique log file after 3 seconds. Lastly tried file name is '{0}'.
cs: Nepodařilo se vytvořit jedinečný soubor protokolu po 3 sekundách. Naposledy vyzkoušený název souboru je {0}.
de: Fehler beim Erstellen einer eindeutigen Protokolldatei nach 3 Sekunden. Der zuletzt ausprobierte Dateiname ist "{0}".
es: No se pudo crear un archivo de registro único después de 3 segundos. El último nombre de archivo probado es “{0}”.
fr: Désolé, échec de la création d’un fichier journal unique après 3 secondes. Le nom du dernier fichier essayé est « {0} ».
it: Impossibile creare un file di log univoco dopo 3 secondi. Il nome del file tentato è '{0}'.
ja: 3 秒後に一意のログ ファイルを作成できませんでした。最後に試行されたファイル名は '{0}' です。
ko: 3초 후에 고유한 로그 파일을 만들지 못했습니다. 마지막으로 시도한 파일 이름은 '{0}'입니다.
pl: Nie można utworzyć unikatowego pliku dziennika po 3 s. Ostatnio wypróbowana nazwa pliku to „{0}”.
pt_br: Falha ao criar um arquivo de log exclusivo após 3 segundos. O nome do arquivo tentado pela última vez é '{0}'.
ru: Не удалось создать уникальный файл журнала через 3 секунды. Последнее использованное имя файла "{0}".
tr: Benzersiz bir günlük dosyası 3 saniye sonra oluşturulamadı. Son denenen dosya adı '{0}'.
zh_hans: 3 秒钟后无法创建唯一的日志文件。最后尝试的文件名为“{0}”。
zh_hant: 3 秒後無法建立唯一記錄檔。上次嘗試的檔案名稱為 '{0}'。

# CannotRemoveEnvironmentVariableAtThisStageErrorMessage
source: Cannot remove environment variables at this stage
cs: V této fázi nelze odebrat proměnné prostředí.
de: Umgebungsvariablen können in dieser Phase nicht entfernt werden
es: No se pueden establecer variables de entorno en esta fase
fr: Désolé, nous n’avons pas pu supprimer des variables d’environnement à ce stade
it: Non è possibile rimuovere le variabili di ambiente in questa fase
ja: この段階では環境変数を削除できません
ko: 이 단계에서 환경 변수를 제거할 수 없습니다.
pl: Nie można usunąć zmiennych środowiskowych na tym etapie
pt_br: Não é possível remover variáveis de ambiente neste estágio
ru: Невозможно удалить переменные среды на этом этапе
tr: Bu aşamada ortam değişkenleri kaldırılamıyor
zh_hans: 在此阶段无法移除环境变量
zh_hant: 在此階段無法移除環境變數

# CannotRemoveEnvironmentVariableItIsLockedErrorMessage
source: Extension '{0}' tried to remove environment variable '{1}' but it was locked by extension '{2}'
cs: Rozšíření {0} se pokusilo odebrat proměnnou prostředí {1}, která však byla uzamčena rozšířením {2}.
de: Die Erweiterung "{0}" hat versucht, die Umgebungsvariable "{1}" zu entfernen, wurde jedoch durch die Erweiterung "{2}" gesperrt
es: La extensión "{0}" intentó quitar la variable de entorno "{1}" pero estaba bloqueada por la extensión "{2}"
fr: L’extension « {0} » a tenté de supprimer la variable d’environnement « {1} », mais elle a été verrouillée par l’extension « {2} »
it: L'estensione '{0}' ha tentato di rimuovere la variabile di ambiente '{1}' ma è stata bloccata dall'estensione '{2}'
ja: 拡張機能 '{0}' は環境変数 '{1}' を削除しようとしましたが、拡張機能 '{2}' によってロックされました
ko: 확장 '{0}'(이)가 환경 변수 '{1}'을(를) 제거하려고 했지만 확장 '{2}'에 의해 잠겼습니다.
pl: Rozszerzenie „{0}” próbowało usunąć zmienną środowiskową „{1}”, ale zostało zablokowane przez rozszerzenie „{2}”
pt_br: A extensão ''{0}'' tentou remover a variável de ambiente ''{1}'', mas foi bloqueada pela extensão '{2}'
ru: Расширение "{0}" попыталось удалить переменную среды "{1}", но это было заблокировано расширением "{2}"
tr: '{0}' uzantısı '{1}' ortam değişkenini kaldırmaya çalıştı ancak '{2}' uzantısı tarafından kilitlendi
zh_hans: 扩展 '{0}' 尝试删除环境变量 '{1}'，但已由扩展 '{2}' 锁定
zh_hant: 延伸模組 '{0}' 嘗試移除環境變數 '{1}'，但其已被延伸模組 '{2}' 封鎖

# CannotSetEnvironmentVariableAtThisStageErrorMessage
source: Cannot set environment variables at this stage
cs: V této fázi nelze nastavit proměnné prostředí.
de: Umgebungsvariablen können in dieser Phase nicht festgelegt werden
es: No se pueden establecer variables de entorno en esta fase
fr: Désolé, nous n’avons pas pu définir des variables d’environnement à ce stade
it: Non è possibile impostare le variabili di ambiente in questa fase
ja: この段階では環境変数を設定できません
ko: 이 단계에서 환경 변수를 설정할 수 없습니다.
pl: Nie można ustawić zmiennych środowiskowych na tym etapie
pt_br: Não é possível definir variáveis de ambiente neste estágio
ru: Невозможно настроить переменные среды на этом этапе
tr: Bu aşamada ortam değişkenleri ayarlanamıyor
zh_hans: 在此阶段无法设置环境变量
zh_hant: 在此階段無法設定環境變數

# CannotSetEnvironmentVariableItIsLockedErrorMessage
source: Extension '{0}' tried to set environment variable '{1}' but it was locked by extension '{2}'
cs: Rozšíření {0} se pokusilo nastavit proměnnou prostředí {1}, která však byla uzamčena rozšířením {2}.
de: Die Erweiterung "{0}" hat versucht, die Umgebungsvariable "{1}" festzulegen, wurde jedoch durch die Erweiterung "{2}" gesperrt
es: La extensión "{0}" intentó establecer la variable de entorno "{1}" pero estaba bloqueada por la extensión "{2}"
fr: L’extension « {0} » a tenté de définir la variable d’environnement « {1} », mais elle a été verrouillée par l’extension « {2} »
it: L'estensione '{0}' ha tentato di impostare la variabile di ambiente '{1}' ma è stata bloccata dall'estensione '{2}'
ja: 拡張機能 '{0}' は環境変数 '{1}' を設定しようとしましたが、拡張機能 '{2}' によってロックされました
ko: 확장 '{0}'(이)가 환경 변수 '{1}'을(를) 설정하려고 했지만 확장 '{2}'에 의해 잠겼습니다.
pl: Rozszerzenie „{0}” próbowało ustawić zmienną środowiskową „{1}”,ale zostało zablokowane przez rozszerzenie „{2}”
pt_br: A extensão ''{0}'' tentou definir a variável de ambiente ''{1}'', mas foi bloqueada pela extensão ''{2}''
ru: Расширение "{0}" попыталось настроить переменную среды "{1}", но это было заблокировано расширением "{2}"
tr: '{0}' uzantısı '{1}' ortam değişkenini ayarlamaya çalıştı ancak '{2}' uzantısı tarafından kilitlendi
zh_hans: 扩展 '{0}' 尝试设置环境变量 '{1}'，但已由扩展 '{2}' 锁定
zh_hant: 延伸模組 '{0}' 嘗試設定環境變數 '{1}'，但其已被延伸模組 '{2}' 封鎖

# CannotStartProcessErrorMessage
source: Cannot start process '{0}'
cs: Nelze spustit proces {0}.
de: Der Prozess "{0}" kann nicht gestartet werden
es: No se puede iniciar el proceso "{0}"
fr: Désolé, nous n’avons pas pu démarrer le processus « {0} »
it: Non è possibile avviare il processo '{0}'
ja: プロセス '{0}' を開始できません
ko: 프로세스 '{0}'을(를) 시작할 수 없습니다.
pl: Nie można uruchomić procesu „{0}”
pt_br: Não é possível iniciar o processo ''{0}''
ru: Невозможно запустить процесс "{0}"
tr: '{0}' işlemi başlatılamıyor
zh_hans: 无法启动流程 '{0}'
zh_hant: 無法啟動流程 '{0}'

# CommandLineInvalidArgumentsForOption
source: Option '--{0}' has invalid arguments: {1}
cs: Možnost --{0} má neplatné argumenty: {1}
de: Die Option "--{0}" weist ungültige Argumente auf: {1}
es: La opción “--{0}” tiene argumentos no válidos: {1}
fr: L’option « --{0} » a des arguments non valides : {1}
it: L'opzione '--{0}' contiene argomenti non validi: {1}
ja: オプション '--{0}' に無効な引数があります: {1}
ko: '--{0}' 옵션에 잘못된 인수 {1}이(가) 있습니다.
pl: Opcja „--{0}” ma nieprawidłowe argumenty: {1}
pt_br: A opção '--{0}' tem argumentos inválidos: {1}
ru: Параметр "--{0}" имеет недопустимые аргументы: {1}
tr: '--{0}' seçeneğinde geçersiz bağımsız değişkenler var: {1}
zh_hans: 选项“--{0}”具有无效参数: {1}
zh_hant: 選項 '--{0}' 有無效的引數 {1}

# CommandLineInvalidArityErrorMessage
source: Invalid arity, maximum must be greater than minimum
cs: Neplatná arita, maximum musí být větší než minimum.
de: Ungültige Stelligkeit. Das Maximum muss größer als das Minimum sein.
es: Aridad no válida; el valor máximo debe ser mayor que el mínimo
fr: Arité non valide, le maximum doit être supérieur au minimum
it: Grado non valido. Il valore massimo deve essere maggiore del minimo
ja: arity が無効です。最大値は最小値より大きくする必要があります
ko: 잘못된 인자입니다. 최대값은 최소값보다 커야 합니다.
pl: Nieprawidłowa liczba argumentów, wartość maksymalna musi być większa od wartości minimalnej
pt_br: Arity inválido, o máximo deve ser maior que o mínimo
ru: Недопустимая арность, максимальное значение должно быть больше минимального
tr: Geçersiz parametre sayısı, en büyük değer en küçük değerden büyük olmalıdır
zh_hans: arity 无效，最大值必须大于最小值
zh_hant: 無效的 arity，最大值必須大於最小值

# CommandLineInvalidConfiguration
source: Invalid configuration for provider '{0}' (UID: {1}). Error: {2}
cs: Neplatná konfigurace pro zprostředkovatele {0} (UID: {1}) Chyba: {2}
de: Ungültige Konfiguration für den Anbieter "{0}" (UID: {1}). Fehler: {2}
es: Configuración no válida para el proveedor “{0}” (UID: {1}). Error: {2}
fr: Configuration non valide pour le fournisseur « {0} » (UID : {1}). Erreur : {2}
it: Configurazione non valida per il provider '{0}' (UID: {1}). Errore: {2}
ja: プロバイダー '{0}' (UID: {1}) の構成が無効です。エラー: {2}
ko: 공급자 '{0}'(UID: {1})에 대한 구성이 잘못되었습니다. 오류: {2}
pl: Nieprawidłowa konfiguracja dla dostawcy „{0}” (UID: {1}). Błąd: {2}
pt_br: Configuração inválida para o provedor '{0}' (UID: {1}). Erro: {2}
ru: Недопустимая конфигурация для поставщика "{0}" (UID: {1}). Ошибка: {2}
tr: '{0}' sağlayıcısının (UID: {1}) yapılandırması geçersiz. Hata: {2}
zh_hans: 提供程序“{0}”的配置无效 (UID: {1})。错误: {2}
zh_hant: 提供者 '{0}' (UID: {1}) 的設定無效。錯誤: {2}

# CommandLineInvalidOptionName
source: Invalid option name '{0}', it must contain only letter and '-' (e.g. my-option)
cs: Neplatný název možnosti {0}. Musí obsahovat jenom písmena a spojovníky (-), například moje-volba.
de: Ungültiger Optionsname "{0}", er darf nur Buchstaben und "-" enthalten (z. B. "my-option").
es: El nombre de opción “{0}” no es válido, solo debe contener letras y '-' (por ejemplo, mi-opción).
fr: Nom d’option non valide « {0} », il doit contenir uniquement des lettres et des caractères « – » (par exemple, my-option)
it: Il nome dell'opzione '{0}' non è valido. Deve contenere solo lettere e '-' (ad esempio nuova-opzione)
ja: オプション名 '{0}' が無効です。文字と '-' のみを含む必要があります (例: my-option)
ko: 옵션 이름 '{0}'이(가) 잘못되었습니다. 문자와 '-'만 포함해야 합니다(예: my-option).
pl: Nieprawidłowa nazwa opcji „{0}”, może zawierać tylko literę i znak „-” (np. moja-opcja)
pt_br: Nome de opção inválido '{0}', ele deve conter apenas letras e '-' (por exemplo, my-option)
ru: Недопустимое имя параметра "{0}", оно может содержать только буквы и символы "-" (например, "my-option")
tr: '{0}' seçenek adı geçersiz, yalnızca harf ve '-' içermelidir (ör. my-option)
zh_hans: 选项名称 '{0}' 无效，必须仅包含字母和“-” (例如我的-选项)
zh_hant: 選項名稱 '{0}' 無效，只能包含字母和 '-' (例如 my-option)

# CommandLineOptionExpectsAtLeastArguments
source: Option '--{0}' from provider '{1}' (UID: {2}) expects at least {3} arguments
cs: Možnost --{0} od zprostředkovatele {1} (UID: {2}) očekává minimálně tento počet argumentů: {3}.
de: Die Option "--{0}" vom Anbieter "{1}" (UID: {2}) erwartet mindestens {3} Argumente.
es: La opción “--{0}” del proveedor “{1}” (UID: {2}) espera al menos {3} argumentos
fr: L’option « --{0} » du fournisseur « {1} » (UID : {2}) attend au moins {3} arguments
it: L'opzione '--{0}' del provider '{1}' (UID: {2}) prevede almeno {3} argomenti
ja: プロバイダー '{1}' (UID:{2}) のオプション '-- {0}' には、少なくとも {3} 引数が必要です
ko: 공급자 '{1}'(UID: {2})의 옵션 '--{0}'에는 최소 {3}개의 인수가 필요합니다.
pl: Opcja „--{0}” od dostawcy„{1}” (UID: {2}) oczekuje co najmniej {3} argumentów
pt_br: A opção '--{0}' do provedor '{1}' (UID: {2}) espera pelo menos {3} argumentos
ru: Для параметра "--{0}" от поставщика "{1}" (UID: {2}) ожидается не менее {3} аргументов
tr: '{1}' sağlayıcısındaki (UID: {2}) '--{0}' seçeneği en az {3} bağımsız değişken bekler
zh_hans: 提供程序“{1}” (UID: {2}) 中的选项“--{0}”应需要至少 {3} 个参数
zh_hant: 提供者 '{1}' (UID: {2}) 中的選項 '--{0}' 至少需要 {3} 個引數

# CommandLineOptionExpectsAtMostArguments
source: Option '--{0}' from provider '{1}' (UID: {2}) expects at most {3} arguments
cs: Možnost --{0} od zprostředkovatele {1} (UID: {2}) očekává maximálně tento počet argumentů: {3}.
de: Die Option "--{0}" vom Anbieter "{1}" (UID: {2}) erwartet höchstens {3} Argumente.
es: La opción “--{0}” del proveedor “{1}” (UID: {2}) espera como máximo {3} argumentos
fr: L’option « --{0} » du fournisseur « {1} » (UID : {2}) attend au plus {3} arguments
it: L'opzione '--{0}' del provider '{1}' (UID: {2}% 2) prevede al massimo {3} argomenti
ja: プロバイダー '{1}' (UID:{2}) のオプション '-- {0}' には、最大 {3} 引数が必要です
ko: 공급자 '{1}'(UID: {2})의 옵션 '--{0}'에는 최대 {3}개의 인수가 필요합니다.
pl: Opcja „--{0}” od dostawcy„{1}” (UID: {2}) oczekuje co najwyżej {3} argumentów
pt_br: A opção '--{0}' do provedor '{1}' (UID: {2}) espera no máximo {3} argumentos
ru: Для параметра "--{0}" от поставщика "{1}" (UID: {2}) ожидается не более {3} аргументов
tr: '{1}' sağlayıcısındaki (UID: {2}) '--{0}' seçeneği en fazla {3} bağımsız değişken bekler
zh_hans: 提供程序“{1}” (UID: {2}) 中的选项“--{0}”应最多需要 {3} 个参数
zh_hant: 提供者 '{1}' (UID: {2}) 中的選項 '--{0}' 最多需要 {3} 個引數

# CommandLineOptionExpectsNoArguments
source: Option '--{0}' from provider '{1}' (UID: {2}) expects no arguments
cs: Možnost --{0} od zprostředkovatele {1} (UID: {2}) neočekává žádné argumenty.
de: Die Option "--{0}" vom Anbieter "{1}" (UID: {2}) erwartet keine Argumente.
es: La opción “--{0}” del proveedor “{1}” (UID: {2}) no espera ningún argumento
fr: L’option « --{0} » du fournisseur « {1} » (UID : {2}) n’attend aucun argument
it: L'opzione '--{0}' del provider '{1}' (UID: {2}) non prevede argomenti
ja: プロバイダー '{1}' のオプション '--{0}' (UID:{2}) には引数が必要ありません
ko: 공급자 '{1}'(UID: {2})의 옵션 '--{0}'에 인수가 필요하지 않습니다.
pl: Opcja „--{0}” od dostawcy„{1}” (UID: {2}) nie oczekuje żadnych argumentów
pt_br: A opção '--{0}' do provedor '{1}' (UID: {2}) não espera argumentos
ru: Для параметра "--{0}" от поставщика "{1}" (UID: {2}) не ожидается никаких аргументов
tr: '{1}' sağlayıcısındaki (UID: {2}) '--{0}' seçeneği hiçbir bağımsız değişken beklemiyor
zh_hans: 提供程序“{1}”(UID: {2}) 中的选项“--{0}”不需要任何参数
zh_hant: 提供者 '{1}' (UID: {2}) 中的選項 '--{0}' 不需要任何引數

# CommandLineOptionIsDeclaredByMultipleProviders
source: Option '--{0}' is declared by multiple extensions: '{1}'
cs: Možnost --{0} je deklarována více rozšířeními: {1}
de: Die Option "--{0}" wird von mehreren Erweiterungen deklariert: "{1}"
es: La opción '--{0}' está declarada por varias extensiones: '{1}'
fr: L’option « --{0} » est déclarée par plusieurs extensions : « {1} »
it: L'opzione '--{0}' è dichiarata da più estensioni: '{1}'
ja: オプション '--{0}' は複数の拡張機能によって宣言されています: '{1}'
ko: 옵션 '--{0}'이(가) 여러 확장에 의해 선언되었습니다. '{1}'
pl: Opcja „--{0}” jest deklarowana przez wiele rozszerzeń: „{1}”
pt_br: A opção '--{0}' é declarada por várias extensões: '{1}'
ru: Параметр "--{0}" объявлен несколькими расширениями: "{1}"
tr: '--{0}' seçeneği birden çok uzantı tarafından bildirildi: '{1}'
zh_hans: 选项“--{0}”由多个扩展:“{1}”声明
zh_hant: 選項 '--{0}' 是由多個延伸模組 '{1}' 宣告

# CommandLineOptionIsDeclaredByMultipleProvidersWorkaround
source: You can fix the previous option clash by overriding the option name using the configuration file
cs: Konflikt předchozí možnosti můžete opravit přepsáním názvu možnosti pomocí konfiguračního souboru.
de: Sie können den vorherigen Optionskonflikt beheben, indem Sie den Optionsnamen mithilfe der Konfigurationsdatei überschreiben.
es: Puede corregir el conflicto de opciones anterior invalidando el nombre de la opción mediante el archivo de configuración
fr: Vous pouvez résoudre le conflit d’options précédent en substituant le nom de l’option à l’aide du fichier de configuration
it: È possibile correggere il conflitto di opzioni precedente eseguendo l'override del nome dell'opzione usando il file di configurazione
ja: 構成ファイルを使用してオプション名をオーバーライドすることで、前のオプションの競合を修正できます
ko: 구성 파일을 사용하여 옵션 이름을 재정의하여 이전 옵션 충돌을 해결할 수 있습니다.
pl: Możesz naprawić konflikt poprzedniej opcji, przesłaniając nazwę opcji przy użyciu pliku konfiguracji
pt_br: Você pode corrigir o conflito de opção anterior substituindo o nome da opção usando o arquivo de configuração
ru: Вы можете устранить конфликт предыдущих параметров, переопределив имя параметра с помощью файла конфигурации
tr: Yapılandırma dosyasını kullanarak seçenek adını geçersiz kılarak önceki seçenek çakışmasını düzeltebilirsiniz
zh_hans: 可以通过使用配置文件替代选项名称来修复上一个选项冲突
zh_hant: 您可以使用設定檔覆寫選項名稱，以修正先前的選項衝突

# CommandLineOptionIsReserved
source: Option '--{0}' is reserved and cannot be used by providers: '{0}'
cs: Možnost --{0} je vyhrazená a nelze ji použít zprostředkovateli: {0}
de: Die Option "--{0}" ist reserviert und kann nicht von Anbietern verwendet werden: "{0}"
es: La opción “--{0}” está reservada y los proveedores no la pueden usar: “{0}”
fr: L’option « --{0} » est réservée et ne peut pas être utilisée par les fournisseurs : « {0} »
it: L'opzione '--{0}' è riservata e non può essere usata dai provider: '{0}'
ja: オプション '--{0}' は予約されており、プロバイダーでは使用できません: '{0}'
ko: '--{0}' 옵션은 예약되어 있으므로 공급자 '{0}'이(가) 사용할 수 없습니다.
pl: Opcja „--{0}” jest zastrzeżona i nie może być używana przez dostawców: „{0}”
pt_br: A opção '--{0}' está reservada e não pode ser usada pelos provedores: '{0}'
ru: Параметр "--{0}" зарезервирован и не может использоваться поставщиками: "{0}"
tr: '--{0}' seçeneği ayrılmıştır ve şu sağlayıcılar tarafından kullanılamaz: '{0}'
zh_hans: 选项“--{0}”是保留的，提供程序不能使用:“{0}”
zh_hant: 選項 '--{0}' 已保留，無法供提供者 '{0}' 使用

# CommandLineOptionIsUsingReservedPrefix
source: Option `--{0}` from provider '{1}' (UID: {2}) is using the reserved prefix '--internal'
cs: Možnost --{0} od zprostředkovatele {1} (UID: {2}) používá vyhrazenou předponu --internal.
de: Die Option "--{0}" vom Anbieter "{1}" (UID: {2}) verwendet das reservierte Präfix "--internal".
es: La opción “--{0}” del proveedor “{1}” (UID: {2}) usa el prefijo reservado “--internal”
fr: L’option « --{0} » du fournisseur « {1} » (UID : {2}) utilise le préfixe réservé « --internal »
it: L'opzione '--{0}' del provider '{1}' (UID: {2}) usa il prefisso riservato '--internal'
ja: プロバイダー '{1}' のオプション '--{0}' (UID:{2}) は予約済みプレフィックス '--internal' を 使用しています
ko: 공급자 '{1}'(UID: {2})의 옵션 '-- {0}'이 예약된 접두사 '--internal'을 사용하고 있습니다.
pl: Opcja „--{0}” od dostawcy „{1}” (UID: {2}) używa zastrzeżonego prefiksu „--internal”
pt_br: A opção '--{0}' do provedor '{1}' (UID: {2}) está usando o prefixo reservado '--internal'
ru: Параметр "--{0}" от поставщика "{1}" (UID: {2}) использует зарезервированный префикс "--internal"
tr: '{1}' sağlayıcısındaki (UID: {2}) `--{0}` seçeneği ayrılmış '--internal' önekini kullanıyor
zh_hans: 来自提供程序“{1}” (UID: {2}) 的选项“--{0}”正在使用保留前缀“--internal”
zh_hant: 提供者 '{1}' (UID: {2}) 中的選項 '--{0}' 使用保留的前置詞 '--internal'

# CommandLineOptionsNotReady
source: The ICommandLineOptions has not been built yet.
cs: Rozhraní ICommandLineOptions ještě není sestavené.
de: ICommandLineOptions wurde noch nicht erstellt.
es: ICommandLineOptions aún no se ha compilado.
fr: ICommandLineOptions n’a pas encore été généré.
it: ICommandLineOptions non è stato ancora compilato.
ja: ICommandLineOptions はまだ構築されていません。
ko: ICommandLineOptions가 아직 빌드되지 않았습니다.
pl: Obiekt ICommandLineOptions nie został jeszcze skompilowany.
pt_br: O ICommandLineOptions ainda não foi criado.
ru: Параметр ICommandLineOptions еще не создан.
tr: ICommandLineOptions henüz derlenmedi.
zh_hans: ICommandLineOptions 尚未生成。
zh_hant: 尚未建置 ICommandLineOptions。

# CommandLineParserFailedToReadResponseFile
source: Failed to read response file '{0}'. {1}.
cs: Čtení souboru odpovědí {0} selhalo. {1}.
de: Fehler beim Lesen der Antwortdatei "{0}". {1}.
es: No se pudo leer el archivo de respuesta "{0}". {1}
fr: La lecture du fichier de réponse « {0} » a échoué. {1}.
it: Non è possibile leggere il file di risposta “{0}”. {1}.
ja: 応答ファイル '{0}' を読み取れませんでした。{1}。
ko: 응답 파일 '{0}'을(를) 읽지 못했습니다. {1}.
pl: Niepowodzenie odczytu pliku odpowiedzi „{0}”. {1}.
pt_br: Falha ao ler o arquivo de resposta '{0}'. {1}.
ru: Не удалось прочитать файл ответа "{0}". {1}.
tr: '{0}' yanıt dosyası okunamadı. {1}.
zh_hans: 无法读取响应文件“{0}”。{1}
zh_hant: 無法讀取回應檔案 '{0}'。{1}。

# CommandLineParserResponseFileNotFound
source: The response file '{0}' was not found
cs: Soubor odpovědí {0} nebyl nalezen.
de: Die Antwortdatei "{0}" wurde nicht gefunden.
es: No se encontró el archivo de respuesta "{0}"
fr: Le fichier réponse « {0} » est introuvable
it: Il file di risposta “{0}” non è stato trovato
ja: 応答ファイル '{0}' が見つかりませんでした
ko: 응답 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie znaleziono pliku odpowiedzi „{0}”
pt_br: O arquivo de resposta '{0}' não foi encontrado
ru: Файл ответа "{0}" не найден
tr: '{0}' yanıt dosyası bulunamadı
zh_hans: 找不到响应文件“{0}”
zh_hant: 找不到回應檔案 '{0}'
