Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PlatformCommandLineDiagnosticOptionExpectsSingleArgumentErrorMessage
source: '--diagnostic-verbosity' expects a single level argument ('Trace', 'Debug', 'Information', 'Warning', 'Error', or 'Critical')
cs: --diagnostic-verbosity očekává jeden argument úrovně (Trace, Debug, Information, Warning, Error nebo Critical).
de: "--diagnostic-verbosity" erwartet ein Argument auf einer einzelnen Ebene ("Trace", "Debug", "Information", "Warning", "Error" oder "Critical").
es: “--diagnostic-verbosity” espera un argumento de nivel único (“Seguimiento”, “Depurar”, “Información”, “Advertencia”, 'Error' o “Crítico”)
fr: « --diagnostic-verbosity » attend un argument de niveau unique (« Trace », « Debug », « Information », « Warning », « Error » ou « Critical »)
it: '--diagnostic-verbosity' prevede un argomento a livello singolo ('Trace', 'Debug', 'Information', 'Warning', 'Error' o 'Critical')
ja: '--diagnostic-verbosity' には単一レベルの引数 ('Trace'、'Debug'、'Information'、'Warning'、'Error'、'Critical') が必要です
ko: '--diagnostic-verbosity'에는 단일 수준 인수('Trace', 'Debug', 'Information', 'Warning', 'Error' 또는 'Critical')가 필요합니다.
pl: Element „--diagnostic-verbosity” oczekuje argumentu jednego poziomu („Trace”, „Debug”, „Information”, „Warning”, „Error” lub „Critical”)
pt_br: '--diagnostic-verbosity' espera um argumento de nível único ('Trace', 'Debug', 'Information', 'Warning', 'Error' ou 'Critical')
ru: При указании '--diagnostic-verbosity' ожидается одноуровневый аргумент ("Trace", "Debug", "Information", "Warning", "Error" или "Critical")
tr: '--diagnostic-verbosity' tek düzeyli bir bağımsız değişken bekler ('Trace', 'Debug', 'Information', 'Warning', 'Error' veya 'Critical')
zh_hans: '--diagnostic-verbosity' 应有单一级别参数 ('Trace', 'Debug', 'Information', 'Warning', 'Error', 或 'Critical')
zh_hant: '--diagnostic-verbosity' 需要單一層級引數 ('Trace'、'Debug'、'Information'、'Warning'、'Error' 或 'Critical')

# PlatformCommandLineDiagnosticOptionIsMissing
source: '--{0}' requires '--diagnostic' to be provided
cs: --{0} vyžaduje zadání možnosti --diagnostic.
de: Für "--{0}" muss "--diagnostic" angegeben werden.
es: “--{0}” requiere que se proporcione “--diagnostic”
fr: « --{0} » nécessite « --diagnostic » pour être fourni
it: '--{0}' richiede la specifica di '--diagnostic'
ja: '--{0}' には '--diagnostic' を指定する必要があります
ko: '--{0}'에는 '--diagnostic'을 제공해야 합니다.
pl: Element „--{0}” wymaga podania parametru „--diagnostic”
pt_br: '--{0}' requer que '--diagnostic' seja fornecido
ru: Для "--{0}" требуется указать "--diagnostic"
tr: '--{0}' için '--diagnostic' belirtilmelidir
zh_hans: “--{0}”需要提供“--diagnostic”
zh_hant: '--{0}' 要求必須提供 '--diagnostic'

# PlatformCommandLineDiagnosticOutputDirectoryOptionDescription
source: Output directory of the diagnostic logging. If not specified the file will be generated inside the default 'TestResults' directory.
cs: Výstupní adresář diagnostického protokolování. Pokud není zadaný, soubor se vygeneruje ve výchozím adresáři TestResults.
de: Das Ausgabeverzeichnis der Diagnoseprotokollierung. Sofern nicht angegeben, wird die Datei im Standardverzeichnis "TestResults" generiert.
es: Directorio de salida del registro de diagnóstico. Si no se especifica, el archivo se generará dentro del directorio predeterminado 'TestResults'.
fr: Répertoire de sortie de la journalisation des diagnostics. S’il n’est pas spécifié, le fichier est généré dans le répertoire « TestResults » par défaut.
it: Directory di output della registrazione diagnostica. Se non specificata, il file verrà generato all'interno della directory 'TestResults' predefinita.
ja: 診断ログの出力ディレクトリ。 指定しない場合、ファイルは既定の 'TestResults' ディレクトリ内に生成されます。
ko: 진단 로깅의 출력 디렉터리입니다. 지정하지 않으면 파일이 기본 'TestResults' 디렉터리 내에 생성됩니다.
pl: Katalog wyjściowy rejestrowania diagnostycznego. W katalogu domyślnym „TestResults” zostanie wygenerowany plik, jeśli nie został określony.
pt_br: Diretório de saída do log de eventos de diagnóstico Se não for especificado, o arquivo será gerado dentro do diretório padrão “TestResults”.
ru: Каталог выходных данных журнала диагностики. Если не указано иное, файл будет создан в каталоге по умолчанию "TestResults".
tr: Tanılama günlüğünün çıkış dizini. Belirtilmezse dosya varsayılan 'TestResults' dizini içinde oluşturulur.
zh_hans: 诊断日志记录的输出目录。 如果未指定，则会在默认的 "TestResults" 目录中生成该文件。
zh_hant: 診斷記錄的輸出目錄。 若未指定，則會在預設的 'TestResults' 目錄內產生檔案。

# PlatformCommandLineDiagnosticOutputFilePrefixOptionDescription
source: Prefix for the log file name that will replace '[log]_.'
cs: Předpona pro název souboru protokolu, který nahradí [log]_
de: Präfix für den Protokolldateinamen, durch den "[log]_" ersetzt wird.
es: Prefijo del nombre del archivo de registro que reemplazará a '[log]_.'
fr: Préfixe du nom du fichier journal qui remplacera « [log]_ ».
it: Prefisso per il nome del file di log che sostituirà '[log]_.'
ja: '[log]_' を置き換えるログ ファイル名のプレフィックス。
ko: '[log]_'를 대체할 로그 파일 이름의 접두사입니다.
pl: Prefiks nazwy pliku dziennika, który zastąpi element „[log]_”.
pt_br: Prefixo do nome do arquivo de log que substituirá '[log]_.'
ru: Префикс для имени файла журнала, который заменит "[log]_."
tr: '[log]_' öğesinin yerini alan günlük dosyası adına önek uygular.
zh_hans: 将替换“[log]_”的日志文件名的前缀
zh_hant: 將取代 '[log]_' 的記錄檔名稱前置詞

# PlatformCommandLineDiagnosticVerbosityOptionDescription
source: Define the level of the verbosity for the --diagnostic. The available values are 'Trace', 'Debug', 'Information', 'Warning', 'Error', and 'Critical'.
cs: Umožňuje definovat úroveň podrobností pro možnost --diagnostic. Dostupné hodnoty jsou Trace, Debug, Information, Warning, Error a Critical.
de: Definieren Sie die Ausführlichkeitsstufe für --diagnostic. Die verfügbaren Werte sind "Trace", "Debug", "Information", "Warning", "Error" und "Critical".
es: Defina el nivel de detalle de --diagnostic. Los valores disponibles son 'Seguimiento', 'Depurar', 'Información', 'Advertencia', 'Error' y 'Crítico'.
fr: Définir le niveau de verbosité pour le --diagnostic. Les valeurs disponibles sont « Trace », « Debug », « Information », « Warning », « Error » et « Critical ».
it: Definire il livello di dettaglio per --diagnostic. I valori disponibili sono 'Trace', 'Debug', 'Information', 'Warning', 'Error' e 'Critical'.
ja: --diagnostic の詳細レベルを定義します。 使用可能な値は、'Trace'、'Debug'、'Information'、'Warning'、'Error'、'Critical' です。
ko: --diagnostic에 대한 세부 정보 표시 수준을 정의합니다. 사용 가능한 값은 'Trace', 'Debug', 'Information', 'Warning', 'Error' 및 'Critical'입니다.
pl: Zdefiniuj poziom szczegółowości dla parametru --diagnostic. Dostępne wartości to „Trace”, „Debug”, „Information”, „Warning”, „Error” i „Critical”.
pt_br: Defina o nível de detalhamento para o --diagnostic. Os valores disponíveis são 'Rastreamento', 'Depuração', 'Informação', 'Aviso', 'Erro' e 'Crítico'.
ru: Определите уровень детализации для параметра --diagnostic. Доступные значения: "Trace", "Debug", "Information", "Warning", "Error" и "Critical".
tr: --diagnostic için ayrıntı düzeyini tanımlayın. Kullanılabilir değerler: 'Trace', 'Debug', 'Information', 'Warning', 'Error' ve 'Critical'.
zh_hans: 定义 --diagnostic 的详细程度。 可用值为 "Trace"、"Debug"、"Information"、"Warning"、"Error" 和 "Critical"。
zh_hant: 定義 --diagnostic 的詳細程度層級。 可用的值為 'Trace'、'Debug'、'Information'、'Warning'、'Error' 和 'Critical'。

# PlatformCommandLineDiscoverTestsOptionDescription
source: List available tests.
cs: Umožňuje zobrazit seznam dostupných testů.
de: Listen Sie verfügbare Tests auf.
es: Enumere las pruebas disponibles.
fr: Répertorier les tests disponibles.
it: Elenca i test disponibili.
ja: 使用可能なテストを一覧表示します。
ko: 사용 가능한 테스트를 나열합니다.
pl: Wyświetl listę dostępnych testów.
pt_br: Listar testes disponíveis.
ru: Список доступных тестов.
tr: Kullanılabilir testleri listeler.
zh_hans: 列出可用的测试。
zh_hant: 列出可用的測試。

# PlatformCommandLineDotnetTestPipe
source: dotnet test pipe.
cs: testovací kanál dotnet.
es: canalización de prueba de dotnet.
fr: canal de test dotnet.
it: pipe di test dotnet.
ja: dotnet テスト パイプ。
ko: .NET 테스트 파이프입니다.
pl: potok testu dotnet.
pt_br: pipe de teste dotnet.
ru: тестовый канал dotnet.
tr: dotnet test kanalı.
zh_hans: dotnet 测试管道。
zh_hant: dotnet 測試管道。

# PlatformCommandLineExitOnProcessExitInvalidDependentProcess
source: Invalid PID '{0}' {1}
cs: Neplatný identifikátor PID „{0}“ {1}
de: Ungültige PID "{0}" {1}
es: PID inválido '{0}' {1}
fr: PID incorrect « {0} » {1}
it: PID non valido '{0}' {1}
ja: PID '{0}' が無効です {1}
ko: 잘못된 PID '{0}' {1}
pl: Nieprawidłowy identyfikator PID „{0}” {1}
pt_br: PID inválido "{0}" {1}
ru: Недопустимый PID "{0}" {1}
tr: Geçersiz PID '{0}' {1}
zh_hans: 无效的 PID“{0}” {1}
zh_hant: 無效的 PID '{0}' {1}

# PlatformCommandLineExitOnProcessExitOptionDescription
source: Exit the test process if dependent process exits. PID must be provided.
cs: Pokud se závislý proces ukončí, ukončete testovací proces. Je nutné zadat identifikátor PID.
de: Beenden Sie den Testprozess, wenn der abhängige Prozess beendet ist. Die PID muss angegeben werden.
es: Salir del proceso de prueba si el proceso dependiente se cierra. Se debe proporcionar el PID.
fr: Quitter le processus de test si le processus dépendant quitte. Vous devez indiquer le PID.
it: Esci dal processo di test se il processo dipendente viene chiuso. È necessario specificare il PID.
ja: 依存プロセスが終了した場合は、テスト プロセスを終了します。PID を指定する必要があります。
ko: 종속 프로세스가 종료되면 테스트 프로세스를 종료합니다. PID를 제공해야 합니다.
pl: Zakończ proces testowy, jeśli proces zależny zostanie zakończony. Należy podać identyfikator PID.
pt_br: Sair do processo de teste se o processo dependente for encerrado. O PID deve ser fornecido.
ru: Выход из тестового процесса при выходе зависимого процесса. Необходимо указать PID.
tr: Bağımlı işlemden çıkılıyorsa test işleminden çıkın. PID sağlanmalıdır.
zh_hans: 如果从属进程退出，则退出测试进程。必须提供 PID。
zh_hant: 如果相依流程結束，則結束測試流程。必須提供 PID。

# PlatformCommandLineExitOnProcessExitSingleArgument
source: '--{0}' expects a single int PID argument
cs: „ --{0}“ očekává jeden argument int PID.
de: "--{0}" erwartet ein einzelnes int-PID-Argument.
es: '--{0}' espera un único argumento PID entero
fr: « --{0} » attend un seul argument PID int
it: '--{0}' prevede un singolo argomento PID int
ja: '--{0}' には 1 つの int PID 引数が必要です
ko: '--{0}'에는 단일 int PID 인수가 필요합니다.
pl: „--{0}” oczekuje pojedynczego argumentu int identyfikatora PID
pt_br: "--{0}" espera um único argumento int PID
ru: "--{0}" ожидает один аргумент int PID
tr: '--{0}', tek bir int PID bağımsız değişkeni bekliyor
zh_hans: “--{0}”需要单个 int PID 参数
zh_hant: '--{0}' 需要單一 int PID 引數

# PlatformCommandLineHelpOptionDescription
source: Show the command line help.
cs: Umožňuje zobrazit nápovědu příkazového řádku.
de: Zeigen Sie die Hilfe zur Befehlszeile an.
es: Muestre la ayuda de la línea de comandos.
fr: Afficher l’aide de la ligne de commande.
it: Mostra la Guida della riga di comando.
ja: コマンド ラインヘルプを表示します。
ko: 명령줄 도움말을 표시합니다.
pl: Pokaż pomoc wiersza polecenia.
pt_br: Mostrar a ajuda da linha de comando.
ru: Показать справку по командной строке.
tr: Komut satırı yardımını gösterir.
zh_hans: 显示命令行帮助。
zh_hant: 顯示命令列說明。

# PlatformCommandLineIgnoreExitCodeOptionDescription
source: Do not report non successful exit value for specific exit codes (e.g. '--ignore-exit-code 8;9' ignore exit code 8 and 9 and will return 0 in these case)
cs: Neohlašujte neúspěšnou ukončovací hodnotu pro konkrétní ukončovací kódy (např. „--ignore-exit-code 8; 9“ ignoruje ukončovací kód 8 a 9 a v takovém případě vrátí hodnotu 0.)
de: Nicht erfolgreichen Beendigungswert für bestimmte Exitcodes nicht melden (Beispiel: "--ignore-exit-code 8; 9' ignoriert Exitcode 8 und 9 und gibt in diesem Fall 0 zurück)
es: No notificar el valor de salida no correcto para códigos de salida específicos (por ejemplo, '--ignore-exit-code 8; 9' omitir código de salida 8 y 9 y devolverá 0 en este caso)
fr: Ne signalez pas de valeur de sortie non réussie pour des codes de sortie spécifiques (par exemple, « --ignore-exit-code 8 ; 9 » ignorent les codes de sortie 8 et 9 et retournent 0 dans ce cas)
it: Non segnalare un valore di uscita non riuscito per codici di uscita specifici (ad esempio '--ignore-exit-code 8;9' ignora il codice di uscita 8 e 9 e restituirà 0 in questo caso)
ja: 特定の終了コードの成功しなかった終了値を報告しない (例: '--ignore-exit-code 8;9' は終了コード 8 および 9 を無視し、これらの場合は 0 を返します)
ko: 특정 종료 코드에 대해 실패한 종료 값을 보고하지 마세요. (예: '--ignore-exit-code 8;9'는 종료 코드 8 및 9를 무시하고 이 경우 0을 반환합니다.)
pl: Nie zgłaszaj wartości zakończenia zakończonego niepowodzeniem dla określonych kodów zakończenia (np. „--ignore-exit-code 8; 9” ignoruje kod zakończenia 8 i 9 i zwróci wartość 0 w tym przypadku)
pt_br: Não relatar valor de saída não bem-sucedido para códigos de saída específicos (por exemplo, '--ignore-exit-code 8;9' ignora o código de saída 8 e 9 e retornará 0 nesses casos)
ru: Не сообщать о неуспешном значении выхода для определенных кодов выхода (например, "--ignore-exit-code 8;9" игнорирует коды выхода 8 и 9 и в этих случаях возвращает 0)
tr: Belirli çıkış kodları için başarılı olmayan çıkış değerini raporlamayın (ör. '--ignore-exit-code 8; 9' çıkış kodu 8 ve 9'u yoksayar ve bu durumda 0 döndürür)
zh_hans: 请勿报告特定退出代码的非成功退出值 (例如 "--ignore-exit-code 8;9" 忽略退出代码 8 和 9，在这种情况下将返回 0)
zh_hant: 不要報告特定結束代碼的未成功結束 (例如 '--ignore-exit-code 8;9' 忽略離開代碼 8 和 9，在這些情況下會返回 0)

# PlatformCommandLineInfoOptionDescription
source: Display .NET test application information.
cs: Umožňuje zobrazit informace o testovací aplikaci .NET.
de: Zeigen Sie .NET-Testanwendungsinformationen an.
es: Muestre la información de la aplicación de prueba de .NET.
fr: Afficher les informations de l’application de test .NET.
it: Visualizza le informazioni sull'applicazione di test .NET.
ja: .NET テスト アプリケーション情報を表示します。
ko: .NET 테스트 애플리케이션 정보를 표시합니다.
pl: Wyświetl informacje o aplikacji testowej platformy .NET.
pt_br: Exibir informações do aplicativo de teste do .NET.
ru: Отображение сведений о тестовом приложении .NET.
tr: .NET test uygulaması bilgilerini görüntüler.
zh_hans: 显示 .NET 测试应用程序信息。
zh_hant: 顯示 .NET 測試應用程式資訊。

# PlatformCommandLineMaxFailedTestsOptionDescription
source: Specifies a maximum number of test failures that, when exceeded, will abort the test run.
cs: Určuje maximální počet neúspěšných testů, které při překročení přeruší testovací běh.
de: Gibt die maximale Anzahl von Testfehlern an, bei deren Überschreiten der Testlauf abgebrochen wird.
es: Especifica un número máximo de errores de prueba que, si se superan, anularán la serie de pruebas.
fr: Spécifie le nombre maximal d’échecs de tests qui, lorsqu’ils sont dépassés, abandonnent la série de tests.
it: Specifica un numero massimo di errori di test che, se superati, interromperanno l'esecuzione dei test.
ja: テストの実行を中止するテスト エラーの最大数を指定します。
ko: 테스트 실행을 중단하는 최대 테스트 실패 수를 지정합니다.
pl: Określa maksymalną liczbę niepowodzeń testów, które po przekroczeniu spowoduje przerwanie przebiegu testu.
pt_br: Especifica um número máximo de falhas de teste que, quando excedido, anularão a execução de teste.
ru: Указывает максимальное число сбоев тестов, которые при превышении прервют тестовый запуск.
tr: Aşıldığında test çalıştırmasını durduracak en fazla test hatası sayısını belirtir.
zh_hans: 指定超过测试失败数后将中止测试运行的最大数目。
zh_hant: 指定超過此數目時，測試失敗次數上限會中止測試回合。

# PlatformCommandLineMinimumExpectedTestsIncompatibleDiscoverTests
source: '--list-tests' and '--minimum-expected-tests' are incompatible options
cs: --list-tests a --minimum-expected-tests jsou nekompatibilní možnosti.
de: "--list-tests" und "--minimum-expected-tests" sind inkompatible Optionen.
es: “--list-tests” y “--minimum-expected-tests” son opciones incompatibles
fr: « --list-tests » et « --minimum-expected-tests » sont des options incompatibles
it: '--list-tests' e '--minimum-expected-tests' sono opzioni incompatibili
ja: '--list-tests' と '--minimum-expected-tests' は互換性のないオプションです
ko: '--list-tests' 및 '--minimum-expected-tests'는 호환되지 않는 옵션입니다.
pl: Opcje „--list-tests” i „--minimum-expected-tests” są niezgodne
pt_br: '--list-tests' e '--minimum-expected-tests' são opções incompatíveis
ru: Параметры "--list-tests" и "--minimum-expected-tests" несовместимы
tr: '--list-tests' ve '--minimum-expected-tests' uyumsuz seçenekler
zh_hans: “--list-tests”和“--minimum-expected-tests”是不兼容的选项
zh_hant: '--list-tests' 和 '--minimum-expected-tests' 是不相容的選項

# PlatformCommandLineMinimumExpectedTestsOptionDescription
source: Specifies the minimum number of tests that are expected to run.
cs: Určuje minimální počet testů, jejichž spuštění se očekává.
de: Gibt die Mindestanzahl von Tests an, die ausgeführt werden sollen.
es: Especifica el número mínimo de pruebas que se espera que se ejecuten.
fr: Spécifie le nombre minimal de tests censés s’exécuter.
it: Specifica il numero minimo dei test che si prevede saranno eseguiti.
ja: 実行する必要があるテストの最小数を指定します。
ko: 실행될 것으로 예상되는 최소 테스트 수를 지정합니다.
pl: Określa minimalną liczbę testów, które mają zostać uruchomione.
pt_br: Especifica o número mínimo de testes que devem ser executados.
ru: Указывает минимальное число тестов, которые должны быть запущены.
tr: Çalıştırılması beklenen en düşük test sayısını belirtir.
zh_hans: 指定预期运行的最小测试数。
zh_hant: 指定預期執行的測試數目下限。

# PlatformCommandLineMinimumExpectedTestsOptionSingleArgument
source: '--minimum-expected-tests' expects a single non-zero positive integer value (e.g. '--minimum-expected-tests 10')
cs: --minimum-expected-tests očekává jednu kladnou nenulovou celočíselnou hodnotu (např. --minimum-expected-tests 10).
de: "--minimum-expected-tests" erwartet einen einzelnen positiven ganzzahligen Wert ungleich Null (Beispiel: "--minimum-expected-tests 10")
es: '--minimum-expected-tests' espera un único valor entero positivo distinto de cero (por ejemplo, '--minimum-expected-tests 10')
fr: « --minimum-expected-tests » attend une seule valeur entière positive différente de zéro (par exemple, « --minimum-expected-tests 10 »)
it: '--minimum-expected-tests' prevede un singolo valore intero positivo diverso da zero (ad esempio '--minimum-expected-tests 10')
ja: '--minimum-expected-tests' には、0 以外の正の整数値が 1 つ必要です (例: '--minimum-expected-tests 10')
ko: '--minimum-expected-tests'에는 0이 아닌 단일 양의 정수 값이 필요합니다. (예: '--minimum-expected-tests 10')
pl: Opcja „--minimum-expected-tests” oczekuje pojedynczej niezerowej dodatniej liczby całkowitej (np. „--minimum-expected-tests 10”)
pt_br: '--minimum-expected-tests' espera um único valor inteiro positivo diferente de zero (por exemplo, '--minimum-expected-tests 10')
ru: "--minimum-expected-tests" ожидает единственное ненулевое положительное целое значение (например, "--minimum-expected-tests 10")
tr: '--minimum-expected-tests', sıfır olmayan tek bir pozitif tamsayı değeri bekler (ör. '--minimum-expected-tests 10')
zh_hans: "--minimum-expected-tests" 应有单个非零正整数值 (例如 "--minimum-expected-tests 10")
zh_hant: '--minimum-expected-tests' 需要單一非零的正整數值 (例如 '--minimum-expected-tests 10')

# PlatformCommandLineNoBannerOptionDescription
source: Do not display the startup banner, the copyright message or the telemetry banner.
cs: Nezobrazovat úvodní banner, zprávu o autorských právech ani banner telemetrie
de: Zeigen Sie das Startbanner, die Copyrightmeldung oder das Telemetriebanner nicht an.
es: No muestre el banner de inicio, el mensaje de copyright o el banner de telemetría.
fr: Ne pas afficher la bannière de démarrage, le message de copyright ou la bannière de télémétrie.
it: Non visualizzare il banner di avvio, il messaggio di copyright o il banner di telemetria.
ja: スタートアップ バナー、著作権メッセージ、テレメトリ バナーは表示しないでください。
ko: 시작 배너, 저작권 메시지 또는 원격 분석 배너를 표시하지 마세요.
pl: Nie wyświetlaj baneru startowego, komunikatu o prawach autorskich ani transparentu telemetrii.
pt_br: Não exiba a faixa de inicialização, a mensagem de direitos autorais ou a faixa de telemetria.
ru: Не отображать баннер запуска, сообщение об авторских правах и баннер телеметрии.
tr: Başlangıç başlığını, telif hakkı iletisini veya telemetri başlığını görüntülemez.
zh_hans: 请勿显示启动横幅、版权信息或遥测横幅。
zh_hant: 不要顯示啟動橫幅、著作權訊息或遙測橫幅。

# PlatformCommandLinePortOptionDescription
source: Specify the port of the server.
cs: Zadejte port serveru.
de: Geben Sie den Port des Servers an.
es: Especifique el puerto del servidor.
fr: Spécifier le port du serveur.
it: Specifica la porta del server.
ja: サーバーのポートを指定します。
ko: 서버의 포트를 지정합니다.
pl: Określ port serwera.
pt_br: Especifique a porta do servidor.
ru: Укажите порт сервера.
tr: Sunucunun bağlantı noktasını belirtir.
zh_hans: 指定服务器的端口。
zh_hant: 指定伺服器的連接埠。

# PlatformCommandLinePortOptionSingleArgument
source: '--{0}' expects a single valid port as argument
cs: --{0} očekává jako argument jeden platný port.
de: "--{0}" erwartet einen einzelnen gültigen Port als Argument.
es: “--{0}” espera un único puerto válido como argumento
fr: « --{0} » attend un seul port valide comme argument
it: '--{0}' prevede una singola porta valida come argomento
ja: '--{0}' には、引数として有効なポートが 1 つ必要です
ko: '--{0}'에는 단일 유효한 포트가 인수로 필요합니다.
pl: Opcja „--{0}” oczekuje pojedynczego prawidłowego portu jako argumentu
pt_br: '--{0}' espera uma única porta válida como argumento
ru: "--{0}" ожидает в качестве аргумента один допустимый порт
tr: '--{0}' bağımsız değişken olarak tek bir geçerli bağlantı noktası bekler
zh_hans: “--{0}”应有单一有效端口作为参数
zh_hant: '--{0}' 需要單一有效的連接埠做為引數

# PlatformCommandLineProviderDescription
source: Microsoft Testing Platform command line provider
cs: Zprostředkovatel příkazového řádku Microsoft Testing Platform
de: Befehlszeilenanbieter für Microsoft Testing Platform
es: Proveedor de línea de comandos de la plataforma de pruebas de Microsoft
fr: Fournisseur de ligne de commande de la plateforme de test Microsoft
it: Provider della riga di comando di Microsoft Testing Platform
ja: Microsoft テスト プラットフォーム コマンド ライン プロバイダー
ko: Microsoft 테스팅 플랫폼 명령줄 공급자
pl: Dostawca wiersza polecenia platformy testowania firmy Microsoft
pt_br: Provedor de linha de comando da Plataforma de Teste da Microsoft
ru: Поставщик командной строки платформы тестирования Майкрософт
tr: Microsoft Testing Platform komut satırı sağlayıcısı
zh_hans: Microsoft 测试平台命令行提供程序
zh_hant: Microsoft Testing Platform 命令列提供者

# PlatformCommandLineProviderDisplayName
source: Platform command line provider
cs: Zprostředkovatel příkazového řádku platformy
de: Plattformbefehlszeilenanbieter
es: Proveedor de línea de comandos de la plataforma
fr: Fournisseur de ligne de commande de la plateforme
it: Provider della riga di comando della piattaforma
ja: プラットフォーム コマンド ライン プロバイダー
ko: 플랫폼 명령줄 공급자
pl: Dostawca wiersza polecenia platformy
pt_br: Provedor de linha de comando da plataforma
ru: Поставщик командной строки платформы
tr: Platform komut satırı sağlayıcısı
zh_hans: 平台命令行提供程序
zh_hant: 平台命令列提供者
