Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HelpNoExtensionRegistered
source: No extension registered.
cs: Není zaregistrované žádné rozšíření.
de: Keine Erweiterung registriert.
es: No hay ninguna extensión registrada.
fr: Aucune extension inscrite.
it: Nessuna estensione registrata.
ja: 拡張機能が登録されていません。
ko: 등록된 확장이 없습니다.
pl: Nie zarejestrowano żadnego rozszerzenia.
pt_br: Nenhuma extensão registrada.
ru: Расширение не зарегистрировано.
tr: Kayıtlı uzantı yok.
zh_hans: 未注册任何扩展。
zh_hant: 未註冊任何延伸模組。

# HelpOptions
source: Options:
cs: Parametry:
de: Optionen:
es: Opciones:
it: Opzioni:
ja: オプション:
ko: 옵션:
pl: Opcje:
pt_br: Opções:
ru: Параметры:
tr: Seçenekler:
zh_hans: 选项:
zh_hant: 選項:

# HelpTestApplicationRunner
source: <test application runner>
cs: <spouštěč testovací aplikace>
ja: <テスト アプリケーション ランナー>
ko: <테스트 애플리케이션 실행기>
ru: <проверка средства выполнения тестов приложения>
tr: <test uygulama çalıştırıcısı>
zh_hant: <測試應用程式執行器>

# InProcessArtifactsProduced
source: In process file artifacts produced:
cs: Vytvořené artefakty souboru v procesu:
de: In Bearbeitung Dateiartefakte erstellt:
es: Artefactos de archivo en proceso producidos:
fr: Artéfacts produits dans les dossiers en cours de traitement :
it: Artefatti file in fase di elaborazione prodotti:
ja: インプロセスのファイル成果物が生成されました:
ko: 생성된 In process 파일 아티팩트:
pl: Wygenerowane artefakty pliku w trakcie procesu:
pt_br: Artefatos de arquivo de processo produzidos:
ru: Созданные в процессе артефакты файлов:
tr: Üretilen işlem içi dosya yapıtları:
zh_hans: 生成的进程内文件项目:
zh_hant: 產生的流程内檔案成品：

# InternalLoopAsyncDidNotExitSuccessfullyErrorMessage
source: Method '{0}' did not exit successfully
cs: Metoda {0} nebyla úspěšně ukončena.
de: Die Methode "{0}" wurde nicht erfolgreich beendet
es: El método '{0}' no se cerró correctamente
fr: La méthode « {0} » ne s’est pas arrêtée correctement
it: Il metodo '{0}' non è stato chiuso correttamente
ja: メソッド '{0}' が正常に終了しませんでした
ko: '{0}' 메서드가 성공적으로 종료되지 않았습니다.
pl: Metoda „{0}” nie zakończyła się pomyślnie
pt_br: O método “{0}” não foi encerrado com êxito
ru: Сбой выхода метода "{0}"
tr: '{0}' yöntemi başarıyla çıkmadı
zh_hans: 方法“{0}”未成功退出
zh_hant: 方法 '{0}' 未成功結束

source: Invalid command line arguments:
cs: Neplatné argumenty příkazového řádku:
de: Ungültige Befehlszeilenargumente:
es: Argumentos de línea de comandos no válidos:
fr: Arguments de ligne de commande non valides :
it: Argomenti della riga di comando non validi:
ja: コマンド ラインの引数が無効です:
ko: 잘못된 명령줄 인수:
pl: Nieprawidłowe argumenty wiersza polecenia:
pt_br: Argumentos de linha de comando inválidos:
ru: Недопустимые аргументы командной строки:
tr: Geçersiz komut satırı bağımsız değişkenleri:
zh_hans: 无效的命令行参数:
zh_hant: 命令列引數無效:

# JsonConfigurationFileParserDuplicateKeyErrorMessage
source: A duplicate key '{0}' was found
cs: Našel se duplicitní klíč {0}.
de: Es wurde ein doppelter Schlüssel "{0}" gefunden.
es: Se encontró una clave duplicada '{0}'
fr: Une clé dupliquée « {0} » a été trouvée.
it: È stata trovata una chiave '{0}' duplicata.
ja: 重複したキー '{0}' が見つかりました
ko: 중복 키('{0}')를 찾았습니다.
pl: Znaleziono zduplikowany klucz „{0}”
pt_br: Uma chave duplicada "{0}"foi encontrada.
ru: Найден повторяющийся ключ "{0}"
tr: '{0}' adlı bir yinelenen anahtar bulundu
zh_hans: 发现重复的键“{0}”
zh_hant: 找到重複的金鑰 '{0}'

# JsonConfigurationFileParserTopLevelElementIsNotAnObjectErrorMessage
source: Top-level JSON element must be an object. Instead, '{0}' was found
cs: Element JSON nejvyšší úrovně musí být objekt. Místo toho bylo nalezeno: {0}.
de: Das JSON-Element der obersten Ebene muss ein Objekt sein. Stattdessen wurde "{0}" gefunden.
es: El elemento JSON de nivel superior debe ser un objeto. En su lugar, se encontró '{0}'
fr: L’élément JSON de niveau supérieur doit être un objet. Au lieu de cela, «{0}{0} » a été trouvé
it: L'elemento JSON di primo livello deve essere un oggetto. È stato invece trovato '{0}'
ja: 最上位の JSON 要素はオブジェクトである必要があります。代わりに、'{0}' が見つかりました
ko: 최상위 JSON 요소는 개체여야 합니다. 대신 '{0}'을(를) 찾았습니다.
pl: Element JSON najwyższego poziomu musi być obiektem. Zamiast tego znaleziono element „{0}”
pt_br: O elemento JSON de nível superior deve ser um objeto. Em vez disso, "{0}" foi encontrado
ru: Элемент JSON верхнего уровня должен быть объектом. Вместо этого обнаружено "{0}"
tr: Üst düzey JSON öğesi bir nesne olmalıdır. Bunun yerine '{0}' bulundu
zh_hans: 顶级 JSON 元素必须是对象。但是找到了“{0}”
zh_hant: 頂層 JSON 元素必須是物件。反而找到 '{0}'

# JsonConfigurationFileParserUnsupportedTokenErrorMessage
source: Unsupported JSON token '{0}' was found
cs: Našel se nepodporovaný token JSON {0}.
de: Es wurde ein nicht unterstütztes JSON-Token "{0}" gefunden.
es: Se encontró un token JSON '{0}' no admitido
fr: Le jeton JSON «{0}{0} » non pris en charge a été trouvé
it: Trovato token JSON '{0}' non supportato
ja: サポートされていない JSON トークン '{0}' が見つかりました
ko: 지원되지 않는 JSON 토큰('{0}')을 발견했습니다.
pl: Znaleziono nieobsługiwany token JSON „{0}”
pt_br: O token JSON "{0}" sem suporte foi encontrado
ru: Найден неподдерживаемый маркер JSON "{0}"
tr: Desteklenmeyen JSON belirteci '{0}' bulundu
zh_hans: 找到不受支持的 JSON 令牌“{0}”
zh_hant: 找到不支援的 JSON 權杖 '{0}'

# JsonRpcTcpServerDescription
source: JsonRpc server implementation based on the test platform protocol specification.
cs: Implementace serveru JsonRpc na základě specifikace protokolu testovací platformy
de: JsonRpc-Serverimplementierungen basierend auf der Protokollspezifikation der Testplattform.
es: Implementación del servidor JsonRpc basada en la especificación del protocolo de la plataforma de pruebas.
fr: Implémentation du serveur JsonRpc basée sur la spécification du protocole de plateforme de test.
it: Implementazione del server JsonRpc in base alla specifica del protocollo della piattaforma di test.
ja: テスト プラットフォーム プロトコル仕様に基づく JsonRpc サーバー実装。
ko: 테스트 플랫폼 프로토콜 사양을 기반으로 하는 JsonRpc 서버 구현입니다.
pl: Implementacja serwera JsonRpc na podstawie specyfikacji protokołu platformy testowej.
pt_br: Implementação do servidor JsonRpc com base na especificação do protocolo da plataforma de teste.
ru: Реализация сервера JsonRpc на основе спецификации протокола платформы тестирования.
tr: Test platformu protokol belirtimine dayalı JsonRpc sunucu uygulaması.
zh_hans: 基于测试平台协议规范的 JsonRpc 服务器实现。
zh_hant: 根據測試平台通訊協定規格的 JsonRpc 伺服器實作。

# JsonRpcTcpServerToSingleClientDescription
source: JsonRpc server to client handshake, implementation based on the test platform protocol specification.
cs: Handshake mezi klientem a serverem JsonRpc, implementace na základě specifikace protokolu testovací platformy
de: JsonRpc-Server-zu-Client-Handshake, Implementierungen basierend auf der Protokollspezifikation der Testplattform.
es: Implementación del protocolo de enlace de servidor a cliente JsonRpc basada en la especificación del protocolo de la plataforma de pruebas.
fr: Établissement d’une liaison entre le serveur et le client JsonRpc, implémentation basée sur la spécification du protocole de la plateforme de test.
it: Handshake da server JsonRpc a client, implementazione basata sulla specifica del protocollo della piattaforma di test.
ja: テスト プラットフォーム プロトコル仕様に基づく JsonRpc サーバーからクライアント ハンドシェイクへの実装。
ko: 테스트 플랫폼 프로토콜 사양을 기반으로 구현되는 JsonRpc 서버와 클라이언트의 핸드셰이크입니다.
pl: Serwer JsonRpc do uzgadniania klienta, implementacja oparta na specyfikacji protokołu platformy testowej.
pt_br: Handshake de servidor JsonRpc para cliente, implementação baseada na especificação do protocolo da plataforma de teste.
ru: Рукопожатие сервера JsonRpc с клиентом, реализация на основе спецификации протокола платформы тестирования.
tr: JsonRpc sunucusundan istemciye el sıkışması, test platformu protokol belirtimine dayalı uygulama.
zh_hans: 基于测试平台协议规范的 JsonRpc 服务器到客户端握手实现。
zh_hant: JsonRpc 伺服器至用戶端交握，根據測試平台通訊協定規格的 JsonRpc 伺服器實作。

# LoggerFactoryNotReady
source: The ILoggerFactory has not been built yet.
cs: Rozhraní ILoggerFactory ještě nebylo sestaveno.
de: Die ILoggerFactory wurde noch nicht erstellt.
es: ILoggerFactory aún no se ha compilado.
fr: ILoggerFactory n’a pas encore été généré.
it: ILoggerFactory non è stato ancora compilato.
ja: ILoggerFactory はまだ構築されていません。
ko: ILoggerFactory가 아직 빌드되지 않았습니다.
pl: Obiekt ILoggerFactory nie został jeszcze skompilowany.
pt_br: O ILoggerFactory ainda não foi criado.
ru: Параметр ILoggerFactory еще не создан.
tr: ILoggerFactory henüz derlenmedi.
zh_hans: 尚未生成 ILoggerFactory。
zh_hant: 尚未建置 ILoggerFactory。

# MaxFailedTestsMustBePositive
source: The option '--maximum-failed-tests' must be a positive integer. The value '{0}' is not valid.
cs: Možnost --maximum-failed-tests musí být kladné celé číslo. Hodnota '{0}' není platná.
de: Die Option "--maximum-failed-tests" muss eine positive ganze Zahl sein. Der Wert '{0}' ist ungültig.
es: La opción '--maximum-failed-tests' debe ser un entero positivo. El valor '{0}' no es válido.
fr: L’option '--maximum-failed-tests' doit être un entier positif. La valeur '{0}' n’est pas valide.
it: L'opzione '--maximum-failed-tests' deve essere un numero intero positivo. Il valore '{0}' non è valido.
ja: オプション '--maximum-failed-tests' は正の整数である必要があります。'{0}' 値が無効です。
ko: '--maximum-failed-tests' 옵션은 양의 정수여야 합니다. '{0}' 값이 잘못되었습니다.
pl: Opcja "--maximum-failed-tests" musi być dodatnią liczbą całkowitą. Wartość '{0}' jest nieprawidłowa.
pt_br: A opção '--maximum-failed-tests' deve ser um inteiro positivo. O valor '{0}' é inválido.
ru: Параметр "--maximum-failed-tests" должен быть положительным целым числом. Недопустимое '{0}' значение.
tr: '--maximum-failed-tests' seçeneği pozitif bir tamsayı olmalıdır. Belirtilen '{0}' geçerli değil.
zh_hans: 选项 “--maximum-failed-tests” 必须是正整数。值 '{0}' 无效。
zh_hant: 選項 '--maximum-failed-tests' 必須是正整數。值 '{0}' 無效。

# MessageBusNotReady
source: The message bus has not been built yet or is no more usable at this stage.
cs: Sběrnice zpráv ještě nebyla sestavena nebo už není v této fázi použitelná.
de: Der Nachrichtenbus wurde noch nicht erstellt oder kann zu diesem Zeitpunkt nicht mehr verwendet werden.
es: El bus de mensajes aún no se ha compilado o ya no se puede usar en esta fase.
fr: Le bus de messages n’a pas encore été généré ou n’est plus utilisable à ce stade.
it: Il bus di messaggi non è stato ancora compilato o non è più utilizzabile in questa fase.
ja: メッセージ バスはまだ構築されていないか、この段階ではこれ以上使用できません。
ko: 메시지 버스가 아직 빌드되지 않았거나 이 단계에서 더 이상 사용할 수 없습니다.
pl: Magistrala komunikatów nie została jeszcze zbudowana lub nie można jej już na tym etapie użyteczna.
pt_br: O barramento de mensagens ainda não foi criado ou não pode mais ser usado nesse estágio.
ru: Шина сообщений еще не построена или на данном этапе непригодна для использования.
tr: İleti veri yolu henüz derlenmedi veya bu aşamada artık kullanılamıyor.
zh_hans: 消息总线尚未生成或在此阶段不再可用。
zh_hant: 訊息匯流排尚未建置或在此階段無法再使用。

# MinimumExpectedTestsPolicyViolation
source: Minimum expected tests policy violation, tests ran {0}, minimum expected {1}
cs: Minimální očekávané porušení zásad testů, spuštěné testy: {0}, očekávané minimum: {1}
de: Mindestens erwartete Testrichtlinienverletzung, {0} Tests wurden ausgeführt, mindestens erwartet: {1}
es: Infracción de directiva de pruebas mínimas esperadas, pruebas ejecutadas {0}, mínimas esperadas {1}
fr: Violation de stratégie de tests minimale attendue, tests exécutés {0}, minimum attendu {1}
it: Violazione minima dei criteri di test previsti, test eseguiti {0}, minimo previsto {1}
ja: 予想されるテストの最小ポリシー違反、テストの実行数 {0} 件、予想される最小数 {1} 件
ko: 예상되는 최소 테스트 정책 위반, 테스트 실행 {0}, 필요한 최소 {1}
pl: Minimalne oczekiwane naruszenie zasad testów, uruchomione testy: {0}, oczekiwane minimum: {1}
pt_br: Violação de política de testes mínimos esperados, {0} testes executados, mínimo esperado {1}
ru: Нарушение политики минимального ожидаемого числа тестов, тесты выполнено: {0}, ожидаемый минимум: {1}
tr: Beklenen minimum test ilke ihlali, yürütülen test: {0}, beklenen minimum test: {1}
zh_hans: 最低预期测试策略冲突，测试已运行 {0} 次，最低预期 {1} 次
zh_hant: 預期測試原則違反的最小值，{0} 個執行的測試，預期的最小值為 {1}

# MissingClientPortFoJsonRpc
source: Expected --client-port when jsonRpc protocol is used.
cs: Při použití protokolu jsonRpc byl očekáván parametr --client-port.
de: "--client-port" wird erwartet, wenn das jsonRpc-Protokoll verwendet wird.
es: Se esperaba --client-port cuando se usa el protocolo jsonRpc.
fr: Attendu --client-port attendu lorsque le protocole jsonRpc est utilisé.
it: Previsto --client-port quando viene usato il protocollo jsonRpc.
ja: jsonRpc プロトコルを使用する場合、--client-port が必要です。
ko: jsonRpc 프로토콜을 사용하는 경우 --client-port가 필요합니다.
pl: Oczekiwano parametru --client-port, gdy jest używany protokół jsonRpc.
pt_br: Esperado --client-port quando o protocolo jsonRpc é usado.
ru: Ожидается --client-port при использовании протокола jsonRpc.
tr: JsonRpc protokolü kullanıldığında --client-port bekleniyordu.
zh_hans: 使用 jsonRpc 协议时应为 --client-port。
zh_hant: 使用 jsonRpc 通訊協定時，必須是 --client-port。

# ActiveTestsRunning_MoreTestsCount
source: and {0} more
cs: a ještě {0}
de: und {0} weitere
es: y {0} más
fr: et {0} de plus
it: e altri {0}
ja: その他 {0} 件
ko: 외 {0}개
pl: i {0} więcej
pt_br: e mais {0}
ru: и еще {0}
tr: ve {0} tane daha
zh_hans: 和其他 {0} 项
zh_hant: 和其他 {0} 個

# ActiveTestsRunning_FullTestsCount
source: {0} tests running
cs: {0} spuštěné testy
de: {0} ausgeführten Tests
es: {0} pruebas en ejecución
fr: {0} tests en cours d’exécution
it: {0} test in esecuzione
ja: {0} テストを実行しています
ko: 실행 중인 테스트 {0}
pl: testy {0} uruchomione
pt_br: {0} testes em execução
ru: {0} тестов
tr: {0} test çalıştırılıyor
zh_hans: 正在运行 {0} 测试
zh_hant: 正在執行 {0} 測試

# NoSerializerRegisteredWithIdErrorMessage
source: No serializer registered with ID '{0}'
cs: Není zaregistrovaný žádný serializátor s ID {0}.
de: Es ist kein Serialisierungsmodul mit der ID "{0}" registriert
es: No hay ningún serializador registrado con el id. '{0}'
fr: Aucun sérialiseur inscrit avec l’ID « {0} »
it: Nessun serializzatore registrato con ID '{0}'
ja: ID '{0}' で登録されたシリアライザーがありません
ko: ID '{0}'(으)로 등록된 직렬 변환기가 없습니다.
pl: Nie zarejestrowano serializatora z identyfikatorem „{0}”
pt_br: Nenhum serializador registrado com a ID “{0}”
ru: Не зарегистрирован сериализатор с ИД "{0}"
tr: '{0}' kimliğiyle kayıtlı seri hale getirici yok
zh_hans: 没有使用 ID“{0}”注册序列化程序
zh_hant: 沒有使用識別碼 '{0}' 註冊的序列化程式

# NoSerializerRegisteredWithTypeErrorMessage
source: No serializer registered with type '{0}'
cs: Není zaregistrovaný žádný serializátor s typem {0}.
de: Es ist kein Serialisierungsmodul mit dem Typ "{0}" registriert
es: No hay ningún serializador registrado con el tipo '{0}'
fr: Aucun sérialiseur inscrit avec le type « {0} »
it: Nessun serializzatore registrato con tipo '{0}'
ja: 型 '{0}' で登録されたシリアライザーがありません
ko: '{0}' 형식으로 등록된 직렬 변환기가 없습니다.
pl: Nie zarejestrowano serializatora z typem „{0}”
pt_br: Nenhum serializador registrado com o tipo “{0}”
ru: Не зарегистрирован сериализатор с типом "{0}"
tr: '{0}' türüyle kayıtlı seri hale getirici yok
zh_hans: 没有使用类型“{0}”注册序列化程序
zh_hant: 沒有使用類型 '{0}' 註冊的序列化程式

source: Not available
cs: Není k dispozici
de: Nicht verfügbar
es: No disponible
fr: Non disponible
it: Non disponibile
ja: 利用できません
ko: 사용할 수 없음
pl: Niedostępne
pt_br: Não disponível
ru: Недоступно
tr: Kullanılamıyor
zh_hans: 不可用
zh_hant: 無法使用

source: Not found
cs: Nenalezeno
de: Nicht gefunden
es: No se encontró
fr: Introuvable
it: Non trovato
ja: 見つかりません
ko: 찾을 수 없음
pl: Nie znaleziono
pt_br: Não encontrado
ru: Не найдено
tr: Bulunamadı
zh_hans: 未找到
zh_hant: 找不到

# OutOfProcessArtifactsProduced
source: Out of process file artifacts produced:
cs: Vytvořené artefakty souboru mimo proces:
de: Nicht verarbeitete Dateiartefakte erstellt:
es: Artefactos de archivo fuera de proceso producidos:
fr: Artefacts de fichier hors processus produits :
it: Artefatti file non in elaborazione prodotti:
ja: アウトプロセスのファイル成果物が生成されました:
ko: 생성된 Out of process 파일 아티팩트:
pl: Wygenerowane artefakty pliku poza procesem:
pt_br: Artefatos de arquivo fora do processo produzidos:
ru: Созданные вне процесса артефакты файлов:
tr: Üretilen işlem dışı dosya yapıtları:
zh_hans: 生成的进程外文件项目:
zh_hant: 產生的流程外檔案成品：

source: Passed
cs: Úspěšné
de: Bestanden
es: Correcta
fr: Réussite
it: Superato
ja: 成功
ko: 통과
pl: Powodzenie
pt_br: Aprovado
ru: Пройден
tr: Başarılı
zh_hans: 已通过
zh_hant: 成功

# PassedLowercase
source: passed
cs: úspěch
de: erfolgreich
es: correcto
fr: réussite
it: superato
ja: 合格しました
ko: 통과
pl: zakończone powodzeniem
pt_br: aprovado
ru: пройдено
tr: başarılı
zh_hans: 已通过
zh_hant: 已通過

# PlatformCommandLineClientHostOptionDescription
source: Specify the hostname of the client.
cs: Zadejte název hostitele klienta.
de: Geben Sie den Hostnamen des Clients an.
es: Especifique el nombre de host del cliente.
fr: Spécifier le nom d’hôte du client.
it: Specifica il nome host del client.
ja: クライアントのホスト名を指定します。
ko: 클라이언트의 호스트 이름을 지정합니다.
pl: Określ nazwę hosta klienta.
pt_br: Especifique o nome do host do cliente.
ru: Укажите имя узла клиента.
tr: İstemcinin ana bilgisayar adını belirtir.
zh_hans: 指定客户端的主机名。
zh_hant: 指定用戶端的主機名稱。

# PlatformCommandLineClientPortOptionDescription
source: Specify the port of the client.
cs: Zadejte port klienta.
de: Geben Sie den Port des Clients an.
es: Especifique el puerto del cliente.
fr: Spécifier le port du client.
it: Specifica la porta del client.
ja: クライアントのポートを指定します。
ko: 클라이언트의 포트를 지정합니다.
pl: Określ port klienta.
pt_br: Especifique a porta do cliente.
ru: Укажите порт клиента.
tr: İstemcinin bağlantı noktasını belirtir.
zh_hans: 指定客户端的端口。
zh_hant: 指定用戶端的連接埠。

# PlatformCommandLineConfigFileOptionDescription
source: Specifies a testconfig.json file.
cs: Určuje soubor testconfig.json.
de: Gibt eine testconfig.json-Datei an.
es: Especifica un archivo testconfig.json.
fr: Spécifie un fichier testconfig.json.
it: Specifica un file testconfig.json.
ja: testconfig.json ファイルを指定します。
ko: testconfig.json 파일을 지정합니다.
pl: Określa plik testconfig.json.
pt_br: Especifica um arquivo testconfig.json.
ru: Указывает файл testconfig.json.
tr: testconfig.json dosyası belirtir.
zh_hans: 指定 testconfig.json 文件。
zh_hant: 指定 testconfig.json 檔案。

# PlatformCommandLineDiagnosticFileLoggerSynchronousWriteOptionDescription
source: Force the built-in file logger to write the log synchronously. Useful for scenario where you don't want to lose any log (i.e. in case of crash). Note that this is slowing down the test execution.
cs: Umožňuje vynutit synchronní zápis do protokolu integrovaným protokolovacím nástrojem souborů. Užitečné pro scénář, kdy nechcete přijít o žádný protokol (například v případě chybového ukončení). Poznámka: Toto zpomaluje provádění testu.
de: Erzwingen Sie, dass die integrierte Dateiprotokollierung das Protokoll synchron schreibt. Nützlich für Szenarien, in denen Sie keine Protokolle verlieren möchten (z. B. im Fall eines Absturzes). Beachten Sie, dass die Testausführung dadurch verlangsamt wird.
es: Fuerce al registrador de archivos integrado a escribir el registro de forma sincrónica. Resulta útil para escenarios en los que no quiere perder ningún registro (es decir, en caso de bloqueo). Tenga en cuenta que esto ralentiza la ejecución de pruebas.
fr: Forcer l’enregistreur d’événements de fichiers intégré à écrire le journal de manière synchrone. Utile pour les scénarios où vous ne voulez pas perdre de journal (c’est-à-dire en cas d’incident). Notez que cela ralentit l’exécution du test.
it: Forzare il logger di file predefinito per scrivere il log in modo sincrono. Utile per uno scenario in cui non si desidera perdere alcun log, ad esempio in caso di arresto anomalo. Tenere presente ciò rallenta l'esecuzione del test.
ja: 組み込みのファイル ロガーでログを同期的に書き込むことを強制します。 ログを失わないシナリオ (クラッシュした場合など) に役立ちます。 これにより、テストの実行速度が低下していることに注意してください。
ko: 기본 제공 파일 로거가 로그를 동기적으로 쓰도록 강제합니다. 로그를 잃지 않으려는 시나리오(예: 충돌하는 경우)에 유용합니다. 이로 인해 테스트 실행 속도가 느려집니다.
pl: Wymuś synchroniczne zapisywanie dziennika przez wbudowany rejestrator plików. Przydatne w przypadku scenariusza, w którym nie chcesz utracić żadnego dziennika (tj. w przypadku awarii). Pamiętaj, że to spowalnia wykonywanie testu.
pt_br: Forçar o agente de arquivos interno a gravar o log de forma síncrona. Útil para cenários em que não se deseja perder nenhum registro (ou seja, em caso de falha). Observe que isso está diminuindo a execução do teste.
ru: Принудительная синхронная запись журнала с помощью встроенного средства ведения журнала файла. Удобно для сценария, в котором вы не хотите потерять журнал (например, в случае сбоя). Обратите внимание, что это замедляет выполнение теста.
tr: Yerleşik dosya kaydediciyi günlüğü eşzamanlı olarak yazmaya zorlar. Herhangi bir günlüğü (kilitlenme durumunda) kaybetmek istemediğiniz senaryolar için faydalıdır. Bunun test yürütmesini yavaşlatacağını unutmayın.
zh_hans: 强制内置文件记录器同步写入日志。 适用于不想丢失任何日志的情况(即在故障的情况下)。 请注意，这会减慢测试的执行速度。
zh_hant: 強制內建檔案記錄器以同步方式寫入記錄。 適用於不想遺失任何記錄的案例 (例如損毀)。 請注意，這會減慢測試執行的速度。

# PlatformCommandLineDiagnosticOptionDescription
source: Enable the diagnostic logging. The default log level is 'Trace'. The file will be written in the output directory with the name log_[yyMMddHHmmssfff].diag
cs: Umožňuje povolit protokolování diagnostiky. Výchozí úroveň protokolování je Trace. Soubor se zapíše do výstupního adresáře s názvem log_[yyMMddHHmmssfff].diag.
de: Aktivieren Sie die Diagnoseprotokollierung. Die Standardprotokollebene ist „Ablaufverfolgung“. Die Datei wird im Ausgabeverzeichnis mit dem Namen „log_[yyMMddHHmmssfff].diag“ geschrieben.
es: Habilite el registro de diagnóstico. El nivel de registro predeterminado es "Seguimiento". El archivo se escribirá en el directorio de salida con el nombre log_[yyMMddHHmmssfff].diag
fr: Activer la journalisation des diagnostics. Le niveau de consignation par défaut est « Trace ». Le fichier sera écrit dans le répertoire de sortie avec le nom log_[yyMMddHmmssfff].diag
it: Abilita la registrazione diagnostica. Il livello di registro per impostazione predefinita è ''Traccia''. Il file verrà scritto nella directory di output con il nome log_[yyMMddHHmmssfff].diag
ja: 診断ログを有効にします。既定のログ レベルは 'Trace' です。 ファイルは、出力ディレクトリに log_[yyMMddHHmmssfff].diag という名前で書き込まれます。
ko: 진단 로깅을 사용합니다. 기본 로그 수준은 'Trace'입니다. 파일은 log_[yyMMddHHmmssfff].diag라는 이름으로 출력 디렉터리에 기록됩니다.
pl: Włącz rejestrowanie diagnostyczne. Domyślny poziom dziennika to „Śledzenie”. Plik zostanie zapisany w katalogu wyjściowym o nazwie log_[yyMMddHHmmssfff].diag
pt_br: Habilite o registro de diagnóstico. O nível de log padrão é 'Rastreio'. O arquivo será gravado no diretório de saída com o nome log_[yyMMddHHmmssfff].diag
ru: Включить ведение журнала диагностики. Уровень журнала по умолчанию — "Трассировка". Файл с именем log_[yyMMddHHmmssfff].diag будет записан в выходной каталог
tr: Tanılama günlük kaydını etkinleştirir. Varsayılan günlük düzeyi: 'İzleme'. Dosya, çıkış dizinine log_[yyMMddHHmmssfff].diag adıyla yazılır
zh_hans: 启用诊断日志记录。默认日志级别为 "Trace"。 文件将写入输出目录，名称为 log_[yyMMddHHmmssfff].diag
zh_hant: 啟用診斷記錄。預設記錄層級為 'Trace'。 檔案將以 log_[yyMMddHHmmssfff].diag 名稱寫入輸出目錄中
