Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CommandLineParserUnexpectedArgument
source: Unexpected argument {0}
cs: Neočekávaný argument {0}
de: Unerwartetes Argument {0}
es: Argumento inesperado {0}
fr: Arguments inattendue {0}
it: Argomento imprevisto {0}
ja: 予期しない引数 {0}
ko: 예기치 않은 인수 {0}
pl: Nieoczekiwany argument {0}
pt_br: Argumento inesperado {0}
ru: Неожиданный аргумент {0}
tr: {0} bağımsız değişkeni beklenmiyordu
zh_hans: 意外的参数 {0}
zh_hant: 未預期的引數 {0}

# CommandLineParserUnexpectedNullArgument
source: Unexpected null argument at index {0}
cs: Neočekávaný argument null v indexu {0}
de: Unerwartetes NULL-Argument bei Index {0}
es: Argumento nulo inesperado en el índice {0}
fr: Argument null inattendu à l’index de recherche{0}
it: Argomento Null imprevisto in corrispondenza dell'indice {0}
ja: インデックス {0} に予期しない null 引数があります
ko: 인덱스 {0}에 예기치 않은 null 인수가 있습니다.
pl: Nieoczekiwany argument o wartości null przy indeksie {0}
pt_br: Argumento nulo inesperado no índice {0}
ru: Неожиданный аргумент, имеющий значение NULL, с индексом {0}
tr: {0} dizinindeki null bağımsız değişken beklenmiyordu
zh_hans: 索引 {0} 处出现意外 null 参数
zh_hant: 索引 {0} 中有未預期的 Null 引數

# CommandLineParserUnexpectedSingleQuoteInArgument
source: Unexpected single quote in argument: {0}
cs: Neočekávaná jednoduchá uvozovka v argumentu: {0}
de: Unerwartetes einfaches Anführungszeichen im Argument: {0}
es: Comilla simple inesperada en el argumento: {0}
fr: Guillemet simple inattendu dans l’argument : {0}
it: Virgolette singole impreviste nell'argomento: {0}
ja: 引数に予期しない単一引用符が含まれています: {0}
ko: 인수 {0}에 예기치 않은 작은따옴표가 있습니다.
pl: Nieoczekiwany pojedynczy cudzysłów w argumencie: {0}
pt_br: Aspas simples inesperadas no argumento: {0}
ru: Неожиданная одинарная кавычка в аргументе: {0}
tr: {0} bağımsız değişkeninde tek alıntı beklenmiyor
zh_hans: 参数中出现意外的单引号: {0}
zh_hant: 引數 {0} 中有未預期的單引號

# CommandLineParserUnexpectedSingleQuoteInArgumentForOption
source: Unexpected single quote in argument: {0} for option '--{1}'
cs: Neočekávaná jednoduchá uvozovka v argumentu: {0} pro možnost --{1}
de: Unerwartetes einfaches Anführungszeichen im Argument: {0} für Option "--{1}"
es: Comilla simple inesperada en el argumento: {0} para la opción “--{1}”
fr: Guillemet simple inattendu dans l’argument : {0} pour l’option « --{1} »
it: Virgolette singole impreviste nell'argomento: {0} per l'opzione '--{1}'
ja: 引数に予期しない単一引用符が含まれています: {0} オプション '--{1}' の場合
ko: '-- {1} ' 옵션의 인수 {0}에 예기치 않은 작은따옴표가 있습니다.
pl: Nieoczekiwany pojedynczy cudzysłów w argumencie: {0} dla opcji „--{1}”
pt_br: Aspas simples inesperadas no argumento: {0} para a opção '--{1}'
ru: Неожиданная одинарная кавычка в аргументе: {0} для параметра "--{1}"
tr: {0} bağımsız değişkeninde '--{1}' seçeneği için tek alıntı beklenmiyor
zh_hans: 选项“--{1}”的参数 {0} 中出现意外的单引号
zh_hant: 選項 '--{1}' 的引數 {0} 中有未預期的單引號

# CommandLineUnknownOption
source: Unknown option '--{0}'
cs: Neznámá možnost --{0}
de: Unbekannte Option "--{0}"
es: Opción desconocida “--{0}”
fr: Option « --{0} » inconnue.
it: Opzione sconosciuta: '--{0}'
ja: 不明なオプション: '--{0}'
ko: 알 수 없는 옵션 '--{0}'
pl: Nieznana opcja: „--{0}”
pt_br: Opção desconhecida '--{0}'
ru: Неизвестный параметр "--{0}"
tr: '--{0}' seçeneği bilinmiyor
zh_hans: 未知选项:“--{0}”
zh_hant: 未知的選項 '--{0}'

# CompositeServiceFactoryInstanceAlreadyRegistered
source: The same instance of 'CompositeExtensonFactory' is already registered
cs: Už je zaregistrovaná stejná instance CompositeExtensonFactory.
de: Die gleiche Instanz von "CompositeExtensonFactory" ist bereits registriert
es: La misma instancia de "CompositeExtensonFactory" ya está registrada
fr: La même instance de « CompositeExtensonFactory » est déjà inscrite
it: La stessa istanza di 'CompositeExtensonFactory' è già registrata
ja: 'CompositeExtensonFactory' の同じインスタンスが既に登録されています
ko: 동일한 'CompositeExtensonFactory' 인스턴스가 이미 등록됨
pl: To samo wystąpienie elementu „CompositeExtensonFactory” jest już zarejestrowane
pt_br: A mesma instância de “CompositeExtensonFactory” já está registrada
ru: Такой же экземпляр CompositeExtensonFactory уже зарегистрирован
tr: Aynı 'CompositeExtensonFactory' örneği zaten kayıtlı
zh_hans: “CompositeExtensonFactory”的同一实例已注册
zh_hant: 已註冊 'CompositeExtensonFactory' 的同一執行個體

# ConfigurationFileNotFound
source: The configuration file '{0}' specified with '--config-file' could not be found.
cs: Nebyl nalezen konfigurační soubor {0} zadaný pomocí parametru --config-file.
de: Die mit „--config-file“ angegebene Konfigurationsdatei „{0}“ wurde nicht gefunden.
es: No se ha encontrado el archivo de configuración "{0}" especificado con "--config-file".
fr: Nous n’avons pas pu trouver le fichier de configuration « {0} » spécifié avec « --config-file ».
it: Impossibile trovare il file di configurazione '{0}' specificato con '--config-file'.
ja: '--config-file' で指定された構成ファイル '{0}' が見つかりませんでした。
ko: '--config-file'으로 지정된 구성 파일 '{0}' 찾을 수 없습니다.
pl: Nie można odnaleźć pliku konfiguracji „{0}” określonego za pomocą parametru „--config-file”.
pt_br: Não foi possível encontrar o arquivo de configuração '{0}' especificado com '--config-file'.
ru: Не удалось найти файл конфигурации "{0}", указанный с параметром "--config-file".
tr: '--config-file' ile belirtilen '{0}' yapılandırma dosyası bulunamadı.
zh_hans: 找不到使用 ‘--config-file’ 指定的配置文件“{0}”。
zh_hant: 找不到以 '--config-file' 指定的設定檔 '{0}'。

# ConfigurationManagerCannotFindDefaultJsonConfigurationErrorMessage
source: Could not find the default json configuration
cs: Nepovedlo se najít výchozí konfiguraci json.
de: Die standardmäßige JSON-Konfiguration wurde nicht gefunden.
es: No se pudo encontrar la configuración json predeterminada
fr: Configuration JSON par défaut introuvable
it: Non è stato possibile trovare la configurazione JSON predefinita
ja: 既定の JSON 構成が見つかりませんでした
ko: 기본 json 구성을 찾을 수 없습니다.
pl: Nie można odnaleźć domyślnej konfiguracji JSON
pt_br: Não foi possível localizar a configuração padrão do json
ru: Не удалось найти конфигурацию JSON по умолчанию
tr: Varsayılan JSON yapılandırması bulunamadı
zh_hans: 找不到默认 json 配置
zh_hant: 找不到預設 JSON 設定

# ConnectingToClientHost
source: Connecting to client host '{0}' port '{1}'
cs: Připojování k hostiteli klienta {0}, port{1}
de: Verbindung mit Clienthost "{0}" Port "{1}" wird hergestellt
es: Conectando al host cliente '{0}', puerto '{1}'
fr: Connexion au « {0} » de port « {1} » de l’hôte client
it: Connessione all'host client '{0}' porta '{1}'
ja: クライアント ホスト '{0}' ポート '{1}' に接続しています
ko: 클라이언트 호스트 '{0}' 포트 '{1}'에 연결하는 중
pl: Łączenie z hostem klienta „{0}” na porcie „{1}”
pt_br: Conectando-se ao host do cliente “{0}” porta “{1}”
ru: Подключение к узлу клиента "{0}" к порту "{1}"
tr: '{0}' istemci konak, '{1}' bağlantı noktasına bağlanıyor
zh_hans: 正在连接到客户端主机“{0}”的端口“{1}”
zh_hant: 正在連接到用戶端主機 '{0}' 連接埠 '{1}'

source: Console is already in batching mode.
cs: Konzole je již v režimu dávkování.
de: Die Konsole befindet sich bereits im Batchmodus.
es: La consola ya está en modo de procesamiento por lotes.
fr: La console est déjà en mode de traitement par lot.
it: La console è già in modalità batch.
ja: コンソールは既にバッチ 処理モードです。
ko: 콘솔이 이미 일괄 처리 모드에 있습니다.
pl: Konsola jest już w trybie dzielenia na partie.
pt_br: O console já está no modo de lote.
ru: Консоль уже находится в пакетном режиме.
tr: Konsol zaten işlem grubu oluşturma modunda bulunuyor.
zh_hans: 控制台已处于批处理模式。
zh_hant: 主控台已處於批次處理模式。

# ConsoleTestExecutionFilterFactoryDescription
source: Creates the right test execution filter for console mode
cs: Vytvoří správný filtr provádění testů pro režim konzoly.
de: Erstellt den richtigen Testausführungsfilter für den Konsolenmodus.
es: Crea el filtro de ejecución de pruebas correcto para el modo de consola
fr: Crée le filtre d’exécution de test approprié pour le mode de console
it: Crea il filtro di esecuzione dei test corretto per la modalità console
ja: コンソール モードに適したテスト実行フィルターを作成します
ko: 콘솔 모드에 적합한 테스트 실행 필터를 만듬
pl: Tworzy odpowiedni filtr wykonywania testu dla trybu konsoli
pt_br: Cria o filtro de execução de teste correto para o modo console
ru: Создает фильтр выполнения правильного теста для режима консоли
tr: Konsol modu için doğru test yürütme filtresini oluşturur
zh_hans: 为主机模式创建正确的测试执行筛选
zh_hant: 為主機模式建立正確的測試執行篩選條件

# ConsoleTestExecutionFilterFactoryDisplayName
source: Console test execution filter factory
cs: Objekt pro vytváření filtru provádění testů konzoly
de: Ausführungsfilterfactory des Konsolentests
es: Fábrica de filtros de ejecución de pruebas de consola
fr: Fabrique de filtres d’exécution de tests de console
it: Factory del filtro per l'esecuzione dei test della console
ja: コンソール テスト実行フィルター ファクトリ
ko: 콘솔 테스트 실행 필터 팩터리
pl: Fabryka filtrów wykonywania testów konsoli
pt_br: Fábrica de filtros de execução de teste de console
ru: Фабрика фильтров выполнения тестов консоли
tr: Konsol test yürütme filtresi fabrikası
zh_hans: 主机测试执行筛选工厂
zh_hant: 主機測試執行篩選條件中心

# CouldNotFindDirectoryErrorMessage
source: Could not find directory '{0}'
cs: Nepodařilo se najít adresář {0}.
de: Das Verzeichnis "{0}" konnte nicht gefunden werden
es: No se pudo encontrar el directorio '{0}'
fr: Répertoire « {0} » introuvable.
it: Non è stato possibile trovare la directory '{0}'
ja: ディレクトリ '{0}' が見つかりませんでした。
ko: {0} 디렉터리를 찾을 수 없음
pl: Nie można odnaleźć katalogu „{0}”.
pt_br: Não foi possível localizar o diretório “{0}”
ru: Не удалось найти каталог "{0}".
tr: '{0}' dizini bulunamadı
zh_hans: 找不到目录“{0}”
zh_hant: 找不到目錄 '{0}'

# DiagnosticFileLevelWithAsyncFlush
source: Diagnostic file (level '{0}' with async flush): {1}"
cs: Diagnostický soubor (úroveň {0} s asynchronním vyprázdněním): {1}
de: Diagnosedatei (Ebene "{0}" mit asynchroner Leerung): "{1}"
es: Archivo de diagnóstico (nivel '{0}' con vaciado asincrónico): {1}"
fr: Fichier de diagnostic (niveau « {0} » avec vidage asynchrone) : {1} »
it: File di diagnostica (livello '{0}' con scaricamento asincrono): {1}"
ja: 診断ファイル (非同期フラッシュを使用したレベル '{0}'): {1}"
ko: 진단 파일(비동기 플러시를 사용한 수준 '{0}'): {1}"
pl: Plik diagnostyczny (poziom „{0}” z asynchronicznym opróżnianiem): {1}„
pt_br: Arquivo de diagnóstico (nível "{0}" com liberação assíncrona): {1}"
ru: Диагностический файл (уровень "{0}" с асинхронной очисткой): "{1}"
tr: Tanılama dosyası (zaman uyumsuz temizleme ile düzey '{0}'): {1}"
zh_hans: 诊断文件(具有异步刷新的级别“{0}”): {1}”
zh_hant: 診斷檔案 (具有非同步排清的層級 '{0}')：{1}”

# DiagnosticFileLevelWithFlush
source: Diagnostic file (level '{0}' with sync flush): {1}"
cs: Diagnostický soubor (úroveň {0} se synchronním vyprázdněním): {1}
de: Diagnosedatei (Ebene "{0}" mit synchroner Leerung): "{1}"
es: Archivo de diagnóstico (nivel '{0}' con vaciado sincrónico): {1}"
fr: Fichier de diagnostic (niveau « {0} » avec vidage synchrone) : {1} »
it: File di diagnostica (livello '{0}' con scaricamento sincrono): {1}"
ja: 診断ファイル (同期フラッシュを使用したレベル '{0}'): {1}"
ko: 진단 파일(동기 플러시를 사용한 수준 '{0}'): {1}"
pl: Plik diagnostyczny (poziom „{0}” z synchronicznym opróżnianiem): {1}„
pt_br: Arquivo de diagnóstico (nível "{0}" com liberação de sincronização): {1}"
ru: Диагностический файл (уровень "{0}" с очисткой синхронизации): "{1}"
tr: Tanılama dosyası (zaman uyumlu temizleme ile düzey '{0}' ): {1}"
zh_hans: 诊断文件(具有同步刷新的级别“{0}”): {1}”
zh_hant: 診斷檔案 (具有同步排清的層級 '{0}')：{1}”

# DiscoveredTestsInAssembly
source: Discovered {0} tests in assembly
cs: Počet zjištěných testů v sestavení: {0}
de: Ermittelte {0} Tests in Assembly
es: {0} pruebas detectadas en el ensamblado
fr: {0} tests découverts dans l’assembly
it: {0} individuati nell'assembly
ja: アセンブリで {0} つのテストを検出しました。
ko: 어셈블리에서 {0}개의 테스트가 검색됨
pl: Odnaleziono testy ({0}) w zestawach
pt_br: Testes {0} descobertos no assembly
ru: Обнаружены тесты ({0}) в сборке.
tr: Derlemede {0} test bulundu
zh_hans: 在程序集中发现了 {0} 个测试
zh_hant: 已在組件中找到 {0} 個測試

source: Discovering tests from
cs: Zjišťování testů z
de: Tests ermitteln aus
es: Detección de pruebas de
fr: Découverte des tests à partir de
it: Individuazione di test da
ja: からテストを検出しています
ko: 다음에서 테스트 검색하는 중
pl: Odnajdywanie testów w
pt_br: Descobrindo testes de
ru: Обнаружение тестов из
tr: Testler şuradan bulunuyor:
zh_hans: 正在发现以下位置中的测试
zh_hant: 正在以下位置找測試

# EnvironmentVariableProviderFailedWithError
source: Provider '{0}' (UID: {1}) failed with error: {2}
cs: Zprostředkovatel {0} (UID: {1}) selhal s chybou: {2}.
de: Anbieter "{0}" (UID: {1}) ist mit folgendem Fehler fehlgeschlagen: {2}
es: Error del proveedor "{0}" (UID: {1}) con el error: {2}
fr: Désolé, échec de l’« {0} » du fournisseur (UID : {1}) avec l’erreur : {2}
it: Provider '{0}' (UID: {1}) non riuscito con errore: {2}
ja: プロバイダー '{0}' (UID: {1}) が次のエラーで失敗しました: {2}
ko: 공급자 '{0}'(UID: {1})이 오류 {2}(으)로 실패했습니다.
pl: Dostawca „{0}” (UID:{1}) nie powiódł się z powodu błędu: {2}
pt_br: O provedor ''{0}'' (UID: {1}) falhou com o erro: {2}
ru: Сбой поставщика "{0}" (ИД пользователя: {1}) с ошибкой: {2}
tr: '{0}' sağlayıcısı '' (UID: {1}) şu hatayla başarısız oldu: {2}
zh_hans: 提供程序 '{0}' (UID: {1}) 失败，出现错误: {2}
zh_hant: 提供者 '{0}' (UID: {1}) 失敗，發生錯誤: {2}

# ExceptionDuringCancellationWarningMessage
source: Exception during the cancellation of request id '{0}'
cs: Výjimka při rušení ID žádosti '{0}'
de: Ausnahme beim Abbrechen der Anforderungs-ID '{0}'
es: Excepción durante la cancelación del id. de solicitud '{0}'
fr: Exception lors de l’annulation de l’ID de demande '{0}'
it: Eccezione durante l'annullamento dell'ID richiesta '{0}'
ja: 要求 ID '{0}' の取り消し中に例外が発生しました
ko: 요청 ID를 취소하는 동안 예외가 '{0}'
pl: Wyjątek podczas anulowania '{0}' identyfikatora żądania
pt_br: Exceção durante o cancelamento da ID da solicitação '{0}'
ru: Исключение при отмене запроса '{0}'
tr: İstek kimliği iptali sırasında özel durum '{0}'
zh_hans: 取消请求 ID 期间出现异常 '{0}'
zh_hant: 取消要求標識碼 '{0}' 期間發生例外狀況

source: Exit code
cs: Ukončovací kód
es: Código de salida
fr: Code de sortie
it: Codice di uscita
ja: 終了コード
ko: 종료 코드
pl: Kod zakończenia
pt_br: Código de saída
ru: Код завершения
tr: Çıkış kodu
zh_hans: 退出代码
zh_hant: 結束代碼

source: Expected
cs: Očekáváno
de: Erwartet
es: Se esperaba
fr: Attendu
it: Previsto
ja: 予想
ko: 필요
pl: Oczekiwane
pt_br: Esperado
ru: Ожидалось
tr: Beklenen
zh_hans: 预期
zh_hant: 預期

# ExtensionDoesNotImplementGivenInterfaceErrorMessage
source: Extension of type '{0}' is not implementing the required '{1}' interface
cs: Rozšíření typu {0} neimplementuje požadované rozhraní {1}.
de: Die Erweiterung vom Typ "{0}" implementiert nicht die erforderliche Schnittstelle "{1}"
es: La extensión de tipo "{0}" no está implementando la interfaz "{1}" necesaria
fr: Désolé, l’extension de type « {0} » n’implémente pas l’interface de « {1} » requise
it: L'estensione di tipo '{0}' non implementa l'interfaccia '{1}' richiesta
ja: 型 '{0}' の拡張機能は、必要な '{1}' インターフェイスを実装していません
ko: ‘{0}’ 형식의 확장이 필요한 '{1}' 인터페이스를 구현하지 않음
pl: Rozszerzenie typu „{0}” nie implementuje wymaganego interfejsu „{1}”.
pt_br: A extensão do tipo “{0}” não está implementando a interface “{1}” necessária
ru: Расширение типа "{0}" не реализует требуемый интерфейс "{1}"
tr: '{0}' uzantı türü, gerekli '{1}' arabirimini uygulamıyor
zh_hans: 类型“{0}”的扩展未实现所需的“{1}”接口
zh_hant: 類型 '{0}' 的延伸模組未實作所需的 '{1}' 介面

# ExtensionWithSameUidAlreadyRegisteredErrorMessage
source: Another extension with same the same UID '{0}' has already been registered. Registered extension is of type '{1}'
cs: Už je zaregistrované jiné rozšíření se stejným UID {0}. Zaregistrované rozšíření je typu {1}.
de: Eine andere Erweiterung mit derselben UID "{0}" wurde bereits registriert. Die registrierte Erweiterung ist vom Typ "{1}"
es: Ya se registró otra extensión con el mismo UID "{0}". La extensión registrada es de tipo "{1}"
fr: Désolé, une autre extension avec le même UID « {0} » a déjà été inscrite. Désolé, l’extension inscrite est de type « {1} »
it: È già stata registrata un'altra estensione con lo stesso UID '{0}'. L'estensione registrata è di tipo '{1}'
ja: 同じ UID '{0}' を持つ別の拡張機能が既に登録されています。登録されている拡張機能の種類は '{1}' です
ko: UID '{0}'과(와) 동일한 다른 확장이 이미 등록되었습니다. 등록된 확장은 '{1}' 형식임
pl: Inne rozszerzenie o tym samym identyfikatorze UID „{0}” zostało już zarejestrowane. Zarejestrowane rozszerzenie jest typu „{1}”
pt_br: Outra extensão com o mesmo UID “{0}” já foi registrada. A extensão registrada é do tipo “{1}”
ru: Уже зарегистрировано другое расширение с таким же ИД пользователя "{0}". Зарегистрированное расширение относится к типу "{1}"
tr: Aynı UID '{0}' olan başka bir uzantı zaten kayıtlı. Kayıtlı uzantı '{1}' türünde
zh_hans: 已注册另一个具有相同 UID“{0}”的扩展。已注册的扩展属于“{1}”类型
zh_hant: 已註冊另一個具有相同 UID '{0}' 的延伸模組。已註冊的延伸模組屬於 '{1}' 類型

source: Failed
cs: Neúspěšné
de: Fehler
es: Error
fr: Échec
it: Errore
ja: 失敗
ko: 실패
pl: Niepowodzenie
pt_br: Falhou
ru: Сбой
tr: Başarısız
zh_hans: 失败
zh_hant: 失敗

# FailedLowercase
source: failed
cs: selhalo
de: fehlerhaft
es: con errores
fr: échec
it: operazione non riuscita
ja: 失敗
ko: 실패
pl: zakończone niepowodzeniem
pt_br: com falha
ru: сбой
tr: başarısız
zh_hans: 失败
zh_hant: 已失敗

# FailedToWriteLogToChannelErrorMessage
source: Failed to write the log to the channel. Missed log content: {0}
cs: Zápis protokolu do kanálu se nezdařil. Nezachycený obsah protokolu: {0}
de: Fehler beim Schreiben des Protokolls in den Kanal. Inhalt des verpassten Protokolls: {0}
es: No se pudo escribir el registro en el canal. Contenido del registro perdido: {0}
fr: Désolé, échec de l’écriture du journal sur le canal. Contenu du journal manqué : {0}
it: Impossibile scrivere il log nel canale. Contenuto del log perso: {0}
ja: ログをチャネルに書き込めませんでした。ログの内容が見つかりません: {0}
ko: 채널에 로그를 쓰지 못했습니다. 누락된 로그 콘텐츠: {0}
pl: Nie można zapisać dziennika w kanale. Pominięta zawartość dziennika: {0}
pt_br: Falha ao gravar o log no canal. Conteúdo de log perdido: {0}
ru: Не удалось записать журнал в канал. Отсутствует содержимое журнала: {0}
tr: Günlük kanala yazılamadı. Eksik günlük içeriği: {0}
zh_hans: 无法将日志写入通道。遗漏的日志内容: {0}
zh_hant: 無法將記錄寫入通道。遺失的記錄內容: {0}

# FailedWithErrors
source: failed with {0} error(s)
cs: selhalo s {0} chybou/chybami.
de: fehlerhaft mit {0} Fehler(n)
es: error con {0} errores
fr: a échoué avec {0} erreur(s)
it: non riuscito con {0} errori
ja: {0} 件のエラーで失敗しました
ko: {0} 오류로 실패
pl: zakończono niepowodzeniem, z następującą liczbą błędów: {0}
pt_br: falhou com {0} erros
ru: сбой с ошибками ({0})
tr: {0} hatayla başarısız oldu
zh_hans: 失败并出现 {0} 个错误
zh_hant: 失敗，有 {0} 個錯誤

# FailedWithErrorsAndWarnings
source: failed with {0} error(s) and {1} warning(s)
cs: selhalo s chybami (celkem {0}) a upozorněními (celkem {1})
de: fehlerhaft mit {0} Fehler(n) und {1} Warnung(en)
es: error con {0} errores y {1} advertencias
fr: a échoué avec {0} erreur(s) et {1} avertissement(s)
it: non riuscito con {0} errori e {1} avvisi
ja: {0} 件のエラーと {1} 件の警告で失敗しました
ko: {0} 오류와 {1} 경고와 함께 실패
pl: zakończono niepowodzeniem, z błędami w liczbie: {0} i ostrzeżeniami w liczbie: {1}
pt_br: falhou com{0} erros e {1} avisos
ru: сбой с ошибками ({0}) и предупреждениями ({1})
tr: {0} hata ve {1} uyarıyla başarısız oldu
zh_hans: 失败，出现 {0} 错误和 {1} 警告
zh_hant: 失敗，有 {0} 個錯誤和 {1} 個警告

# FailedWithWarnings
source: failed with {0} warning(s)
cs: selhalo s {0} upozorněním(i).
de: fehlerhaft mit {0} Warnung(en)
es: error con {0} advertencias
fr: a échoué avec {0} avertissement(s)
it: non riuscito con {0} avvisi
ja: {0} 件の警告付きで失敗しました
ko: {0} 경고와 함께 실패
pl: zakończono niepowodzeniem, z ostrzeżeniami w liczbie: {0}
pt_br: falhou com {0} aviso(s)
ru: сбой с предупреждениями ({0})
tr: {0} uyarıyla başarısız oldu
zh_hans: 失败，出现 {0} 警告
zh_hant: 失敗，有 {0} 個警告

source: Finished test session.
cs: Testovací relace byla dokončena.
de: Die Testsitzung wurde beendet.
es: Finalizó la sesión de prueba.
fr: Session de test terminée.
it: Sessione di test completata.
ja: テスト セッションを終了しました。
ko: 테스트 세션을 마쳤습니다.
pl: Zakończono sesję testą.
pt_br: Sessão de teste concluída.
ru: Тестовый сеанс завершен.
tr: Test oturumu bitti.
zh_hans: 已完成测试会话。
zh_hant: 已完成測試會話。

source: For test
cs: Pro testování
de: Für Test
es: Para prueba
fr: Pour le test
it: Per test
ja: テスト用
ko: 테스트용
pl: Na potrzeby testu
pt_br: Para teste
ru: Для тестирования
tr: Test için
zh_hans: 用于测试
zh_hant: 用於測試

# FromFile
source: from
cs: od
de: von
es: desde
fr: à partir de
it: da
ja: 参照元:
ko: 출처
pl: z
pt_br: de
ru: из
tr: şu dosyadan:
zh_hans: 从
zh_hant: 來自

# GlobalValidationOfTestHostEnvironmentVariablesFailedErrorMessage
source: The following 'ITestHostEnvironmentVariableProvider' providers rejected the final environment variables setup:
cs: Následující zprostředkovatelé ITestHostEnvironmentVariableProvider odmítli konečné nastavení proměnných prostředí:
de: Die folgenden Anbieter von "ITestHostEnvironmentVariableProvider" haben das endgültige Setup der Umgebungsvariablen abgelehnt:
es: Los siguientes proveedores "ITestHostEnvironmentVariableProvider" rechazaron la configuración final de las variables de entorno:
fr: Les fournisseurs « ITestHostEnvironmentVariableProvider » suivants ont rejeté la configuration finale des variables d’environnement :
it: I provider 'ITestHostEnvironmentVariableProvider' seguenti hanno rifiutato l'installazione finale delle variabili di ambiente:
ja: 次の 'ITestHostEnvironmentVariableProvider' プロバイダーは、最終的な環境変数のセットアップを拒否しました:
ko: 다음 'ITestHostEnvironmentVariableProvider' 공급자가 최종 환경 변수 설정을 거부했습니다.
pl: Następujący dostawcy „ITestHostEnvironmentVariableProvider” odrzucili końcową konfigurację zmiennych środowiskowych:
pt_br: Os seguintes provedores ''ITestHostEnvironmentVariableProvider'' rejeitaram a configuração de variáveis de ambiente finais:
ru: Следующие поставщики "ITestHostEnvironmentVariableProvider" отклонили настройку окончательных переменных среды:
tr: Aşağıdaki 'ITestHostEnvironmentVariableProvider' sağlayıcıları son ortam değişkenleri kurulumunu reddetti:
zh_hans: 以下 'ITestHostEnvironmentVariableProvider' 提供程序拒绝了最终的环境变量设置:
zh_hant: 以下 'ITestHostEnvironmentVariableProvider' 提供者拒絕了最終環境變數設定：

# HelpApplicationUsage
source: Usage {0} [option providers] [extension option providers]
cs: Použití {0} [zprostředkovatelé možností] [zprostředkovatelé možností rozšíření]
de: Nutzung {0} [option providers] [extension option providers]
es: Uso {0} [proveedores de opciones] [proveedores de opciones de extensión]
fr: Utilisation {0} [fournisseurs d’options] [fournisseurs d’options d’extension]
it: Utilizzo {0} [provider di opzioni] [provider di opzioni di estensione]
ja: 使用法 {0} [オプション プロバイダー] [拡張オプション プロバイダー]
ko: 사용법 {0} [옵션 공급자] [확장 옵션 공급자]
pl: Użycie {0} [option providers] [extension option providers]
pt_br: Uso {0} [provedores de opções] [provedores de opções de extensão]
ru: Использование {0} [поставщики параметра] [поставщики параметра расширения]
tr: {0} Kullanımı [seçenek sağlayıcıları] [uzantı seçeneği sağlayıcıları]
zh_hans: 使用情况 {0} [选项提供程序] [扩展选项提供程序]
zh_hant: 使用方式 {0} [option providers] [extension option providers]

# HelpExecuteTestApplication
source: Execute a .NET Test Application.
cs: Spusťte testovací aplikaci .NET.
de: Führen Sie eine .NET-Anwendung aus.
es: Ejecute una aplicación de prueba de .NET.
fr: Exécutez une application de test .NET.
it: Esegui un'applicazione di test .NET.
ja: .NET テスト アプリケーションを実行します。
ko: .NET 테스트 애플리케이션을 실행합니다.
pl: Wykonaj aplikację testową platformy .NET.
pt_br: Execute um aplicativo de teste do .NET.
ru: Запуск тестового приложения .NET.
tr: .NET Test Uygulamasını yürütür.
zh_hans: 执行 .NET 测试应用。
zh_hant: 執行 .NET 測試應用程式。

# HelpExtensionOptions
source: Extension options:
cs: Možnosti rozšíření:
de: Erweiterungsoptionen:
es: Opciones de extensión:
fr: Options d’extension :
it: Opzioni di estensione:
ja: 拡張機能オプション:
ko: 확장 옵션:
pl: Opcje rozszerzenia:
pt_br: Opções de extensão:
ru: Параметры расширения:
tr: Uzantı seçenekleri:
zh_hans: 扩展选项:
zh_hant: 延伸模組選項:
