Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TimeoutAcquiringSemaphoreErrorMessage
source: Failed to acquire semaphore before timeout of '{0}' seconds
cs: Nepovedlo se získat semafor před vypršením časového limitu {0} s.
de: Fehler beim Abrufen des Semaphors vor einem Timeout von "{0}" Sekunden.
es: No se pudo adquirir el semáforo antes del tiempo de espera de “{0}” segundos
fr: Échec de l’acquisition du sémaphore avant le délai d’expiration de « {0} » secondes
it: Non è stato possibile acquisire il semaforo prima del timeout di '{0}' secondi
ja: タイムアウト '{0}' 秒前にセマフォを取得できませんでした
ko: '{0}'초의 시간 제한 전에 세마포를 가져오지 못했습니다.
pl: Nie można uzyskać semafora przed upływem limitu czasu wynoszącego „{0}” s
pt_br: Falha ao adquirir semáforo antes do tempo limite de '{0}' segundos
ru: Не удалось получить семафор до истечения времени ожидания ("{0}" с)
tr: '{0}' saniyelik zaman aşımından önce semafor edinilemedi
zh_hans: 在“{0}”秒超时之前获取信号灯失败
zh_hant: 無法在 '{0}' 秒逾時前取得旗號

# TimeoutFlushingLogsErrorMessage
source: Failed to flush logs before the timeout of '{0}' seconds
cs: Nepovedlo se vyprázdnit protokoly před vypršením časového limitu {0} s.
de: Fehler beim Leeren von Protokollen vor dem Timeout von "{0}" Sekunden
es: No se pudieron vaciar los registros antes del tiempo de espera de “{0}” segundos
fr: Échec du vidage des journaux avant le délai d’expiration de « {0} » secondes
it: Non è stato possibile scaricare i log prima del timeout di '{0}' secondi
ja: '{0}' 秒のタイムアウト前にログをフラッシュできませんでした
ko: '{0}'초의 시간 제한 전에 로그를 플러시하지 못했습니다.
pl: Nie można opróżnić dzienników przed upływem limitu czasu wynoszącego „{0}” s
pt_br: Falha ao liberar logs antes do tempo limite de '{0}' segundos
ru: Не удалось записать журналы на диск до истечения времени ожидания ("{0}" с)
tr: '{0}' saniyelik zaman aşımından önce günlükler boşaltılamadı
zh_hans: 未能在“{0}”秒超时之前刷新日志
zh_hant: 無法在 '{0}' 秒逾時前排清記錄

source: Total
cs: Celkem
de: Gesamt
it: Totale
ja: 合計
ko: 합계
pl: Łącznie
ru: Всего
tr: Toplam
zh_hans: 总计
zh_hant: 總計

# TreeNodeFilterCannotContainSlashCharacterErrorMessage
source: A filter '{0}' should not contain a '/' character
cs: Filtr {0} nesmí obsahovat znak /.
de: Ein Filter "{0}" darf kein "/"-Zeichen enthalten
es: Un filtro "{0}" no debe contener un carácter "/".
fr: Un filtre « {0} » ne doit pas contenir de caractère '/'
it: Un filtro '{0}' non dovrebbe contenere un carattere '/'
ja: フィルター '{0}' に '/' 文字を含めることはできません
ko: '{0}' 필터는 '/' 문자를 포함하면 안 됨
pl: Filtr „{0}” nie powinien zawierać znaku „/”
pt_br: Um filtro “{0}” não deve conter um caractere '/'
ru: Фильтр "{0}" не должен содержать символ "/"
tr: '{0}' filtresi, '/' karakteri içermemelidir
zh_hans: 筛选“{0}”不应包含“/”字符
zh_hant: 篩選條件 '{0}' 不應包含 '/' 字元

# TreeNodeFilterDescription
source: Use a tree filter to filter down the tests to execute
cs: K vyfiltrování testů, které se mají provést, použijte stromový filtr.
de: Verwenden Sie einen Strukturfilter, um die auszuführenden Tests nach unten zu filtern.
es: Usar un filtro de árbol para filtrar las pruebas que se van a ejecutar
fr: Utiliser un filtre d’arborescence pour filtrer les tests à exécuter
it: Usa un filtro albero per filtrare i test da eseguire
ja: ツリー フィルターを使用して実行するテストをフィルター処理する
ko: 트리 필터를 사용하여 실행할 테스트를 필터링합니다.
pl: Użyj filtru drzewa, aby przefiltrować testy do wykonania
pt_br: Usar um filtro de árvore para filtrar os testes a serem executados
ru: Используйте фильтр дерева для фильтрации выполняемых тестов
tr: Yürütülecek testleri filtrelemek için bir ağaç filtresi kullanın
zh_hans: 使用树筛选器筛选要执行的测试
zh_hant: 使用樹狀篩選來篩選要執行的測試

# TreeNodeFilterEscapeCharacterShouldNotBeLastErrorMessage
source: An escape character should not terminate the filter string '{0}'
cs: Řetězec filtru by neměl být ukončen řídicím znakem {0}.
de: Ein Escapezeichen darf die Filterzeichenfolge "{0}" nicht beenden
es: Un carácter de escape no debe terminar la cadena de filtro "{0}"
fr: Désolé, un caractère d’échappement ne doit pas terminer la chaîne de filtre « {0} »
it: Un carattere di escape non deve terminare la stringa di filtro '{0}'
ja: エスケープ文字はフィルター文字列 '{0}' を終了できません
ko: 이스케이프 문자가 필터 문자열 '{0}'을(를) 종료하면 안 됨
pl: Znak ucieczki nie powinien kończyć ciągu filtru „{0}”
pt_br: Um caractere de escape não deve encerrar a cadeia de caracteres de filtro “{0}”
ru: Escape-символ не должен завершать строку фильтра "{0}"
tr: Kaçış karakteri, '{0}' filtre dizesini sonlandırmamalıdır
zh_hans: 转义字符不应终止筛选字符串“{0}”
zh_hant: 逸出字元不應終止篩選條件字串 '{0}'

# TreeNodeFilterOnlyLastLevelCanContainMutiLevelWildcardErrorMessage
source: Only the final filter path can contain '**' wildcard
cs: Zástupný znak ** může obsahovat pouze konečná cesta filtru.
de: Nur der endgültige Filterpfad darf den Platzhalter "**" enthalten
es: Solo la ruta de acceso de filtro final puede contener el carácter comodín "**".
fr: Désolé, seul le chemin d’accès de filtre final peut contenir le caractère générique ’**’
it: Solo il percorso del filtro finale può contenere il carattere jolly '**'
ja: '**' ワイルドカードを含めることができるのは、最後のフィルター パスのみです
ko: 최종 필터 경로만 '**' 와일드카드를 포함할 수 있음
pl: Tylko końcowa ścieżka filtru może zawierać symbol wieloznaczny „**”
pt_br: Somente o caminho do filtro final pode conter curinga “**”
ru: Только конечный путь фильтра может содержать подстановочный знак "**"
tr: Yalnızca son filtre yolu, '**' joker karakterlerini içerebilir
zh_hans: 只有最终筛选路径可以包含“**”通配符
zh_hant: 只有最終篩選條件路徑可以包含 '**' 萬用字元

# TreeNodeFilterOperatorNotAllowedErrorMessage
source: Unexpected operator '&' or '|' within filter expression '{0}'
cs: Neočekávaný operátor & nebo | ve výrazu filtru {0}
de: Unerwarteter Operator "&" oder "|" innerhalb des Filterausdrucks "{0}"
es: Operador ''&" o '|' inesperado en la expresión de filtro "{0}"
fr: Désolé, opérateur '&' ou '|' inattendu dans l’expression de filtre « {0} »
it: Operatore '&' o '|' imprevisto nell'espressione di filtro '{0}'
ja: フィルター式 '{0}' 内で予期しない演算子 '&' または '|' が発生しました
ko: 필터 식 '{0}' 내에 예기치 않은 연산자 '&' 또는 '|'이(가) 있음
pl: Nieoczekiwany operator „&” lub „|” w wyrażeniu filtru „{0}”
pt_br: Operador inesperado “&” ou “|” dentro da expressão de filtro “{0}”
ru: Непредвиденный оператор "&" или "|" в выражении фильтра "{0}"
tr: '{0}' filtre ifadesinde beklenmeyen '&' veya '|' işleci
zh_hans: 筛选表达式“{0}”中出现意外的运算符“&”或“|”
zh_hant: 篩選條件運算式 '{0}' 中出現未預期的運算子 '&' 或 '|'

# TreeNodeFilterPathShouldStartWithSlashErrorMessage
source: Invalid node path, expected root as first character '{0}'
cs: Neplatná cesta k uzlu, jako první znak se očekával kořen {0}.
de: Ungültiger Knotenpfad. Der Stamm wurde als erstes Zeichen "{0}" erwartet
es: Ruta de acceso de nodo no válida. Se esperaba la raíz como primer carácter "{0}"
fr: Désolé. chemin de nœud non valide, racine attendue en tant que premier caractère « {0} »
it: Percorso del nodo non valido. Radice prevista come primo carattere '{0}'
ja: ノード パスが無効です。最初の文字 '{0}' としてルートが必要です
ko: 노드 경로가 잘못되었습니다. 첫 번째 문자 '{0}'(으)로 루트 필요
pl: Nieprawidłowa ścieżka węzła, oczekiwano głównego jako pierwszego znaku „{0}”
pt_br: Caminho do nó inválido, raiz esperada como primeiro caractere “{0}”
ru: Недопустимый путь к узлу. В качестве первого символа ожидался корень "{0}"
tr: Geçersiz düğüm yolu, ilk karakter '{0}' olarak kök bekleniyordu
zh_hans: 无效节点路径，应将根作为第一个字符“{0}”
zh_hant: 無效節點路徑，應將根作為第一個字元 '{0}'

# TreeNodeFilterUnbalancedFilterErrorMessage
source: Filter expression '{0}' contains an unbalanced number of '{1}' '{2}' operators
cs: Výraz filtru {0} obsahuje nevyvážený počet operátorů {1} {2}.
de: Der Filterausdruck "{0}" enthält eine unausgewogene Anzahl von Operatoren "{1}" "{2}"
es: La expresión de filtro "{0}" contiene un número no equilibrado de operadores "{1}" "{2}"
fr: Désolé, l’expression de filtre « {0} » contient un nombre non équilibré d’opérateurs « {1} » « {2} »
it: L'espressione di filtro '{0}' contiene un numero di operatori di '{1}' '{2}' non bilanciato
ja: フィルター式 '{0}' に '{1}' '{2}' 演算子の不均衡な数が含まれています
ko: 필터 식 '{0}'이(가) '{1}' '{2}' 연산자의 균형이 맞지 않는 개수를 포함함
pl: Wyrażenie filtru „{0}” zawiera niezrównoważoną liczbę operatorów „{1}” „{2}”
pt_br: A expressão de filtro “{0}” contém um número não balanceado de operadores “{1}” “{2}”
ru: Выражение фильтра "{0}" содержит несбалансированное число операторов "{1}" "{2}"
tr: '{0}' filtre ifadesi, dengesiz sayıda '{1}' '{2}' işleci içeriyor
zh_hans: 筛选表达式“{0}”包含数量不平衡的“{1}”“{2}”运算符
zh_hant: 篩選條件運算式 '{0}' 包含數量不平衡的 '{1}' '{2}' 運算子

# TreeNodeFilterUnexpectedSlashOperatorErrorMessage
source: Filter contains an unexpected '/' operator inside a parenthesized expression
cs: Filtr uvnitř výrazu v závorkách obsahuje neočekávaný operátor /.
de: Der Filter enthält einen unerwarteten "/"-Operator in einem in Klammern gesetzten Ausdruck
es: El filtro contiene un operador "/" inesperado dentro de una expresión entre paréntesis
fr: Désolé, le filtre contient un opérateur '/' inattendu dans une expression entre parenthèses
it: Il filtro contiene un operatore '/' imprevisto all'interno di un'espressione tra parentesi
ja: かっこで囲まれた式内に、予期しない '/' 演算子がフィルターに含まれています
ko: 필터는 괄호가 있는 식 내에 예기치 않은 '/' 연산자를 포함함
pl: Filtr zawiera nieoczekiwany operator „/” wewnątrz wyrażenia w nawiasach
pt_br: O filtro contém um operador “/” inesperado dentro de uma expressão entre parênteses
ru: Фильтр содержит непредвиденный оператор "/" внутри выражения в круглых скобах
tr: Filtre, parantez içine alınmış bir ifadenin içinde beklenmeyen bir '/' işleci içeriyor
zh_hans: 筛选在带圆括号的表达式中包含意外“/”运算符
zh_hant: 篩選條件在小括號內的運算子中包含未預期的 '/' 運算子

# UnexpectedCallTelemetryIsDisabledErrorMessage
source: Unexpected telemetry call, the telemetry is disabled.
cs: Neočekávané volání telemetrie, telemetrie je zakázaná.
de: Unerwarteter Telemetrieaufruf. Die Telemetrie ist deaktiviert.
es: Llamada de telemetría inesperada, la telemetría está deshabilitada.
fr: Appel de télémétrie inattendu, la télémétrie est désactivée.
it: Chiamata di telemetria imprevista. La telemetria è disabilitata.
ja: 予期しないテレメトリ呼び出しです。テレメトリは無効になっています。
ko: 예기치 않은 원격 분석 호출로 인해 원격 분석을 사용할 수 없습니다.
pl: Nieoczekiwane wywołanie telemetrii, a telemetria jest wyłączona.
pt_br: Chamada de telemetria inesperada, a telemetria está desabilitada.
ru: Непредвиденный вызов телеметрии. Телеметрия отключена.
tr: Beklenmeyen telemetri çağrısı, telemetri devre dışı bırakıldı.
zh_hans: 意外的遥测调用，遥测功能已被禁用。
zh_hant: 未預期的遙測呼叫，遙測已停用。

# UnexpectedExceptionDuringByteConversionErrorMessage
source: An unexpected exception occurred during byte conversion
cs: Při převodu bajtů došlo k neočekávané výjimce.
de: Unerwartete Ausnahme während der Bytekonvertierung.
es: Se ha producido una excepción inesperada durante la conversión de bytes
fr: Une exception inattendue s’est produite lors de la conversion d’octets
it: Si è verificata un'eccezione imprevista durante la conversione dei byte
ja: バイト変換中に予期しない例外が発生しました
ko: 바이트 변환 중 예기치 않은 예외 발생
pl: Wystąpił nieoczekiwany wyjątek podczas konwersji bajtów
pt_br: Ocorreu uma exceção inesperada durante a conversão de bytes
ru: При преобразовании байт возникло непредвиденное исключение
tr: Bayt dönüştürme sırasında beklenmeyen bir özel durum oluştu
zh_hans: 字节转换期间出现意外异常
zh_hant: 位元組轉換期間發生未預期的例外狀況

# UnexpectedExceptionInFileLoggerErrorMessage
source: An unexpected exception occurred in 'FileLogger.WriteLogToFileAsync'. {0}
cs: Ve FileLogger.WriteLogToFileAsync došlo k neočekávané výjimce. {0}
de: Unerwartete Ausnahme in "FileLogger.WriteLogToFileAsync". {0}
es: Se ha producido una excepción inesperada en “FileLogger.WriteLogToFileAsync”. {0}
fr: Une exception inattendue s’est produite dans « FileLogger.WriteLogToFileAsync ». {0}
it: Eccezione imprevista in 'FileLogger.WriteLogToFileAsync'. {0}
ja: 'FileLogger.WriteLogToFileAsync' で予期しない例外が発生しました。 {0}
ko: 'FileLogger.WriteLogToFileAsync'에서 예기치 않은 예외가 발생했습니다. {0}
pl: Wystąpił nieoczekiwany wyjątek w elemencie „FileLogger.WriteLogToFileAsync”. {0}
pt_br: Ocorreu uma exceção inesperada em "FileLogger.WriteLogToFileAsync". {0}
ru: В "FileLogger.WriteLogToFileAsync" произошло непредвиденное исключение. {0}
tr: 'FileLogger.WriteLogToFileAsync' içinde beklenmeyen bir özel durum oluştu. {0}
zh_hans: "FileLogger.WriteLogToFileAsync" 出现意外异常。 {0}
zh_hant: 'FileLogger.WriteLogToFileAsync' 發生未預期的例外狀況。 {0}

# UnexpectedStateErrorMessage
source: Unexpected state in file '{0}' at line '{1}'
cs: Neočekávaný stav v souboru {0} na řádku {1}
de: Unerwarteter Status in Datei "{0}" in Zeile "{1}"
es: Estado inesperado en el archivo “{0}” en la línea “{1}”
fr: État inattendu dans le fichier « {0} » à la ligne « {1} »
it: Stato imprevisto nel file '{0}' alla riga '{1}'
ja: ファイル '{0}' の行 '{1}' の予期しない状態
ko: '{1}' 줄의 '{0}' 파일에 예기치 않은 상태가 있습니다.
pl: Nieoczekiwany stan w pliku „{0}” w wierszu „{1}”
pt_br: Estado inesperado no arquivo '{0}' na linha '{1}'
ru: Непредвиденное состояние в файле "{0}" в строке "{1}"
tr: '{0}' dosyasında '{1}' satırındaki durum beklenmiyordu
zh_hans: 文件“{0}”中第“{1}”行出现意外状态
zh_hant: 檔案 '{0}' 的第 '{1}' 行出現未預期的狀態

# UnknownCommunicationProtocolErrorMessage
source: The communication protocol '{0}' is not supported
cs: Komunikační protokol {0} není podporován.
de: Das Kommunikationsprotokoll "{0}" wird nicht unterstützt
es: No se admite el protocolo de comunicación '{0}'
fr: Le protocole de communication « {0} » n’est pas pris en charge
it: Il protocollo di comunicazione '{0}' non è supportato
ja: 通信プロトコル '{0}' はサポートされていません
ko: 통신 프로토콜 '{0}'은(는) 지원되지 않습니다.
pl: Protokół komunikacyjny „{0}” nie jest obsługiwany
pt_br: O protocolo de comunicação “{0}” não tem suporte
ru: Протокол коммуникации "{0}" не поддерживается
tr: '{0}' iletişim protokolü desteklenmiyor
zh_hans: 不支持通信协议“{0}”
zh_hant: 通訊協定 '{0}' 不受支援

# UnobservedTaskExceptionWarningMessage
source: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] Unhandled exception: {0}
cs: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] Neošetřená výjimka: {0}
de: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] Ausnahmefehler: {0}
es: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] excepción no controlada: {0}
fr: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] exception non prise en charge : {0}
it: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] eccezione non gestita: {0}
ja: ハンドルされない例外 [ServerTestHost.OnTaskSchedulerUnobservedTaskException]: {0}
ko: 처리되지 않은 예외 [ServerTestHost.OnTaskSchedulerUnobservedTaskException]: {0}
pl: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] Nieobsługiwany wyjątek: {0}
pt_br: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] exceção sem tratamento: {0}
ru: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] необработанное исключение: {0}
tr: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] özel durum: {0}
zh_hans: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] 未经处理的异常： {0}
zh_hant: [ServerTestHost.OnTaskSchedulerUnobservedTaskException] 未處理的例外狀況： {0}

# UnreachableLocationErrorMessage
source: This program location is thought to be unreachable. File='{0}' Line={1}
cs: Toto umístění programu se považuje za nedostupné. File={0}, Line={1}
de: Dieser Programmspeicherort wird als nicht erreichbar betrachtet. File='{0}' Line={1}
es: Se considera que esta ubicación del programa es inaccesible. Archivo=''{0}'' Línea={1}
fr: Cet emplacement du programme est considéré comme inaccessible. File=« {0} », Ligne={1}
it: La posizione del programma è ritenuta non raggiungibile. File='{0}', Riga={1}
ja: このプログラムの場所に到達できないと考えられます。ファイル='{0}'、行={1}
ko: 이 프로그램 위치에 연결할 수 없는 것으로 생각됩니다. File='{0}' Line={1}
pl: Ta lokalizacja programu jest uważana za nieosiągalną. Plik=„{0}”, Wiersz={1}
pt_br: Este local do programa é considerado inacessível. Arquivo='{0}' Linha={1}
ru: Похоже, что это расположение программы является недоступным. Файл="{0}", строка={1}
tr: Bu program konumu erişilemez olarak görülüyor. Dosya='{0}', Satır={1}
zh_hans: 此程序位置被视为无法访问。文件='{0}'，行={1}
zh_hant: 此程式位置被認為無法連線。File='{0}' Line={1}

source: Zero tests ran
cs: Spustila se nula testů
de: Es wurden keine Tests ausgeführt.
es: No se ejecutaron pruebas
fr: Zéro tests exécutés
it: Nessun test eseguito
ja: 0 件のテストが実行されました
ko: 테스트가 0개 실행됨
pl: Uruchomiono zero testów
pt_br: Zero testes executados
ru: Запущено ноль тестов
tr: Sıfır test çalıştırıldı
zh_hans: 运行了零个测试
zh_hant: 已執行零項測試
