Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform/Resources/xlf/PlatformResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PlatformCommandLineResultDirectoryOptionDescription
source: The directory where the test results are going to be placed. If the specified directory doesn't exist, it's created. The default is TestResults in the directory that contains the test application.
cs: Adresář, do kterého budou umístěny výsledky testu. Pokud zadaný adresář neexistuje, vytvoří se. Výchozí hodnota je TestResults v adresáři, který obsahuje testovací aplikaci.
de: Das Verzeichnis, in dem die Testergebnisse abgelegt werden. Wenn das angegebene Verzeichnis nicht vorhanden ist, wird es erstellt. Der Standardwert ist "TestResults" im Verzeichnis, das die Testanwendung enthält.
es: Directorio donde se van a colocar los resultados de las pruebas. Si el directorio especificado no existe, se crea. El valor predeterminado es TestResults en el directorio que contiene la aplicación de prueba.
fr: Le répertoire dans lequel les résultats des tests vont être placés. Si le répertoire spécifié n’existe pas, il est créé. La valeur par défaut est TestResults dans le répertoire qui contient l’application de test.
it: La directory in cui verranno collocati i risultati del test. Se la directory specificata non esiste, viene creata. L’impostazione predefinita è TestResults nella directory che contiene l'applicazione di test.
ja: テスト結果を配置するディレクトリ。 指定したディレクトリが存在しない場合は、作成されます。 既定値は、テスト アプリケーションを含むディレクトリ内の TestResults です。
ko: 테스트 결과를 배치할 디렉터리입니다. 지정한 디렉터리가 없으면 만들어집니다. 기본값은 테스트 애플리케이션을 포함하는 디렉터리의 TestResults입니다.
pl: Katalog, w którym zostaną umieszczone wyniki testów. Jeśli określony katalog nie istnieje, zostanie on utworzony. Wartość domyślna to TestResults w katalogu zawierającym aplikację testową.
pt_br: O diretório no qual os resultados do teste serão colocados. Se o diretório especificado não existir, ele será criado. O padrão é TestResults no diretório que contém o aplicativo de teste.
ru: Каталог, в котором будут размещены результаты теста. Если указанный каталог не существует, он будет создан. Значение по умолчанию — TestResults в каталоге, содержащем тестируемое приложение.
tr: Test sonuçlarının yerleştirileceği dizin. Belirtilen dizin yoksa oluşturulur. Varsayılan değer, test uygulamasını içeren dizindeki TestResults'dır.
zh_hans: 将要放置测试结果的目录。 如果指定的目录不存在，则创建该目录。 默认值是包含测试应用程序的目录中的 TestResults。
zh_hant: 將放置測試結果的目錄。 如果指定的目錄不存在，系統會建立該目錄。 預設值是包含測試應用程式之目錄中的 TestResults。

# PlatformCommandLineServerOptionDescription
source: Enable the server mode.
cs: Umožňuje povolit režim serveru.
de: Aktivieren Sie den Servermodus.
es: Habilite el modo de servidor.
fr: Activer le mode serveur.
it: Abilita la modalità server.
ja: サーバー モードを有効にします。
ko: 서버 모드를 사용하도록 설정합니다.
pl: Włącz tryb serwera.
pt_br: Habilite o modo de servidor.
ru: Включите режим сервера.
tr: Sunucu modunu etkinleştirir.
zh_hans: 启用服务器模式。
zh_hant: 啟用伺服器模式。

# PlatformCommandLineSkipBuildersNumberCheckOptionDescription
source: For testing purposes
cs: Pro účely testování
de: Für Testzwecke
es: Con fines de prueba
fr: Pour test uniquement
it: A scopo di test
ja: テスト目的
ko: 테스트용
pl: Do celów testowych
pt_br: Para fins de teste
ru: Для тестирования
tr: Test amacıyla
zh_hans: 用于测试目的
zh_hant: 測試用

# PlatformCommandLineTestHostControllerPIDOptionDescription
source: Eventual parent test host controller PID.
cs: Případné PID nadřazeného hostitelského řadiče testů
de: Die PID des letztlich übergeordneten Testhostcontrollers.
es: PID del controlador de host de la posible prueba primaria.
fr: PID du contrôleur hôte de test parent éventuel.
it: PID del controller host di test padre finale.
ja: 最終的な親テスト ホスト コントローラー PID。
ko: 최종 부모 테스트 호스트 컨트롤러 PID입니다.
pl: Identyfikator PID ostatecznego nadrzędnego kontrolera hosta testów.
pt_br: PID do controlador de host de teste pai eventual.
ru: Итоговый идентификатор процесса контроллера узла родительского теста.
tr: Son üst test ana bilgisayar denetleyicisi PID'si.
zh_hans: 最终父测试主机控制器 PID。
zh_hant: 最終父測試主機控制器 PID。

# PlatformCommandLineTimeoutArgumentErrorMessage
source: 'timeout' option should have one argument as string in the format <value>[h|m|s] where 'value' is float
cs: Možnost timeout by měla mít jeden argument jako řetězec ve formátu <value>[h|m|s], kde value je hodnota datového typu float.
de: Die Option "timeout" muss ein Argument als Zeichenfolge im Format <value>[h|m|s] aufweisen, wobei "value" auf "float" festgelegt ist.
es: La opción 'timeout' debe tener un argumento como cadena con el formato <value>[h|m|s] donde 'value' es float
fr: L’option « timeout » doit avoir un argument sous forme de chaîne au format <value>[h|m|s] où « value » est float
it: L'opzione 'timeout' deve contenere un argomento come stringa nel formato <value>[h|m|s] dove 'value' è float
ja: 'timeout' オプションには、1 つの引数を文字列として <value>[h|m|s] の形式で指定する必要があります。この場合、'value' は float です
ko: 'timeout' 옵션에는 'value'가 float인 <value>[h|m|s] 형식의 문자열로 인수가 하나 있어야 합니다.
pl: Opcja „timeout” powinna mieć jeden argument jako ciąg w formacie <value>[h|m|s], gdzie element „value” ma wartość zmiennoprzecinkową
pt_br: A opção 'timeout' deve ter um argumento como cadeia de caracteres no formato <value>[h|m|s] onde 'value' é float
ru: Параметр "timeout" должен иметь один аргумент в виде строки в формате <value>[h|m|s], где "value" — число с плавающей точкой
tr: 'timeout' seçeneği, 'value' değerinin kayan olduğu <value>[h|m|s] biçiminde dize olarak bir bağımsız değişkene sahip olmalıdır
zh_hans: "timeout" 选项应有一个字符串形式的参数，格式为 <value>[h|m|s]，其中 "value" 为浮点型
zh_hant: 'timeout' 選項應該有一個引數作為字串，格式為 <value>[h|m|s]，其中 'value' 為 float

# PlatformCommandLineTimeoutOptionDescription
source: A global test execution timeout. Takes one argument as string in the format <value>[h|m|s] where 'value' is float.
cs: Vypršel globální časový limit provádění testu. Může mít jenom jeden argument jako řetězec ve formátu <value>[h|m|s], kde value je hodnota datového typu float.
de: Eine globale Testausführungszeit. Nimmt ein Argument als Zeichenfolge im Format <value>[h|m|s], wobei "value" auf "float" festgelegt ist.
es: Tiempo de espera de ejecución de prueba global. Toma un argumento como cadena con el formato <value>[h|m|s] donde 'value' es float.
fr: Délai global d’exécution du test. Prend un argument sous forme de chaîne au format <value>[h|m|s] où « value » est float.
it: Un timeout di esecuzione test globale. Acquisisce un argomento come stringa nel formato <value>[h|m|s] dove 'value' è float.
ja: グローバル テスト実行のタイムアウト。 1 つの引数を文字列として <value>[h|m|s] の形式で使用します。この場合、'value' は float です。
ko: 전역 테스트 실행 시간 제한입니다. 'value'가 float인 <value>[h|m|s] 형식의 문자열로 인수 하나를 사용합니다.
pl: Limit czasu wykonywania testu globalnego. Pobiera jeden argument jako ciąg w formacie <value>[h|m|s], gdzie element „value” ma wartość zmiennoprzecinkową.
pt_br: Um tempo limite global para a execução do teste. Recebe um argumento como cadeia de caracteres no formato <valor>[h|m|s] em que 'valor' é float.
ru: Глобальное время ожидания выполнения теста. Принимает один аргумент в виде строки в формате <value>[h|m|s], где "value" — число с плавающей точкой.
tr: Genel bir test yürütme zaman aşımı. Bir bağımsız değişkeni, 'value' değerinin kayan olduğu <value>[h|m|s] biçiminde dize olarak alır.
zh_hans: 全局测试执行超时。 获取一个字符串形式的参数，格式为 <value>[h|m|s]，其中 "value" 为浮点型。
zh_hant: 全域測試執行逾時。 將一個引數作為字串，格式為 <value>[h|m|s]，其中 'value' 為 float。

# PlatformCommandLineVSTestAdapterModeOptionDescription
source: Bridge to VSTest APIs
cs: Most k rozhraním API VSTest
de: Brücke zu VSTest-APIs
es: Puente a las API de VSTest
fr: Pont vers les API VSTest
it: Esegui il bridge con le API VSTest
ja: VSTest API へのブリッジ
ko: VSTest API에 대한 브리지
pl: Mostek do interfejsów API narzędzia VSTest
pt_br: Ponte para APIs vsTest
ru: Мост к API VSTest
tr: VSTest API'leri köprüsü
zh_hans: 到 VSTest API 的桥
zh_hant: 橋接至 VSTest API

# ProcessHasNotYetExitedErrorMessage
source: Process should have exited before we can determine this value
cs: Proces měl být ukončen před tím, než jsme mohli určit tuto hodnotu.
de: Der Prozess hätte beendet werden müssen, bevor dieser Wert ermittelt werden kann
es: El proceso debería haberse terminado para poder determinar este valor
fr: Le processus aurait dû s’arrêter avant que nous puissions déterminer cette valeur
it: Il processo dovrebbe essere terminato prima di poter determinare questo valore
ja: この値を決定する前にプロセスを終了する必要があります
ko: 이 값을 결정하려면 프로세스가 종료되어야 합니다.
pl: Proces powinien zakończyć się przed ustaleniem tej wartości
pt_br: O processo deve ter sido encerrado antes que possamos determinar esse valor
ru: Процесс должен быть завершен, прежде чем мы сможем определить это значение
tr: Bu değeri belirleyebilmemiz için süreçten çıkılmış olması gerekir
zh_hans: 在我们确定此值之前，流程应该已退出
zh_hant: 在我們確定此值之前，流程應已結束

# ReachedMaxFailedTestsMessage
source: Test session is aborting due to reaching failures ('{0}') specified by the '--maximum-failed-tests' option.
cs: Testovací relace se přerušuje, protože se dosáhlo chyb ('{0}') zadaných možností --maximum-failed-tests.
de: Die Testsitzung wird aufgrund von Erreichensfehlern ('{0}') abgebrochen, die durch die Option "--maximum-failed-tests" angegeben wurden.
es: La sesión de prueba se está anulando debido a errores ('{0}') especificados por la opción "--maximum-failed-tests".
fr: La session de test est en cours d’abandon en raison d’échecs ('{0}') spécifiés par l’option '--maximum-failed-tests'.
it: La sessione di test verrà interrotta perché sono stati individuati errori ('{0}') specificati dall'opzione '--maximum-failed-tests'.
ja: '--maximum-failed-tests' オプションで指定されたエラー ('{0}') に達したため、テスト セッションを中止しています。
ko: '--maximum-failed-tests' 옵션에 지정된 실패('{0}')에 도달하여 테스트 세션이 중단됩니다.
pl: Sesja testowa jest przerywana z powodu błędów ('{0}') określonych przez opcję "--maximum-failed-tests".
pt_br: A sessão de teste está sendo anulada devido a falhas ('{0}') especificadas pela opção '--maximum-failed-tests'.
ru: Тестовый сеанс прерывается из-за сбоев ('{0}'), указанных параметром "--maximum-failed-tests".
tr: '--maximum-failed-tests' seçeneği tarafından belirtilen hatalara ('{0}') ulaşılamama nedeniyle test oturumu iptal edildi.
zh_hans: 由于达到“--maximum-failed-tests”选项指定的失败 ('{0}')，测试会话正在中止。
zh_hant: 測試會話正在中止，因為達到失敗 ('{0}') 『--maximum-failed-tests』 選項指定。

# RetryFailedAfterTriesErrorMessage
source: Retry failed after {0} times
cs: Opakování se po {0} pokusech nezdařilo.
de: Wiederholungsfehler nach {0} Mal
es: Error al reintentar después de {0} veces
fr: Échec de la nouvelle tentative après {0} fois
it: Tentativi non riusciti dopo {0} tentativi
ja: 再試行が {0} 回後に失敗しました
ko: {0}회 후 다시 시도 실패
pl: Ponowna próba nie powiodła się po {0} razach
pt_br: Falha na repetição após o {0} tempo
ru: Повторные попытки ({0}) завершились неудачно
tr: Yeniden deneme {0} deneme sonrasında başarısız oldu
zh_hans: {0} 次之后重试失败
zh_hant: 在 {0} 次重試之後失敗

source: Running tests from
cs: Spouštění testů z
de: Ausführen von Tests von
es: Ejecutando pruebas desde
fr: Exécuter des tests à partir de
it: Esecuzione di test da
ja: 次からテストを実行しています:
ko: 다음 위치에서 테스트를 실행하는 중
pl: Uruchamianie testów z
pt_br: Executando testes de
ru: Выполнение тестов из
tr: Testler çalıştırılıyor:
zh_hans: 正在从以下位置运行测试
zh_hant: 正從下列位置執行測試

# ServerLogMessageDescription
source: This data represents a server log message
cs: Tato data představují zprávu protokolu serveru.
de: Diese Daten stellen eine Serverprotokollmeldung dar.
es: Estos datos representan un mensaje de registro del servidor
fr: Ces données représentent un message du journal du serveur
it: Questi dati rappresentano un messaggio di log del server
ja: このデータはサーバー ログ メッセージを表します
ko: 이 데이터는 서버 로그 메시지를 나타냅니다.
pl: Te dane reprezentują komunikat dziennika serwera
pt_br: Esses dados representam uma mensagem de log do servidor
ru: Эти данные представляют сообщение журнала сервера
tr: Bu veriler bir sunucu günlük iletisini temsil ediyor
zh_hans: 此数据表示服务器日志消息
zh_hant: 此資料代表伺服器記錄訊息

# ServerLogMessageDisplayName
source: Server log message
cs: Zpráva protokolu serveru
de: Serverprotokollmeldung
es: Mensaje de registro del servidor
fr: Message du journal du serveur
it: Messaggio di log del server
ja: サーバー ログ メッセージ
ko: 서버 로그 메시지
pl: Komunikat dziennika serwera
pt_br: Mensagem de log do servidor
ru: Сообщение журнала сервера
tr: Sunucu günlük iletisi
zh_hans: 服务器日志消息
zh_hant: 伺服器記錄訊息

# ServerTestExecutionFilterFactoryDescription
source: Creates the right test execution filter for server mode
cs: Vytvoří správný filtr provádění testů pro režim serveru.
de: Erstellt den richtigen Testausführungsfilter für den Servermodus
es: Crea el filtro de ejecución de pruebas correcto para el modo de servidor
fr: Crée le filtre d’exécution de test approprié pour le mode serveur
it: Crea il filtro di esecuzione dei test corretto per la modalità server
ja: サーバー モードに適したテスト実行フィルターを作成します
ko: 서버 모드에 적합한 테스트 실행 필터를 만듬
pl: Tworzy odpowiedni filtr wykonania testu dla trybu serwera
pt_br: Cria o filtro de execução de teste correto para o modo servidor
ru: Создает фильтр выполнения правильного теста для режима сервера
tr: Sunucu modu için doğru test yürütme filtresini oluşturur
zh_hans: 为服务器模式创建正确的测试执行筛选
zh_hant: 為伺服器模式建立正確的測試執行篩選條件

# ServerTestExecutionFilterFactoryDisplayName
source: Server test execution filter factory
cs: Objekt pro vytváření filtru provádění testů serveru
de: Ausführungsfilterfactory des Servertests
es: Fábrica de filtros de ejecución de pruebas de servidor
fr: Fabrique de filtres d’exécution de tests du serveur
it: Factory del filtro per l'esecuzione dei test del server
ja: サーバー テスト実行フィルター ファクトリ
ko: 서버 테스트 실행 필터 팩터리
pl: Fabryka filtrów wykonywania testów serwera
pt_br: Fábrica de filtros de execução de teste de servidor
ru: Фабрика фильтров выполнения тестов сервера
tr: Sunucu test yürütme filtresi fabrikası
zh_hans: 服务器测试执行筛选工厂
zh_hant: 伺服器測試執行篩選條件中心

# ServerTestHostDescription
source: The 'ITestHost' implementation used when running server mode.
cs: Implementace ITestHost použitá při spuštění režimu serveru
de: Die implementierung "ITestHost", die beim Ausführen des Servermodus verwendet wird.
es: Implementación de 'ITestHost' usada al ejecutar el modo de servidor.
fr: Implémentation 'ITestHost' utilisée lors de l’exécution du mode serveur.
it: Implementazione di 'ITestHost' usata durante l'esecuzione della modalità server.
ja: サーバー モードの実行時に使用される 'ITestHost' 実装。
ko: 서버 모드를 실행할 때 사용되는 'ITestHost' 구현입니다.
pl: Implementacja "ITestHost" używana podczas uruchamiania trybu serwera.
pt_br: A implementação 'ITestHost' usada ao executar o modo de servidor.
ru: Реализация "ITestHost", используемая при работе в режиме сервера.
tr: Sunucu modu çalıştırılırken kullanılan 'ITestHost' uygulaması.
zh_hans: 运行服务器模式时使用的 “ITestHost” 实现。
zh_hant: 執行伺服器模式時使用的 『ITestHost』 實作。

# ServerTestHostDisplayName
source: Server mode test host
cs: Testovací hostitel režimu serveru
de: Testhost für Servermodus
es: Host de prueba en modo servidor
fr: Hôte de test du mode serveur
it: Host di test in modalità server
ja: サーバー モード テスト ホスト
ko: 서버 모드 테스트 호스트
pl: Host testów trybu serwera
pt_br: Host de teste do modo de servidor
ru: Тестовый хост в режиме сервера
tr: Sunucu modu test ana bilgisayarı
zh_hans: 服务器模式测试主机
zh_hant: 伺服器模式測試主機

# ServiceProviderCannotFindServiceErrorMessage
source: Cannot find service of type '{0}'
cs: Nelze najít službu typu {0}.
de: Der Dienst vom Typ "{0}" wurde nicht gefunden.
es: No se encuentra el servicio de tipo '{0}'
fr: Service de type « {0} » introuvable
it: Impossibile trovare il servizio di tipo '{0}'
ja: '{0}' 型のサービスが見つかりません
ko: '{0}' 형식의 서비스를 찾을 수 없습니다.
pl: Nie można odnaleźć usługi typu „{0}”
pt_br: Não é possível localizar o serviço do tipo "{0}"
ru: Не удалось найти службу типа "{0}"
tr: '{0}' türündeki hizmet bulunamıyor
zh_hans: 找不到“{0}”类型的服务
zh_hant: 找不到類型 '{0}' 的服務

# ServiceProviderServiceAlreadyRegistered
source: Instance of type '{0}' is already registered
cs: Instance typu {0} je už zaregistrována.
de: Die Instanz vom Typ "{0}" ist bereits registriert.
es: La instancia del tipo '{0}' ya está registrada.
fr: L’instance de type « {0} » est déjà inscrite
it: L'istanza di tipo '{0}' è già registrata
ja: '{0}' 型のインスタンスは既に登録されています
ko: '{0}' 형식의 인스턴스가 이미 등록되어 있습니다.
pl: Wystąpienie typu „{0}” jest już zarejestrowane
pt_br: A instância do tipo "{0} já está registrada
ru: Экземпляр типа "{0}" уже зарегистрирован
tr: '{0}' türündeki örnek zaten kayıtlı
zh_hans: 已注册类型“{0}”的实例
zh_hant: 已註冊類型 '{0}' 的執行個體

# ServiceProviderShouldNotRegisterTestFramework
source: Instances of type 'ITestFramework' should not be registered through the service provider but through 'ITestApplicationBuilder.RegisterTestFramework'
cs: Instance typu ITestFramework by neměly být registrovány prostřednictvím poskytovatele služeb, ale prostřednictvím metody ITestApplicationBuilder.RegisterTestFramework.
de: Instanzen vom Typ "ITestFramework" sollten nicht über den Dienstanbieter, sondern über "ITestApplicationBuilder.RegisterTestFramework" registriert werden.
es: Las instancias de tipo "ITestFramework" no deben registrarse mediante el proveedor de servicios, sino mediante "ITestApplicationBuilder.RegisterTestFramework".
fr: Les instances de type « ITestFramework » ne doivent pas être inscrites par le biais du fournisseur de services, mais par le biais de « ITestApplicationBuilder.RegisterTestFramework »
it: Le istanze di tipo 'ITestFramework' non devono essere registrate tramite il provider di servizi, ma tramite 'ITestApplicationBuilder.RegisterTestFramework'
ja: 'ITestFramework' 型のインスタンスは、サービス プロバイダーを介して登録することはできません。'ITestApplicationBuilder.RegisterTestFramework' を介して登録する必要があります
ko: 'ITestFramework' 형식의 인스턴스는 서비스 공급자를 통해 등록하지 않아야 하지만 'ITestApplicationBuilder.RegisterTestFramework'를 통해 등록해야 합니다.
pl: Wystąpienia typu „ITestFramework” nie powinny być rejestrowane za pośrednictwem dostawcy usług, ale za pośrednictwem elementu „ITestApplicationBuilder.RegisterTestFramework”
pt_br: Instâncias do tipo "ITestFramework" não devem ser registradas por meio do provedor de serviços, mas por meio de "ITestApplicationBuilder.RegisterTestFramework"
ru: Экземпляры типа "ITestFramework" следует регистрировать не через поставщика услуг, а через "ITestApplicationBuilder.RegisterTestFramework"
tr: 'ITestFramework' türündeki örnekler hizmet sağlayıcısı aracılığıyla değil, 'ITestApplicationBuilder.RegisterTestFramework' aracılığıyla kaydedilmelidir
zh_hans: 不应通过服务提供商注册类型为“ITestFramework”的实例，而应通过“ITestApplicationBuilder.RegisterTestFramework”进行注册
zh_hant: 類型 'ITestFramework' 的執行個體不應透過服務提供者註冊，而是透過 'ITestApplicationBuilder.RegisterTestFramework' 註冊

source: Skipped
cs: Přeskočeno
de: Übersprungen
es: Omitida
fr: Ignoré
it: Ignorato
ja: スキップ
ko: 건너뜀
pl: Pominięto
pt_br: Ignorado
ru: Пропущен
tr: Atlandı
zh_hans: 已跳过
zh_hant: 略過

# SkippedLowercase
source: skipped
cs: vynecháno
de: übersprungen
es: omitido
fr: ignoré
it: ignorato
ja: スキップされました
ko: 건너뜀
pl: pominięte
pt_br: ignorado
ru: пропущено
tr: atlandı
zh_hans: 已跳过
zh_hant: 已跳過

# StackFrameAt
source: at
cs: v
de: um
es: a las
fr: sur
it: a
ja: 場所:
ko: 위치
pl: o
pt_br: em
ru: в
tr: şu yöntemle:
zh_hans: 在
zh_hant: 於

# StackFrameIn
source: in
cs: v
es: en
fr: dans
ja: 場所:
ko: 포함
pl: w
pt_br: em
ru: в
tr: şu dosyada:
zh_hans: 位于
zh_hant: 在

source: Stack Trace
cs: Trasování zásobníku
de: Stapelüberwachung
es: Seguimiento de la pila
fr: Rapport des appels de procédure
it: Analisi dello stack
ja: スタック トレース
ko: 스택 추적
pl: Śledzenie stosu
pt_br: Rastreamento de Pilha
ru: Трассировка стека
tr: Yığın İzlemesi
zh_hans: 堆栈跟踪
zh_hant: 堆疊追蹤

# StandardError
source: Error output
cs: Chybový výstup
de: Fehlerausgabe
es: Salida de error
fr: Sortie d’erreur
it: Output errori
ja: エラー出力
ko: 오류 출력
pl: Dane wyjściowe w przypadku błędu
pt_br: Saída de erros
ru: Вывод ошибок
tr: Hata çıkışı
zh_hans: 错误输出
zh_hant: 錯誤輸出

source: Standard output
cs: Standardní výstup
de: Standardausgabe
es: Salida estándar
fr: Sortie standard
it: Output standard
ja: 標準出力
ko: 표준 출력
pl: Standardowe dane wyjściowe
pt_br: Saída padrão
ru: Стандартный вывод
tr: Standart çıkış
zh_hans: 标准输出
zh_hant: 標準輸出

# StartingServer
source: Starting server. Listening on port '{0}'
cs: Spouští se server. Naslouchání na portu {0}
de: Server wird gestartet. An Port "{0}" lauschen
es: Iniciando el servidor. Escuchando en el puerto '{0}'
fr: Démarrage du serveur. Écoute sur le port « {0} »
it: Avvio del server. In ascolto sulla porta '{0}'
ja: サーバーを起動しています。ポート '{0}' で聞いています
ko: 서버를 시작하는 중입니다. 포트 '{0}'에서 수신 대기 중
pl: Uruchamianie serwera. Nasłuchiwanie na porcie „{0}”
pt_br: Iniciando servidor. Escutando na porta “{0}”
ru: Выполняется запуск сервера. Прослушивание порта "{0}"
tr: Sunucu başlatılıyor. '{0}' bağlantı noktasında dinleme işlemi yapılıyor
zh_hans: 正在启动服务器。正在侦听端口“{0}”
zh_hant: 正在啟動伺服器。正在連接埠 '{0}' 上聆聽

source: Starting test session.
cs: Spouští se testovací relace.
de: Die Testsitzung wird gestartet.
es: Iniciando sesión de prueba.
fr: Démarrage de la session de test.
it: Avvio della sessione di test.
ja: テスト セッションを開始しています。
ko: 테스트 세션을 시작하는 중입니다.
pl: Rozpoczynanie sesji testowej.
pt_br: Iniciando sessão de teste.
ru: Запуск тестового сеанса.
tr: Test oturumu başlatılıyor.
zh_hans: 正在启动测试会话。
zh_hant: 正在啟動測試會話。

# StartingTestSessionWithLogFilePath
source: Starting test session. The log file path is '{0}'.
cs: Spouští se testovací relace. Cesta k souboru protokolu je '{0}'.
de: Die Testsitzung wird gestartet. Der Protokolldateipfad ist '{0}'.
es: Iniciando sesión de prueba. La ruta de acceso del archivo de registro es '{0}'.
fr: Démarrage de la session de test. Le chemin d’accès au fichier journal est '{0}'.
it: Avvio della sessione di test. Il percorso del file di log è '{0}'.
ja: テスト セッションを開始しています。ログ ファイルのパスが '{0}' です。
ko: 테스트 세션을 시작하는 중입니다. 로그 파일 경로가 '{0}'.
pl: Rozpoczynanie sesji testowej. Ścieżka pliku dziennika jest '{0}'.
pt_br: Iniciando sessão de teste. O caminho do arquivo de log '{0}'.
ru: Запуск тестового сеанса. Путь к файлу журнала '{0}'.
tr: Test oturumu başlatılıyor. Günlük dosyası yolu '{0}'.
zh_hans: 正在启动测试会话。日志文件路径 '{0}'。
zh_hant: 正在啟動測試會話。記錄檔路徑 '{0}'。

# TEstExecutionFilterFactoryFactoryAlreadySetErrorMessage
source: An 'ITestExecutionFilterFactory' factory is already set
cs: Objekt pro vytváření ITestExecutionFilterFactory je už nastavený.
de: Eine "ITestExecutionFilterFactory"-Factory ist bereits festgelegt
es: Ya se ha establecido una fábrica "ITestExecutionFilterFactory"
fr: Désolé, une fabrique « ITestExecutionFilterFactory » est déjà définie
it: È già impostata una factory 'ITestExecutionFilterFactory'
ja: 'ITestExecutionFilterFactory' ファクトリは既に設定されています
ko: 'ITestExecutionFilterFactory' 팩터리가 이미 설정되어 있음
pl: Fabryka „ITestExecutionFilterFactory” jest już ustawiona
pt_br: Uma fábrica “ITestExecutionFilterFactory” já está definida
ru: Фабрика ITestExecutionFilterFactory уже настроена
tr: Bir 'ITestExecutionFilterFactory' fabrikası zaten ayarlanmış
zh_hans: 已设置“ITestExecutionFilterFactory”工厂
zh_hant: 已設定 'ITestExecutionFilterFactory' 中心
