Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Extensions.TrxReport/Resources/xlf/ExtensionResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidTestApplicationBuilderType
source: TRX report generator only works with builders of type 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder'
cs: Generátor sestav TRX funguje pouze s tvůrci typu Microsoft.Testing.Platform.Builder.TestApplicationBuilder.
de: Der TRX-Bericht-Generator funktioniert nur mit Generatoren vom Typ "Microsoft.Testing.Platform.Builder.TestApplicationBuilder"
es: El generador de informes TRX solo funciona con generadores de tipo "Microsoft.Testing.Platform.Builder.TestApplicationBuilder".
fr: Le générateur de rapports TRX fonctionne uniquement avec les générateurs de type « Microsoft.Testing.Platform.Builder.TestApplicationBuilder »
it: Il generatore di report TRX funziona solo con i generatori di tipo 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder'.
ja: TRX レポート ジェネレーター、'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' 型のビルダーでのみ機能します
ko: TRX 보고서 생성기는 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' 유형의 작성기에서만 작동합니다.
pl: Generator raportów TRX działa tylko z konstruktorami typu „Microsoft.Testing.Platform.Builder.TestApplicationBuilder”
pt_br: O gerador de relatórios TRX só funciona com construtores do tipo ''Microsoft.Testing.Platform.Builder.TestApplicationBuilder''
ru: Генератор отчетов TRX работает только с построителями типа "Microsoft.Testing.Platform.Builder.TestApplicationBuilder"
tr: TRX rapor oluşturucu yalnızca 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' türündeki oluşturucularla çalışır
zh_hans: TRX 报表生成器仅适用于“Microsoft.Testing.Platform.Builder.TestApplicationBuilder”类型的生成器
zh_hant: TRX 報表產生器只能與類型為 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' 的建立器一起運作

# TrxComparerToolBaselineFileOptionDescription
source: The baseline TRX file
cs: Soubor TRX standardních hodnot
de: Die Baseline-TRX-Datei
es: El archivo TRX de línea de base
fr: Fichier TRX de référence
it: File TRX di base
ja: ベースライン TRX ファイル
ko: 기준 TRX 파일
pl: Plik TRX punktu odniesienia
pt_br: O arquivo TRX da linha de base
ru: Базовый TRX-файл
tr: Temel TRX dosyası
zh_hans: 基线 TRX 文件
zh_hant: 比較基準 TRX 檔案

# TrxComparerToolBothFilesMustBeSpecified
source: '--{0}' and '--{1}' must both be specified
cs: Musí být zadaná jak možnost --{0}, tak možnost --{1}.
de: "--{0}" und "--{1}" müssen beide angegeben werden
es: '--{0}' y '--{1}' deben especificarse
fr: '--{0}' et '--{1}' doivent tous deux être spécifiés
it: È necessario specificare sia '--{0}' che '--{1}'
ja: '--{0}' と '--{1}' の両方を指定する必要があります
ko: '--{0}' 및 '--{1}'을(를) 모두 지정해야 합니다.
pl: „--{0}” i „--{1}” muszą być określone
pt_br: ''--{0}'' e ''--{1}'' devem ser especificados
ru: Необходимо одновременно указать "--{0}" и "--{1}"
tr: '--{0}' ve '--{1}' birlikte belirtilmelidir
zh_hans: 必须同时指定“--{0}”和“--{1}”
zh_hant: 必須同時指定 '--{0}' 和 '--{1}'

# TrxComparerToolDescription
source: This tool allows to compare and highights differences between 2 TRX reports
cs: Tento nástroj umožňuje porovnat rozdíly mezi 2 sestavami TRX a zobrazit přehled těchto rozdílů.
es: Esta herramienta permite comparar y comparar las diferencias entre 2 informes TRX
fr: Cet outil permet de comparer et d’afficher des différences élevées entre 2 rapports TRX
it: Questo strumento consente di confrontare e confrontare le differenze di vista tra 2 report TRX
ja: このツールを使用すると、2 つの TRX レポートの違いを比較し、強調表示できます
ko: 이 도구를 사용하면 2개의 TRX 보고서 간의 차이점을 비교하고 강조할 수 있습니다.
pl: To narzędzie umożliwia porównywanie i zwiększanie różnic między 2 raportami TRX
ru: Этот инструмент позволяет сравнивать и выделять различия между двумя отчетами TRX
zh_hant: 此工具可讓您比較 2 個 TRX 報表之間的高差異

# TrxComparerToolDisplayName
source: TRX comparer tool
cs: Porovnávač souborů TRX
de: TRX-Vergleichstool
es: Herramienta de comparador TRX
fr: Outil comparateur TRX
it: Strumento di confronto TRX
ja: TRX 比較ツール
ko: TRX 비교자 도구
pl: Narzędzie do porównywania TRX
pt_br: Ferramenta de comparador TRX
ru: Средство сравнения TRX
tr: TRX karşılaştırma aracı
zh_hans: TRX 比较器工具
zh_hant: TRX 比較工具

# TrxComparerToolOptionExpectsSingleArgument
source: '--{0}' expects a single trx file path as argument
cs: --{0} očekává jako argument jednu cestu k souboru trx.
de: "--{0}" erwartet einen einzelnen TRX-Dateipfad als Argument
es: '--{0}' espera una única ruta de acceso de archivo trx como argumento
fr: '--{0}' attend un seul chemin de fichier trx comme argument
it: '--{0}' prevede un singolo percorso di file trx come argomento
ja: '--{0}' には、引数として 1 つの trx ファイル パスが必要です
ko: '--{0}'에는 단일 trx 파일 경로가 인수로 필요합니다.
pl: Element „--{0}” oczekuje pojedynczej ścieżki pliku trx jako argumentu
pt_br: ''--{0}'' espera um único caminho de arquivo trx como argumento
ru: "--{0}" ожидает в качестве аргумента один путь к файлу TRX
tr: '--{0}', bağımsız değişken olarak tek bir trx dosya yolu bekliyor
zh_hans: “--{0}”需要单一 trx 文件路径作为参数
zh_hant: '--{0}' 需要單一 TRX 檔案路徑做為引數

# TrxComparerToolOtherFileOptionDescription
source: The TRX file to compare with the baseline
cs: Soubor TRX, který se má porovnat se standardními hodnotami
de: Die TRX-Datei, die mit der Baseline verglichen werden soll
es: Archivo TRX que se va a comparar con la línea base
fr: Fichier TRX à comparer à la ligne de base
it: File TRX da confrontare con la baseline
ja: ベースラインと比較する TRX ファイル
ko: 기준과 비교할 TRX 파일입니다.
pl: Plik TRX do porównania z punktem odniesienia
pt_br: O arquivo TRX a ser comparado com a linha de base
ru: TRX-файл для сравнения с базовыми показателями
tr: Taban çizgisiyle karşılaştırılacak TRX dosyası
zh_hans: 要与基线进行比较的 TRX 文件
zh_hant: 要與基準比較的 TRX 檔案

# TrxReportArtifactDescription
source: Test session
cs: Relace testu
de: Testsitzung
es: Sesión de prueba
fr: Session de test
it: Sessione di test
ja: テスト セッション
ko: 테스트 세션
pl: Sesja testowa
pt_br: Sessão de teste
ru: Тестовый сеанс
tr: Test oturumu
zh_hans: 测试会话
zh_hant: 測試工作階段

# TrxReportArtifactDisplayName
source: TRX Report
cs: Sestava TRX
de: TRX-Bericht
es: Informe TRX
fr: Rapport TRX
it: Report TRX
ja: TRX レポート
ko: TRX 보고서
pl: Raport TRX
pt_br: Relatório TRX
ru: Отчет TRX
tr: TRX Raporu
zh_hans: TRX 报表
zh_hant: TRX 報表

# TrxReportFileNameExtensionIsNotTrx
source: '--report-trx-filename' file name argument must end with '.trx' (e.g. --report-trx-filename myreport.trx)
cs: Argument názvu souboru --report-trx-filename musí končit na .trx (například --report-trx-filename myreport.trx).
de: Das Dateinamenargument "--report-trx-filename" muss auf ".trx" enden (z. B. "--report-trx-filename myreport.trx")
es: El argumento de nombre de archivo '--report-trx-filename' debe terminar con '.trx' (por ejemplo, --report-trx-filename myreport.trx)
fr: L'argument du nom de fichier '--report-trx-filename' doit se terminer par '.trx' (par exemple --report-trx-filename myreport.trx)
it: L'argomento del nome del file '--report-trx-filename' deve terminare con '.trx' (ad esempio --report-trx-filename myreport.trx)
ja: '--report-trx-filename' ファイル名引数の末尾は '.trx' にする必要があります (例: --report-trx-filename myreport.trx)
ko: '--report-trx-filename' 파일 이름 인수는 '.trx'로 끝나야 합니다(예: --report-trx-filename myreport.trx).
pl: Argument nazwy pliku „--report-trx-filename” musi kończyć się ciągiem „.trx” (np. --report-trx-filename myreport.trx)
pt_br: O argumento de nome de arquivo ''--report-trx-filename'' deve terminar com ''.trx'' (por exemplo, --report-trx-filename myreport.trx)
ru: Аргумент имени файла "--report-trx-filename" должен заканчиваться на ".trx" (например, --report-trx-filename myreport.trx)
tr: '--report-trx-dosyaadı' dosya adı bağımsız değişkeni '.trx' ile bitmelidir (örn. --report-trx-dosyaadı myreport.trx)
zh_hans: “--report-trx-filename”文件名参数必须以“.trx”结尾(例如 --report-trx-filename myreport.trx)
zh_hant: '--report-trx-filename' 檔案名稱引數的結尾必須是 '.trx' (例如 --report-trx-filename myreport.trx)

# TrxReportFileNameOptionDescription
source: The name of the generated TRX report
cs: Název vygenerované sestavy TRX
de: Der Name des generierten TRX-Berichts
es: Nombre del informe TRX generado
fr: Nom du rapport TRX généré
it: Nome del report TRX generato
ja: 生成された TRX レポートの名前
ko: 생성된 TRX 보고서의 이름입니다.
pl: Nazwa wygenerowanego raportu TRX
pt_br: O nome do relatório TRX gerado
ru: Имя созданного отчета TRX
tr: Oluşturulan TRX raporunun adı
zh_hans: 生成的 TRX 报表的名称
zh_hant: 產生的 TRX 報表名稱

# TrxReportFileNameRequiresTrxReport
source: '--report-trx-filename' requires '--report-trx' to be enabled
cs: --report-trx-filename vyžaduje, aby byla povolená možnost --report-trx.
de: "--report-trx-filename" muss "--report-trx" muss aktiviert sein
es: '--report-trx-filename' requiere que se habilite '--report-trx'
fr: '--report-trx-filename' nécessite que '--report-trx' soit activé
it: '--report-trx-filename' richiede l'abilitazione di '--report-trx'
ja: '--report-trx-filename' では、'--report-trx' を有効にする必要があります
ko: '--report-trx-filename'을 사용하려면 '--report-trx'를 사용하도록 설정해야 합니다.
pl: Element „--report-trx-filename” wymaga włączenia elementu „--report-trx”
pt_br: ''--report-trx-filename'' requer que ''--report-trx'' esteja habilitado
ru: Для параметра "--report-trx-filename" требуется включить "--report-trx"
tr: '--report-trx-filename', '--report-trx'in etkinleştirilmesini gerektirir
zh_hans: “--report-trx-filename”需要启用“--report-trx”
zh_hant: '--report-trx-filename' 需要啟用 '--report-trx'

# TrxReportFileNameShouldNotContainPath
source: file name argument must not contain path (e.g. --report-trx-filename myreport.trx)
cs: Argument názvu souboru nesmí obsahovat cestu (například --report-trx-filename myreport.trx).
de: Das Dateinamenargument darf keinen Pfad enthalten (z. B. --report-trx-filename myreport.trx).
es: el argumento de nombre de archivo no debe contener la ruta de acceso (por ejemplo, --report-trx-filename myreport.trx)
fr: L'argument du nom de fichier ne doit pas contenir de chemin (par exemple --report-trx-filename myreport.trx)
it: l'argomento del nome del file non deve contenere il percorso (ad esempio --report-trx-filename myreport.trx)
ja: ファイル名引数にパスを含めることはできません (例: --report-trx-filename myreport.trx)
ko: 파일 이름 인수는 경로를 포함해서는 안 됩니다(예: --report-trx-filename myreport.trx).
pl: argument nazwy pliku nie może zawierać ścieżki (np. --report-trx-filename myreport.trx)
pt_br: argumento de nome de arquivo não deve conter caminho (por exemplo, --report-trx-filename myreport.trx)
ru: аргумент имени файла не должен содержать путь (например, --report-trx-filename myreport.trx)
tr: dosya adı argümanı yol içermemelidir (e.g. --report-trx-filename myreport.trx)
zh_hans: 文件名参数不得包含路径(例如 --report-trx-filename myreport.trx)
zh_hant: 檔案名稱引數不能包含路徑 (例如 --report-trx-filename myreport.trx)

# TrxReportFrameworkDoesNotSupportTrxReportCapability
source: The test framework '{0}' with UID '{1}' does not support the 'ITrxReportCapability' leading to missing or incomplete TRX reports
cs: Testovací architektura {0} s UID {1} nepodporuje ITrxReportCapability, což vede k chybějícím nebo neúplným sestavám TRX.
de: Das Testframework "{0}" mit UID "{1}" unterstützt "ITrxReportCapability" nicht, was zu fehlenden oder unvollständigen TRX-Berichten führt.
es: El marco de pruebas '{0}' con UID '{1}' no admite 'ITrxReportCapability' que conduce a informes TRX que faltan o están incompletos
fr: Le framework de test '{0}' avec l'UID '{1}' ne prend pas en charge 'ITrxReportCapability', ce qui entraîne des rapports TRX manquants ou incomplets
it: Il framework di test '{0}' con UID '{1}' non supporta 'ITrxReportCapability' causando report TRX mancanti o incompleti
ja: UID '{1}' のテスト フレームワーク '{0}' は 'ITrxReportCapability' をサポートしていないため、TRX レポートが見つからないか不完全です
ko: UID가 '{1}'인 테스트 프레임워크 '{0}'은(는) 'ITrxReportCapability'를 지원하지 않으므로 TRX 보고서가 없거나 불완전합니다.
pl: Struktura testowa „{0}” o identyfikatorze UID „{1}” nie obsługuje elementu „ITrxReportCapability”, co prowadzi do brakujących lub niekompletnych raportów TRX
pt_br: A estrutura de teste ''{0}'' com UID ''{1}'' não dá suporte a ''ITrxReportCapability'' levando a relatórios TRX ausentes ou incompletos
ru: Платформа тестирования "{0}" с идентификатором пользователя "{1}" не поддерживает "ITrxReportCapability", поэтому отчеты TRX не будут создаваться или будут неполными
tr: UID '{0}' olan '{1}' test çerçevesi eksik veya eksik TRX raporlarına yol açarak 'ITrxReportCapability' öğesini desteklemez
zh_hans: UID 为“{1}”的测试框架“{0}”不支持“ITrxReportCapability”，将导致 TRX 报告丢失或不完整
zh_hant: 具有 UID '{1}' 的測試架構 '{0}' 不支援導致 TRX 報告遺漏或不完整的 'ITrxReportCapability'

# TrxReportGeneratorBeforeTestHostProcessStartAsyncNotCalled
source: Method 'BeforeTestHostProcessStartAsync' must be called before 'OnTestHostProcessStartedAsync'
cs: Před metodou OnTestHostProcessStartedAsync musí být volána metoda BeforeTestHostProcessStartAsync.
de: Die Methode "BeforeTestHostProcessStartAsync" muss vor "OnTestHostProcessStartedAsync" aufgerufen werden
es: Se debe llamar al método 'BeforeTestHostProcessStartAsync' antes de 'OnTestHostProcessStartedAsync'
fr: La méthode 'BeforeTestHostProcessStartAsync' doit être appelée avant 'OnTestHostProcessStartedAsync'
it: Il metodo 'BeforeTestHostProcessStartAsync' deve essere chiamato prima di 'OnTestHostProcessStartedAsync'.
ja: 'OnTestHostProcessStartedAsync' の前にメソッド 'BeforeTestHostProcessStartAsync' を呼び出す必要があります
ko: 'BeforeTestHostProcessStartAsync' 메서드는 'OnTestHostProcessStartedAsync' 전에 호출해야 합니다.
pl: Metoda „BeforeTestHostProcessStartAsync” musi być wywołana przed elementem „OnTestHostProcessStartedAsync”
pt_br: O método ''BeforeTestHostProcessStartAsync'' deve ser chamado antes de ''OnTestHostProcessStartedAsync''
ru: Метод "BeforeTestHostProcessStartAsync" должен вызываться до "OnTestHostProcessStartedAsync"
tr: 'BeforeTestHostProcessStartAsync' metodu 'OnTestHostProcessStartedAsync' öğesinden önce çağrılmalıdır
zh_hans: 必须在“OnTestHostProcessStartedAsync”之前调用方法“BeforeTestHostProcessStartAsync”
zh_hant: 'BeforeTestHostProcessStartAsync' 方法必須在 'OnTestHostProcessStartedAsync' 之前呼叫

# TrxReportGeneratorDescription
source: Produce a TRX report for the current test session
cs: Vytvořit sestavu TRX pro aktuální testovací relaci
de: Erstellt einen TRX-Bericht für die aktuelle Testsitzung
es: Generar un informe TRX para la sesión de prueba actual
fr: Produire un rapport TRX pour la session de test actuelle
it: Generare un rapporto TRX per la sessione di test corrente.
ja: 現在のテスト セッションの TRX レポートを生成する
ko: 현재 테스트 세션에 대한 TRX 보고서 생성
pl: Tworzenie raportu TRX dla bieżącej sesji testowej
pt_br: Produzir um relatório TRX para a sessão de teste atual
ru: Создавать отчет TRX для текущего тестового сеанса
tr: Mevcut test oturumu için bir TRX raporu oluşturun
zh_hans: 为当前测试会话生成 TRX 报表
zh_hant: 產生目前測試工作階段的 TRX 報告

# TrxReportGeneratorDisplayName
source: TRX report generator
cs: Generátor sestav TRX
de: TRX-Bericht-Generator
es: Generador de informes TRX
fr: Générateur de rapports TRX
it: Generatore di report TRX
ja: TRX レポート ジェネレーター
ko: TRX 보고서 생성기
pl: Generator raportów TRX
pt_br: Gerador de relatório TRX
ru: Генератор отчетов TRX
tr: TRX rapor oluşturucusu
zh_hans: TRX 报表生成器
zh_hant: TRX 報表產生器

# TrxReportGeneratorMissingTrxNamedPipeEnvironmentVariable
source: Required environment variable '{0}' is missing for TRX report generator
cs: Chybí požadovaná proměnná prostředí {0} pro generátor sestav TRX.
de: Die erforderliche Umgebungsvariable "{0}" fehlt für den TRX-Bericht-Generator.
es: Falta la variable de entorno necesaria '{0}' para el generador de informes TRX
fr: La variable d’environnement requise «{0}» est manquante pour le générateur de rapports TRX
it: Variabile di ambiente obbligatoria '{0}' mancante per il generatore di report TRX
ja: TRX レポート ジェネレーターに必要な環境変数 '{0}' がありません
ko: TRX 보고서 생성기에 필요한 환경 변수 '{0}'이(가) 없습니다.
pl: Brak wymaganej zmiennej środowiskowej „{0}” dla generatora raportów TRX
pt_br: A variável de ambiente necessária ''{0}'' está ausente para o gerador de relatório TRX
ru: Для генератора отчетов TRX отсутствует необходимая переменная среды "{0}"
tr: TRX rapor oluşturucu için gerekli ortam değişkeni '{0}' eksik
zh_hans: TRX 报表生成器缺少所需的环境变量“{0}”
zh_hant: TRX 報表產生器遺漏必要的環境變數 '{0}'

# TrxReportIsNotValidForDiscovery
source: '--report-trx' cannot be enabled when using '--list-tests'
cs: Možnost --report-trx nejde povolit, pokud se používá možnost --list-tests.
de: "--report-trx" kann bei Verwendung von "--list-tests" nicht aktiviert werden
es: '--report-trx' no se puede habilitar cuando se usa '--list-tests'
fr: '--report-trx' ne peut pas être activé lors de l'utilisation de '--list-tests'
it: Non è possibile abilitare '--report-trx' quando si usa '--list-tests'
ja: '--list-tests' を使用している場合、'--report-trx' を有効にすることはできません
ko: '--list-tests'를 사용하는 경우 '--report-trx'를 사용하도록 설정할 수 없습니다.
pl: Nie można włączyć polecenia „--report-trx” w przypadku używania polecenia „--list-tests”
pt_br: Não é possível habilitar ''--report-trx'' ao usar ''--list-tests''
ru: Невозможно включить "--report-trx" при использовании "--list-tests"
tr: '--list-tests' kullanılırken '--report-trx' etkinleştirilemez
zh_hans: 使用“--list-tests”时，无法启用“--report-trx”
zh_hant: 使用 '--list-tests' 時，無法啟用 '--report-trx'

# TrxReportOptionDescription
source: Enable generating TRX report
cs: Povolit vygenerování sestavy TRX
de: Generieren des TRX-Berichts aktivieren
es: Habilitación de la generación de informes TRX
fr: Activer la génération du rapport TRX
it: Abilitare la generazione del report TRX
ja: TRX レポートの生成を有効にする
ko: TRX 보고서 생성 사용
pl: Włącz generowanie raportu TRX
pt_br: Habilitar geração de relatório TRX
ru: Включить создание отчета TRX
tr: TRX raporu oluşturmayı etkinleştirin
zh_hans: 启用生成 TRX 报表
zh_hant: 啟用產生 TRX 報表

# UnsupportedRequestTypeErrorMessage
source: Requests of type '{0}' is not supported
cs: Žádosti typu {0} nejsou podporovány.
de: Anforderungen vom Typ "{0}" werden nicht unterstützt
es: No se admiten solicitudes de tipo '{0}'
fr: Les demandes de type «{0}» ne sont pas prises en charge
it: Le richieste di tipo '{0}' non sono supportate
ja: 型 '{0}' の要求はサポートされていません
ko: '{0}' 유형의 요청은 지원되지 않습니다.
pl: Żądania typu „{0}” nie są obsługiwane
pt_br: Não há suporte para solicitações de tipo ''{0}''
ru: Запросы типа "{0}" не поддерживаются
tr: '{0}' türündeki istek desteklenmiyor
zh_hans: 不支持类型为“{0}”的请求
zh_hant: 不支援類型 '{0}' 的要求

# TrxComparerToolDescription
source: This tool allows to compare and highlights differences between 2 TRX reports
de: Mit diesem Tool können Unterschiede zwischen 2 TRX-Berichten verglichen und hervorgehoben werden.
pt_br: Esta ferramenta permite comparar e definir diferenças entre dois relatórios TRX
tr: Bu araç, 2 TRX raporu arasındaki farkların karşılaştırılmasına ve vurgulanmasına olanak tanır
zh_hans: 此工具允许比较和突出显示 2 个 TRX 报表之间的差异
