Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Extensions.VSTestBridge/Resources/xlf/ExtensionResources.*.xlf
Languages: it, pl, tr

# MissingRunSettingsAttribute
source: Invalid .runsettings file, '<RunSettings>' attribute is missing
it: File .runsettings non valido. Attributo '<RunSettings>' mancante
pl: Nieprawidłowy plik .runsettings, brak atrybutu „<RunSettings>”
tr: Geçersiz .runsettings dosyası, '<RunSettings>' özniteliği eksik

# RunSettingsOptionDescription
source: The path, relative or absolute, to the .runsettings file. For more information and examples on how to configure test run, see https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#the-runsettings-file
it: Percorso, relativo o assoluto, del file con estensione runsettings. Per altre informazioni ed esempi su come configurare l'esecuzione dei test, vedere https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#the-runsettings-file
pl: Ścieżka względna lub bezwzględna pliku .runsettings. Aby uzyskać więcej informacji i przykładów dotyczących konfigurowania przebiegu testu, zobacz: https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#the-runsettings-file
tr: .runsettings dosyasının göreli veya mutlak yolu. Test çalıştırmasını yapılandırma hakkında daha fazla bilgi ve örnek için şu sayfaya bakın: https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#the-runsettings-file

# RunsettingsFileCannotBeRead
source: runsettings file '{0}' cannot be read
it: Non è possibile leggere il file runsettings '{0}'
pl: nie można odczytać pliku runsettings „{0}”
tr: '{0}' runsettings dosyası okunamıyor

# RunsettingsFileDoesNotExist
source: runsettings file '{0}' does not exist
it: Il file runsettings '{0}' non esiste
pl: plik runsettings „{0}” nie istnieje
tr: '{0}' runsettings dosyası mevcut değil

# TestCaseFilterOptionDescription
source: Filters tests using the given expression. For more information, see the Filter option details section. For more information and examples on how to use selective unit test filtering, see https://learn.microsoft.com/dotnet/core/testing/selective-unit-tests.
it: Filtra i test usando l'espressione specificata. Per ulteriori informazioni, vedere la sezione dei dettagli dell'opzione Filtro. Per altre informazioni ed esempi su come usare il filtro selettivo unit test, vedere https://learn.microsoft.com/dotnet/core/testing/selective-unit-tests.
pl: Filtruje testy przy użyciu danego wyrażenia. Aby uzyskać więcej informacji, zobacz sekcję szczegółów opcji filtru. Aby uzyskać więcej informacji i przykładów dotyczących używania selektywnego filtrowania testów jednostkowych, zobacz: https://learn.microsoft.com/dotnet/core/testing/selective-unit-tests.
tr: Belirtilen ifadeyi kullanarak testleri filtreler. Daha fazla bilgi için Filtre seçeneği ayrıntıları bölümüne bakın. Seçici birim testi filtreleme hakkında daha fazla bilgi ve örnek için şu sayfaya bakın: https://learn.microsoft.com/dotnet/core/testing/selective-unit-tests.

# TestRunParameterOptionArgumentIsNotParameter
source: argument '{0}' is not a parameter. Parameters arguments are matching the following pattern 'key=value'.
it: l'argomento '{0}' non è un parametro. Gli argomenti dei parametri corrispondono al criterio 'key=value' seguente.
pl: argument „{0}” nie jest parametrem. Argumenty parametrów pasują do następującego wzorca „klucz=wartość”.
tr: '{0}' bağımsız değişkeni bir parametre değil. Parametre bağımsız değişkenleri aşağıdaki 'key=value' deseniyle eşleşiyor.

# TestRunParameterOptionDescription
source: Specify or override a key-value pair parameter. For more information and examples, see https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#testrunparameters
it: Specificare o eseguire l'override di un parametro di coppia chiave-valore. Per altre informazioni ed esempi, vedere https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#testrunparameters
pl: Określ lub zastąp parametr pary klucz-wartość. Aby uzyskać więcej informacji i przykładów, zobacz stronę https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#testrunparameters
tr: Anahtar-değer çifti parametresi belirtin veya geçersiz kılın. Daha fazla bilgi ve örnek için şu sayfaya bakın: https://learn.microsoft.com/visualstudio/test/configure-unit-tests-by-using-a-dot-runsettings-file#testrunparameters

# UnsupportedRunconfigurationSetting
source: Runsettings attribute '{0}' is not supported by Microsoft.Testing.Platform and will be ignored
it: L’attributo Runsettings ‘{0}’ non è supportato da Microsoft.Testing.Platform e verrà ignorato
pl: Atrybut runsettings „{0}” nie jest obsługiwany przez element Microsoft.Testing.Platform i zostanie zignorowany.
tr: '{0}' çalıştırma ayarı özniteliği Microsoft.Testing.Platform tarafından desteklenmiyor ve yoksayılacak

# UnsupportedRunsettingsDatacollectors
source: Runsettings datacollectors are not supported by Microsoft.Testing.Platform and will be ignored
it: I datacollector Runsettings non sono supportati da Microsoft.Testing.Platform e verranno ignorati
pl: Kolektory danych Runsettings nie są obsługiwane przez element Microsoft.Testing.Platform i będą ignorowane
tr: Çalıştırma ayarı veri toplayıcıları Microsoft.Testing.Platform tarafından desteklenmiyor ve yoksayılacak

# UnsupportedRunsettingsLoggers
source: Runsettings loggers are not supported by Microsoft.Testing.Platform and will be ignored
it: I logger Runsettings non sono supportati da Microsoft.Testing.Platform e verranno ignorati
pl: Rejestratory Runsettings nie są obsługiwane przez element Microsoft.Testing.Platform i będą ignorowane.
tr: Çalıştırma ayarı günlükçüleri Microsoft.Testing.Platform tarafından desteklenmiyor ve yoksayılacak

# VSTestBridgedTestFrameworkSessionAlreadyCreatedErrorMessage
source: The bridged framework supports only one session at a time. A session with UID {0} is already open.
it: Il framework bridged supporta solo una sessione alla volta. Una sessione con UID {0} è già aperta.
pl: Platforma mostkowania obsługuje tylko jedną sesję naraz. Sesja z identyfikatorem UID {0} jest już otwarta.
tr: Köprülü çerçeve aynı anda yalnızca bir oturumu destekler. UID'si {0} olan bir oturum zaten açık.
