Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Platform.MSBuild/Resources/xlf/MSBuildResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ActualValue
source: Actual value: {0}
cs: Skutečná hodnota: {0}
de: Tatsächlicher Wert: {0}
es: Valor real: {0}
fr: Valeur réelle : {0}
it: Valore effettivo: {0}
ja: 実際の値: {0}
ko: 실제 값: {0}
pl: Wartość rzeczywista: {0}.
pt_br: Valor real: {0}
ru: Действительное значение: {0}
tr: Gerçek değer: {0}
zh_hans: 实际值: {0}
zh_hant: 實際值: {0}

# ExpectedValue
source: Expected value: {0}
cs: Očekávaná hodnota: {0}
de: Erwarteter Wert: {0}
es: Valor esperado: {0}
fr: Valeur attendue : {0}
it: Valore previsto: {0}
ja: 想定された値: {0}
ko: 예상 값: {0}
pl: Oczekiwana wartość: {0}.
pt_br: Valor esperado: {0}
ru: Ожидаемое значение: {0}
tr: Beklenen değer: {0}
zh_hans: 预期的值: {0}
zh_hant: 預期的值: {0}

source: Failed
cs: Neúspěšné
de: Fehler
es: Error
fr: Échec
it: Errore
ja: 失敗
ko: 실패
pl: Niepowodzenie
pt_br: Com falha
ru: Сбой
tr: Başarısız
zh_hans: 失败
zh_hant: 失敗

# FailedTestDetail
source: Failed test '{0}', reason '{1}'
cs: Neúspěšný test: {0}, důvod: {1}
de: Fehler bei Test "{0}", Ursache "{1}"
es: Error en la prueba '{0}', motivo '{1}'
fr: Échec du test « {0} », raison « {1} »
it: Test '{0}' non riuscito, motivo '{1}'
ja: 失敗したテスト '{0}'、理由 '{1}'
ko: 테스트 '{0}' 실패, 이유 '{1}'
pl: Test zakończony niepowodzeniem „{0}”. Przyczyna: „{1}”
pt_br: Falha no teste ''{0}'', motivo ''{1}''
ru: Неудачный тест "{0}" , причина "{1}"
tr: Başarısız test '{0}', neden '{1}'
zh_hans: 测试“{0}”失败，原因为“{1}”
zh_hant: 測試 '{0}' 失敗，原因 '{1}'

# FullPathToolCalculationFailed
source: Full path tool calculation failed. Runner '{0}'
cs: Výpočet úplné cesty nástroje se nezdařil. Spouštěč {0}
de: Fehler bei der Berechnung des vollständigen Pfadtools Runner „{0}“
es: El cálculo de la herramienta de ruta de acceso completa es incorrecto. Runner '{0}'
fr: Désolé... Nous n’avons pas pu effectuer le calcul d’outil de chemin complet. Exécuteur « {0} »
it: Calcolo del percorso completo dello strumento non riuscito. Strumento di esecuzione '{0}'
ja: 完全なパス ツールの計算に失敗しました。ランナー '{0}'
ko: 전체 경로 도구를 계산하지 못했습니다. 러너 '{0}'
pl: Obliczanie narzędzia pełnej ścieżki nie powiodło się. Moduł uruchamiający „{0}”
pt_br: Falha no cálculo da ferramenta de caminho completo. Executor “{0}”
ru: Сбой вычисления средства полного пути. Средство выполнения тестов "{0}"
tr: Tam yol aracı hesaplaması başarısız. Çalıştırıcı '{0}'
zh_hans: 完整路径工具计算失败。运行器“{0}”
zh_hant: 完整路徑工具計算失敗。執行器 '{0}'

# InvalidTargetPath
source: Invalid TargetPath, {0}
cs: Neplatná hodnota TargetPath, {0}
de: Ungültiger TargetPath, {0}
es: TargetPath no válido, {0}
fr: TargetPath non valide, {0}
it: TargetPath non valido, {0}
ja: 無効な TargetPath、{0}
ko: 잘못된 TargetPath, {0}
pl: Nieprawidłowa ścieżka docelowa, {0}
pt_br: TargetPath inválido, {0}
ru: Недопустимый TargetPath, {0}
tr: Geçersiz TargetPath, {0}
zh_hans: TargetPath {0} 无效
zh_hant: TargetPath 無效，{0}

# MSBuildExtensionsDescription
source: Extension used to pass parameters from MSBuild node and the hosts
cs: Rozšíření používané k předání parametrů z uzlu MSBuild a hostitelů
es: Extensión usada para pasar parámetros desde el nodo de MSBuild y los hosts
it: Estensione usata per passare parametri dal nodo MSBuild e dagli host
ja: MSBuild ノードおよびホストからパラメーターを渡すために使用される拡張機能
pt_br: Extensão usada para passar parâmetros do nó do MSBuild e dos hosts
ru: Расширение, используемое для передачи параметров с узла MSBuild и из основных элементов
tr: MSBuild düğümünden ve konaklardan parametreleri geçirmek için kullanılan uzantı
zh_hans: 用于从 MSBuild 节点和主机传递参数的扩展

source: Passed
cs: Úspěšné
de: Bestanden
es: Correcta
fr: Réussite
it: Superato
ja: 成功
ko: 통과
pl: Powodzenie
pt_br: Aprovado
ru: Пройден
tr: Başarılı
zh_hans: 已通过
zh_hant: 成功

# RunTests
source: Run tests: '{0}' [{1}|{2}]
cs: Spustit testy: {0} [{1}|{2}]
de: Tests ausführen: "{0}" [{1}|{2}]
es: Ejecutar pruebas: '{0}' [{1}|{2}]
fr: Exécuter des tests : « {0} » [{1}|{2}]
it: Esegui test: '{0}' [{1}|{2}]
ja: テストの実行: '{0}' [{1}|{2}]
ko: 테스트 실행: '{0}' [{1}|{2}]
pl: Uruchom testy: „{0}” [{1}|{2}]
pt_br: Executar testes: ''{0}'' [{1}|{2}]
ru: Запуск тестов: "{0}" [{1}|{2}]
tr: Testleri çalıştırın: '{0}' [{1}|{2}]
zh_hans: 运行测试:“{0}”[{1}|{2}]
zh_hant: 執行測試: '{0}' [{1}|{2}]

source: Stack Trace:
cs: Trasování zásobníku:
de: Stapelüberwachung:
es: Seguimiento de la pila:
fr: Arborescence des appels de procédure :
it: Analisi dello stack:
ja: スタック トレース:
ko: 스택 추적:
pl: Ślad stosu:
pt_br: Rastreamento de Pilha:
ru: Трассировка стека:
tr: Yığın İzleme:
zh_hans: 堆栈跟踪:
zh_hant: 堆疊追蹤:

# Summary
source: {0}! - Failed: {1}, Passed: {2}, Skipped: {3}, Total: {4}, Duration: {5}
cs: {0}! – neúspěšné: {1}, úspěšné: {2}, přeskočené: {3}, celkem: {4}, doba trvání: {5}
de: {0}! - Fehlgeschlagen: {1}, Erfolgreich: {2}, Übersprungen: {3}, Gesamt: {4}, Dauer: {5}
es: {0}. Error: {1}, Correcto: {2}, Omitido: {3}, Total: {4}, Duración: {5}
fr: {0}! – Échec : {1}, Passé : {2}, Ignoré : {3}, Total : {4}, Durée : {5}
it: {0}! - Non superati: {1}, Superati: {2}, Ignorati: {3}, Totali: {4}, Durata: {5}
ja: {0}! - 不合格: {1}、合格: {2}、スキップ: {3}、合計: {4}、期間: {5}
ko: {0}! - 실패: {1}, 통과: {2}, 건너뜀: {3}, 합계: {4}, 기간: {5}
pl: {0}! - Niepowodzenie: {1}, Przekazano: {2}, Pominięto: {3}, Łącznie: {4}, Czas trwania: {5}
pt_br: {0}! - Falhou: {1}, Aprovado: {2}, Ignorado: {3}, Total: {4}, Duração: {5}
ru: {0}! — не пройдено: {1}, пройдено: {2}, пропущено: {3}, всего: {4}, длительность: {5}
tr: {0}! - Başarısız: {1}, Başarılı: {2}, Atlandı: {3}, Toplam: {4}, Süre: {5}
zh_hans: {0}! - 失败: {1}，通过: {2}，已跳过: {3}，总计: {4}，持续时间: {5}
zh_hant: {0}! - 失敗: {1}，通過: {2}，跳過: {3}，總計: {4}，持續時間: {5}

# TestFailed
source: Tests failed: '{0}' [{1}|{2}]
cs: Testy selhaly: {0}[{1}|{2}]
de: Fehler bei Tests: "{0}" [{1}|{2}]
es: Error en las pruebas: '{0}' [{1}|{2}]
fr: Échec des tests : « {0} » [{1}|{2}]
it: Test non riusciti: '{0}' [{1}|{2}]
ja: テスト失敗: '{0}' [{1}|{2}]
ko: 테스트 실패: '{0}' [{1}|{2}]
pl: Niezaliczone testy: „{0}” [{1}|{2}]
pt_br: Testes com falha: ''{0}'' [{1}|{2}]
ru: Неудачных тестов: "{0}" [{1}|{2}]
tr: Testler başarısız oldu: '{0}' [{1}|{2}]
zh_hans: 测试失败:“{0}”[{1}|{2}]
zh_hant: 測試失敗: '{0}' [{1}|{2}]

# TestFailedNoDetail
source: Tests failed: {0}
cs: Testy selhaly: {0}
de: Fehler bei Tests: {0}
es: Error en las pruebas: {0}
fr: Échec des tests : {0}
it: Test non riusciti: {0}
ja: テスト失敗: {0}
ko: 테스트 실패: {0}
pl: Niezaliczone testy: {0}
pt_br: Testes com falha: {0}
ru: Неудачных тестов: {0}
tr: Testler başarısız oldu: {0}
zh_hans: 测试失败: {0}
zh_hant: 測試失敗: {0}

# TestsSucceeded
source: Tests succeeded: '{0}' [{1}|{2}]
cs: Úspěšné testy: {0} [{1}|{2}]
de: Erfolgreiche Tests: "{0}" [{1}|{2}]
es: Pruebas correctas: '{0}' [{1}|{2}]
fr: Tests réussis : « {0} » [{1}|{2}]
it: Test completati: '{0}' [{1}|{2}]
ja: テスト成功: '{0}' [{1}|{2}]
ko: 테스트 성공: '{0}' [{1}|{2}]
pl: Testy zakończone powodzeniem: „{0}” [{1}|{2}]
pt_br: Testes bem-sucedidos: ''{0}'' [{1}|{2}]
ru: Успешно выполненные тесты: "{0}" [{1}|{2}]
tr: Başarılı testler: '{0}' [{1}|{2}]
zh_hans: 成功的测试:“{0}”[{1}|{2}]
zh_hant: 測試成功: '{0}' [{1}|{2}]

# IncompatibleArchitecture
source: Could not find '{0}' host for the '{1}' architecture. You can resolve the problem by installing the '{1}' .NET. The specified framework can be found at: - https://aka.ms/dotnet-download
de: Der Host „{0}“ für die Architektur „{1}“ wurde nicht gefunden. Sie können das Problem beheben, indem Sie das .NET „{1}“ installieren. Das angegebene Framework finden Sie unter: - https://aka.ms/dotnet-download
fr: Nous n'avons pas trouvé l’hôte '{0}' de l’architecture '{1}'. Vous pouvez résoudre le problème en installant '{1}' .NET. L’infrastructure spécifiée se trouve à l’adresse suivante : - https://aka.ms/dotnet-download
ko: '{1}' 아키텍처에 대한 '{0}' 호스트를 찾을 수 없습니다. '{1}' .NET을 설치하여 문제를 해결할 수 있습니다. 다음 위치에서 지정된 프레임워크를 찾을 수 있습니다. - https://aka.ms/dotnet-download
pl: Nie można odnaleźć hosta „{0}” dla architektury „{1}”. Problem można rozwiązać, instalując program .NET „{1}”. Określoną strukturę można znaleźć pod adresem: - https://aka.ms/dotnet-download
zh_hant: 找不到 '{1}' 結構的 '{0}' 主機。 您可以安裝 '{1}' .NET 來解決問題。 您可以在以下位置找到指定的架構: - https://aka.ms/dotnet-download
