Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Extensions.HangDump/Resources/xlf/ExtensionResources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CreatingDumpFile
source: Creating dump file '{0}'
cs: Vytváří se soubor výpisu paměti {0}.
de: Speicherabbilddatei "{0}" wird erstellt
es: Creando archivo de volcado '{0}'
it: Creazione del file di dump '{0}'
ja: ダンプ ファイル '{0}' を作成しています
ko: 덤프 파일 '{0}'을(를) 만드는 중
pl: Tworzenie pliku zrzutu „{0}”
pt_br: Criando arquivo de despejo ''{0}''
ru: Создание файла дампа "{0}"
tr: Döküm dosyası '{0}' oluşturuluyor
zh_hans: 正在创建转储文件“{0}”
zh_hant: 正在建立傾印檔案 '{0}'

# HangDumpArtifactDescription
source: The hang dump file
cs: Soubor výpisu paměti při zablokování
de: Die Absturzspeicherabbilddatei
es: El archivo de volcado de memoria
it: Il file di dump di blocco
ja: ハング ダンプ ファイル
ko: 중단 덤프 파일
pl: Plik zrzutu zawieszenia
pt_br: O arquivo de despejo de travamento
ru: Файл дампа зависания
tr: Askıda kalma dökümü dosyası
zh_hans: 挂起转储文件
zh_hant: 擱置傾印檔案

# HangDumpArtifactDisplayName
source: Hang dump file
cs: Soubor výpisu paměti při zablokování
de: Absturzspeicherabbilddatei
es: Archivo de volcado de bloqueo
it: File dump di blocco
ja: ハング ダンプ ファイル
ko: 중단 덤프 파일
pl: Zawieszanie pliku zrzutu
pt_br: Arquivo de despejo de travamento
ru: Файл дампа зависания
tr: Döküm dosyasını as
zh_hans: 挂起转储文件
zh_hant: 擱置傾印檔案

# HangDumpEnvironmentVariableInvalidValueErrorMessage
source: Environment variable '{0}' is set to '{1}' instead of '{2}'
cs: Proměnná prostředí {0} je nastavená na {1} místo na {2}.
de: Umgebungsvariable "{0}" ist auf "{1}" anstatt auf "{2}" festgelegt.
es: La variable de entorno '{0}' se establece en '{1}' en lugar de '{2}'
it: La variabile di ambiente '{0}' è impostata su '{1}' anziché su '{2}'
ja: 環境変数 '{0}' は '{2}' ではなく '{1}' に設定されています
ko: 환경 변수 '{0}'이(가) '{2}' 대신 '{1}'로 설정되어 있습니다.
pl: Zmienna środowiskowa „{0}” jest ustawiona na wartość „{1}” zamiast „{2}”
pt_br: A variável de ambiente ''{0}'' ambiente está definida como ''{1}'' em vez de ''{2}''
ru: Переменной среды "{0}" присвоено значение "{1}" вместо "{2}"
tr: '{0}' ortam değişkeni '{1}' yerine '{2}' olarak ayarlandı
zh_hans: 环境变量“{0}”设置为“{1}”，而不是“{2}”
zh_hant: 環境變數 '{0}' 已設定為 '{1}' 而不是 '{2}'

# HangDumpEnvironmentVariableIsMissingErrorMessage
source: Environment variable '{0}' is not set
cs: Není nastavená proměnná prostředí {0}.
de: Die Umgebungsvariable "{0}" wurde nicht festgelegt
es: La variable de entorno '{0}' no está establecida
it: La variabile di ambiente '{0}' non è impostata
ja: 環境変数 '{0}' が設定されていません
ko: 환경 변수 ‘{0}’이(가) 설정되지 않았습니다.
pl: Zmienna środowiskowa „{0}” nie jest ustawiona
pt_br: A variável de ambiente ''{0}'' não está definida
ru: Переменная среды "{0}" не задана
tr: '{0}' ortam değişkeni ayarlı değil
zh_hans: 未设置环境变量“{0}”
zh_hant: 未設定環境變數 '{0}'

# HangDumpExtensionDescription
source: Produce hang dump files when a test execution exceed a given time.
cs: Vytvoří soubory výpisu paměti při zablokování, když provádění testu překročí danou dobu.
de: Absturzspeicherabbilddateien erstellen, wenn eine Testausführung eine angegebene Zeit überschreitet.
es: Genere archivos de volcado de memoria cuando una ejecución de prueba supere un tiempo determinado.
it: Genera file di dump di blocco quando l'esecuzione di un test supera un determinato periodo di tempo.
ja: テストの実行が指定された時間を超えたときにハング ダンプ ファイルを生成します。
ko: 테스트 실행이 지정된 시간을 초과하면 중단 덤프 파일을 생성합니다.
pl: Utwórz pliki zrzutu zawieszenia, gdy wykonanie testu przekroczy dany czas.
pt_br: Produzir arquivos de despejo de travamento quando uma execução de teste exceder um determinado tempo.
ru: Создавать файлы дампа зависания при превышении заданного времени выполнения теста.
tr: Bir test yürütmesi belirli bir süreyi aştığında askıda kalan döküm dosyaları üretin.
zh_hans: 当测试执行超过给定时间时生成挂起转储文件。
zh_hant: 當測試執行超過指定時間時，產生擱置傾印檔案。

# HangDumpExtensionDisplayName
source: Hang dump
cs: Výpis paměti při zablokování
de: Absturzspeicherabbild
es: Volcado de memoria
it: Dump di blocco
ja: ハング ダンプ
ko: 덤프 중단
pl: Zrzut zawieszenia
pt_br: Despejo de travamento
ru: Дамп зависания
tr: Askı dökümü
zh_hans: 挂起转储
zh_hant: 擱置傾印

# HangDumpFailed
source: The following exception occurred while taking hang dump: {0} Disk info: {1}
it: Durante l'esecuzione del dump di blocco si è verificata l'eccezione seguente: {0} Informazioni sul disco: {1}

# HangDumpFileNameOptionDescription
source: Specify the name of the dump file
cs: Zadejte název souboru výpisu paměti.
de: Namen der Speicherabbilddatei angeben
es: Especificar el nombre del archivo de volcado
it: Specificare il nome del file di dump
ja: ダンプ ファイルの名前を指定する
ko: 덤프 파일의 이름 지정
pl: Określ nazwę pliku zrzutu
pt_br: Especifique o nome do arquivo de despejo
ru: Укажите имя файла дампа зависания
tr: Döküm dosyasının adını belirtin
zh_hans: 指定转储文件的名称
zh_hant: 指定傾印檔案的名稱

# HangDumpOptionDescription
source: Generate a dump file if the test process hangs
cs: Vygeneruje soubor výpisu paměti, pokud testovací proces přestane reagovat.
de: Speicherabbilddatei generieren, wenn der Testprozess abstürzt
es: Generar un archivo de volcado si el proceso de prueba se bloquea
it: Generare un file di dump se il processo di test si blocca
ja: テスト プロセスがハングした場合にダンプ ファイルを生成する
ko: 테스트 프로세스가 중단되면 덤프 파일 생성
pl: Wygeneruj plik zrzutu, jeśli proces testowy zawiesza się
pt_br: Gerar um arquivo de despejo se o processo de teste travar
ru: Создавать файл дампа, если тестовый процесс завис
tr: Test işlemi kilitlenirse bir döküm dosyası oluşturun
zh_hans: 如果测试进程挂起，则生成转储文件
zh_hant: 如果測試程序擱置，則產生傾印檔案

# HangDumpTimeoutExpired
source: Hang dump timeout of '{0}' expired
cs: Vypršel časový limit {0} pro výpis paměti při zablokování.
de: Timeout für Absturzspeicherabbild von "{0}" abgelaufen
es: Tiempo de espera de volcado de bloqueo de '{0}' expirado
it: Timeout dump di blocco di '{0}' scaduto
ja: '{0}' のハング ダンプ タイムアウトの有効期限が切れました
ko: '{0}'의 중단 덤프 시간 제한이 만료되었습니다.
pl: Upłynął limit czasu zrzutu zawieszenia „{0}”
pt_br: Tempo limite de despejo de travamento de ''{0}'' expirado
ru: Истекло время ожидания дампа зависания "{0}"
tr: '{0}' dökümünün askıda kalma zaman aşımı süresi doldu
zh_hans: 挂起转储超时“{0}”已过期
zh_hant: '{0}' 的擱置傾印逾時已過期

# HangDumpTimeoutOptionDescription
source: Specify the timeout after which the dump will be generated. The timeout value is specified in one of the following formats: 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes, 5400s, 5400sec, 5400second, 5400seconds. Default is 30m.
de: Geben Sie das Timeout an, nach dem das Speicherabbild generiert wird. Der Timeoutwert wird in einem der folgenden Formate angegeben: 1,5 h, 1,5 Stunde, 1,5 Stunden, 90 m, 90 Min., 90 Minute, 90 Minuten, 5400 s, 5400 Sek, 5400 Sekunde, 5400 Sekunden. Der Standardwert ist 30m.
it: Specificare il timeout dopo il quale verrà generato il dump. Il valore del timeout è specificato in uno dei formati seguenti: 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes, 5400s, 5400sec, 5400second, 5400seconds. L’impostazione predefinita è 30m.
pt_br: Especifique o tempo limite após o qual o despejo será gerado. O valor de tempo limite é especificado em um dos seguintes formatos: 1.5h, 1,5hora, 1,5horas, 90m, 90min, 90minuto, 90minutos 5400s, 5400seg, 5400segundo, 5400segundos. O padrão é 30m.

# HangDumpTimeoutOptionInvalidArgument
source: '--hangdump-timeout' expects a single timeout argument
cs: --hangdump-timeout očekává jeden argument časového limitu.
de: "--hangdump-timeout" erwartet ein einzelnes Timeoutargument.
es: '--hangdump-timeout' espera un único argumento de tiempo de espera
it: '--hangdump-timeout' prevede un singolo argomento di timeout
ja: '--hangdump-timeout' には 1 つのタイムアウト引数が必要です
ko: '--hangdump-timeout'에는 단일 시간 제한 인수가 필요합니다.
pl: Element „--hangdump-timeout” oczekuje pojedynczego argumentu limitu czasu
pt_br: ''--hangdump-timeout'' espera um único argumento de tempo limite
ru: "--hangdump-timeout" ожидает один аргумент времени ожидания
tr: '--hangdump-timeout' tek bir zaman aşımı bağımsız değişkeni bekliyor
zh_hans: “--hangdump-timeout”需要单一超时参数
zh_hant: '--hangdump-timeout' 需要單一逾時引數

# HangDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' (only available in .NET 6+) or 'Full'. Default type is 'Full'
de: Geben Sie den Typ des Speicherabbilds an. Gültige Werte sind "Mini", "Heap", "Triage" (nur in .NET 6 und höher verfügbar) oder "Full". Der Standardtyp ist "Full".
es: Especifique el tipo de volcado. Los valores válidos son "Mini", "Heap", "Triage" (solo disponible en .NET 6+) o "Full". El tipo predeterminado es 'Full'
it: Specificare il tipo di dump. I valori validi sono 'Mini', 'Heap', 'Triage' (disponibile solo in .NET 6+) o 'Full'. Il tipo predefinito è 'Full'
pt_br: Especifique o tipo de despejo. Os valores válidos são ''Mini'', ''Heap'', ''Triage'' (disponível somente no .NET 6+) e ''Full'' O tipo padrão é ''Full''
ru: Укажите тип дампа. Допустимые значения: "Mini", "Heap", "Triage" (доступно только в .NET 6+) или "Full". Тип по умолчанию — "Full"
zh_hans: 指定转储的类型。有效值为“Mini”、“Heap”、“Triage”(仅适用于 .NET 6+)或“Full”。默认类型为“Full”

# HangDumpTypeOptionInvalidType
source: '{0}' is not a valid dump type. Valid options are 'Mini', 'Heap', 'Triage' (only available in .NET 6+) and 'Full'
de: "{0}" ist kein gültiger Speicherabbildtyp. Gültige Optionen sind "Mini", "Heap", "Triage" (nur in .NET 6 und höher verfügbar) und "Full".
es: '{0}' no es un tipo de volcado válido. Las opciones válidas son "Mini", "Montón", "Evaluación de prioridades" (solo disponible en .NET 6+) y "Full"
it: '{0}' non è un tipo di dump valido. Le opzioni valide sono 'Mini', 'Heap', 'Triage' (disponibile solo in .NET 6+) e 'Full'
pt_br: ''{0}'' não é um tipo de despejo válido. As opções válidas são ''Mini'', ''Heap'', ''Triage'' (disponível somente no .NET 6+) e ''Full''
ru: "{0}" не является допустимым типом дампа. Допустимые параметры: "Mini", "Heap", "Triage" (доступно только в .NET 6+) и "Full"
zh_hans: “{0}”不是有效的转储类型。有效选项为“Mini”、“Heap”、“Triage”(仅适用于 .NET 6+)和“Full”

# HangDumpUnsupportedRequestTypeErrorMessage
source: Request of type '{0}' is not supported
cs: Žádost typu {0} není podporována.
de: Anforderung vom Typ "{0}" wird nicht unterstützt
es: No se admite la solicitud de tipo '{0}'
it: La richiesta di tipo '{0}' non è supportata
ja: 型 '{0}' の要求はサポートされていません
ko: '{0}' 유형의 요청은 지원되지 않습니다.
pl: Żądanie typu „{0}” nie jest obsługiwane
pt_br: Não há suporte para a solicitação do tipo ''{0}''
ru: Запрос типа "{0}" не поддерживается
tr: '{0}' türündeki istek desteklenmiyor
zh_hans: 不支持类型为“{0}”的请求
zh_hant: 不支援類型 '{0}' 的要求

# HangTestListArtifactDescription
source: The list of tests that were running at the time of the hang
cs: Seznam testů spuštěných v době zablokování
de: Die Liste der Tests, die zum Zeitpunkt des Absturzes ausgeführt wurden.
es: Lista de pruebas que se estaban ejecutando en el momento del bloqueo
it: Elenco di test in esecuzione al momento del blocco
ja: ハング時に実行されていたテストの一覧
ko: 중단 시 실행된 테스트 목록입니다.
pl: Lista testów, które były uruchamiane w czasie zawieszenia
pt_br: A lista de testes que estavam sendo executados no momento do travamento
ru: Список тестов, которые были запущены во время зависания
tr: Askıya alınma anında çalışan testlerin listesi
zh_hans: 挂起时运行的测试列表
zh_hant: 擱置時正在執行的測試清單

# HangTestListArtifactDisplayName
source: Hang test list
cs: Seznam testů při zablokování
de: Liste der Tests bei Absturz
es: Lista de pruebas de bloqueo
it: Blocca elenco dei test
ja: ハング テスト リスト
ko: 테스트 목록 중단
pl: Lista testów zawieszenia
pt_br: Lista de testes de travamento
ru: Список тестов зависаний
tr: Askıda kalma test listesi
zh_hans: 挂起测试列表
zh_hant: 擱置測試清單

# MissingHangDumpMainOption
source: You specified one or more hang dump parameters but did not enable it, add --hangdump to the command line
cs: Zadali jste jeden nebo více parametrů výpisu stavu systému, ale nepovolili jste ho. Přidejte do příkazového řádku parametr --hangdump
de: Sie haben mindestens einen Parameter für das Absturzabbild angegeben, aber nicht aktiviert. Fügen Sie der Befehlszeile „--hangdump“ hinzu.
es: Ha especificado uno o varios parámetros de volcado de memoria, pero no los ha habilitado. Agregue --hangdump a la línea de comandos.
it: Sono stati specificati uno o più parametri del dump di blocco ma non sono stati abilitati. Aggiungere --hangdump alla riga di comando
ja: 1 つ以上のハング ダンプ パラメーターを指定しましたが、有効にしませんでした。コマンド ラインに --hangdump を追加してください
ko: 하나 이상의 중단 덤프 매개 변수를 지정했지만 사용하도록 설정하지 않았습니다. 명령줄에 --hangdump를 추가하세요.
pl: Określono co najmniej jeden parametr zrzutu zawieszenia, ale go nie włączono. Dodaj parametr --hangdump do wiersza polecenia
pt_br: Você especificou um ou mais parâmetros de hang dump, mas não os ativou, adicione --hangdump à linha de comando
ru: Вы указали один или несколько параметров дампа зависания, но не включили его. Добавьте --hangdump в командную строку
tr: Bir veya daha fazla askıda kalma dökümü parametresi belirtmenize rağmen bunu etkinleştirmediyseniz komut satırına --hangdump ekleyin
zh_hans: 你指定了一个或多个挂起转储参数，但未启用它，请将 --hangdump 添加到命令行
zh_hant: 您指定了一或多個停留傾印參數但並未加以啟用，請將 --hangdump 新增至命令列中

# MutexDoesNotExistErrorMessage
source: Cannot find mutex '{0}'
cs: Objekt mutex {0} nebyl nalezen.
de: Mutex "{0}" wurde nicht gefunden
es: No se encuentra la exclusión mutua '{0}'
it: Non è possibile trovare il mutex '{0}'
ja: ミューテックス '{0}' が見つかりません
ko: 뮤텍스 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć obiektu mutex „{0}”
pt_br: Não é possível localizar o mutex ''{0}''
ru: Не удается найти мьютекс "{0}".
tr: Muteks '{0}' bulunamıyor
zh_hans: 找不到互斥“{0}”
zh_hant: 找不到 Mutex '{0}'

# MutexNameReceptionTimeoutErrorMessage
source: Mutex name wasn't received after '{0}' seconds
cs: Název objektu mutex nebyl přijat po {0} s.
de: Der Mutexname wurde nach "{0}" Sekunden nicht empfangen.
es: No se recibió el nombre de exclusión mutua después de '{0}' segundos
it: Il nome del mutex non è stato ricevuto dopo '{0}' secondi
ja: '{0}' 秒後にミューテックス名が受信されませんでした
ko: '{0}' 초 후에 뮤텍스 이름을 받지 못했습니다.
pl: Nazwa obiektu Mutex nie została odebrana po „{0}” s
pt_br: O nome do mutex não foi recebido após ''{0}'' segundos
ru: Имя мьютекса не было получено через "{0}" секунд
tr: Mutex adı '{0}' saniyeden sonra alınamadı
zh_hans: “{0}”秒后未收到互斥名称
zh_hant: '{0}' 秒後未收到 Mutex 名稱

# RunningTestsWhileDumping
source: The following tests were still running when dump was taken (format: [<time-elapsed-since-start>] <name>):
cs: Při pořízení výpisu paměti stále běžely následující testy (formát: [<čas-uplynulý-od-spuštění>] <název>):
de: Die folgenden Tests wurden noch ausgeführt, als das Speicherabbild erstellt wurde (Format: [<time-elapsed-since-start>] <name>):
es: Las siguientes pruebas aún se estaban ejecutando cuando se realizó el volcado (formato: [<time-elapsed-since-start>] <name>):
it: I seguenti test erano ancora in esecuzione quando è stato eseguito il dump (formato: [<time-elapsed-since-start>] <name>):
ja: ダンプの取得時に次のテストがまだ実行されていました (形式: [<time-elapsed-since-start>] <name>):
ko: 덤프를 수행할 때 다음 테스트가 계속 실행되고 있었습니다(형식: [<time-elapsed-since-start>] <name>).
pl: Następujące testy były nadal uruchomione podczas wykonywania zrzutu (format: [<time-elapsed-since-start>] <name>):
pt_br: Os testes a seguir ainda estavam em execução quando o despejo foi realizado (formato: [<time-elapsed-since-start>] <name>):
ru: При создании дампа все еще выполнялись следующие тесты (формат: [<time-elapsed-since-start>] <name>):
tr: Döküm alındığında aşağıdaki testler hâlâ çalışıyordu (biçim: [<time-elapsed-since-start>] <name>):
zh_hans: 执行转储时，以下测试仍在运行(格式: [<time-elapsed-since-start>] <name>):
zh_hant: 執行傾印時，下列測試仍在執行 (格式: [<time-elapsed-since-start>] <name>):

# HangDumpTimeoutOptionDescription
source: Specify the timeout after which the dump will be generated. The timeout value is specified in one of the following formats: 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes 5400s, 5400sec, 5400second, 5400seconds. Default is 30m.
cs: Zadejte časový limit, po kterém bude vygenerován výpis paměti. Hodnota časového limitu se zadává v jednom z následujících formátů: 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes 5400s, 5400sec, 5400second, 5400seconds. Výchozí hodnota je 30m.
ja: ダンプが生成されるまでのタイムアウトを指定します。タイムアウト値は、次のいずれかの形式で指定されます 1.5h、1.5hour、1.5hours、90m、90min、90minute、90minutes、5400s、5400sec、5400second、5400seconds.。既定値は 30m です。
ko: 덤프가 생성되기 전까지의 시간 제한을 지정합니다. 시간 제한 값은 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes 5400s, 5400sec, 5400second, 5400seconds 형식 중 하나로 지정됩니다. 기본값은 30m입니다.
tr: Dökümün oluşturulacağı zaman aşımını belirtin. Zaman aşımı değeri şu formatlardan birinde belirtilir: 1,5 saat, 1,5 saat, 1,5 saat, 90 dakika, 90 dakika, 90 dakika, 90 dakika 5400s, 5400sn, 5400saniye, 5400saniye. Varsayılan değer 30m.

# HangDumpTypeOptionDescription
source: Specify the type of the dump. Valid values are 'Mini', 'Heap', 'Triage' (only available in .NET 6+) or 'Full'. Default type is 'Full'
cs: Zadejte typ výpisu paměti. Platné hodnoty jsou Mini, Heap, Triage (dostupné pouze v .NET 6+) nebo Full. Výchozí typ je Full.
ja: ダンプの型を指定します。有効な値は、'Mini'、'Heap'、'Triage' (.NET 6 以降でのみ利用可能)、または 'Full' です。既定の型は 'Full' です
ko: 덤프 유형을 지정하십시오. 유효한 값은 'Mini', 'Heap', 'Triage'(.NET 6 이상에서만 사용 가능) 또는 'Full'입니다. 기본 유형은 'Full'입니다.
tr: Dökümün türünü belirtin. Geçerli değerler 'Mini', 'Heap', 'Triage' (yalnızca .NET 6+'da mevcuttur) veya 'Full'dur. Varsayılan tür 'Tam'dır

# HangDumpTypeOptionInvalidType
source: '{0}' is not a valid dump type. Valid options are 'Mini', 'Heap', 'Triage' (only available in .NET 6+) and 'Full'
cs: {0} není platný typ výpisu paměti. Platné možnosti jsou Mini, Heap, Triage (k dispozici pouze v .NET 6+) a Full.
ja: '{0}' は有効なダンプの種類ではありません。有効なオプションは、'Mini'、'Heap'、'Triage' (.NET 6 以降でのみ利用可能)、'Full' です
ko: '{0}'은(는) 올바른 덤프 유형이 아닙니다. 유효한 옵션은 'Mini', 'Heap', 'Triage'(.NET 6 이상에서만 사용 가능) 및 'Full'입니다.
tr: '{0}' geçerli bir döküm türü değil. Geçerli seçenekler 'Mini', 'Heap', 'Triage' (yalnızca .NET 6+'da mevcuttur) ve 'Full’dur

# HangDumpTimeoutOptionDescription
source: Specify the timeout after which the dump will be generated. The timeout value is specified in one of the following formats: 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes, 5400s, 5400sec, 5400second, 5400seconds. Default is 30m.
es: Especifique el tiempo de espera después del cual se generará el volcado. El valor de tiempo de espera se especifica en uno de los formatos siguientes: 1.5h, 1.5hour, 1.5hours, 90m, 90min, 90minute, 90minutes 5400s, 5400sec, 5400second, 5400seconds. El valor predeterminado es 30 m.
ru: Укажите время ожидания, по истечении которого будет создан дамп. Значение времени ожидания указано в одном из следующих форматов: 1,5 ч, 1,5 часа, 90 м, 90 мин, 90 минут, 5400 с, 5400 сек, 5400 секунд. Значение по умолчанию — 30 м.
zh_hans: 指定生成转储后的超时。超时值以以下格式之一指定: 1.5h、1.5hour、1.5hours、90m、90min、90minute、90minutes 5400s、5400sec、5400second、5400seconds。默认值为 30m。
