Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Extensions.Retry/Resources/xlf/ExtensionResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FailedToCreateRetryDirectoryBecauseOfCollision
source: Failed to create retries directory due to collisions in '{0}' despite re-trying.
cs: Nepovedlo se vytvořit adresář opakovaných pokusů kvůli kolizím v adresáři {0}, a to ani přes opakované pokusy.
de: Fehler beim Erstellen des Wiederholungsverzeichnisses aufgrund von Konflikten in „{0}“ trotz erneuter Versuche.
es: No se pudo crear el directorio de reintentos debido a colisiones en '{0}' a pesar de volver a intentarlo.
fr: Échec de la création du répertoire des nouvelles tentatives en raison de collisions dans « {0} » malgré une nouvelle tentative.
it: Non è possibile creare la directory dei tentativi a causa di collisioni in “{0}” nonostante i tentativi ripetuti.
ja: 再試行中に '{0}' で競合が発生したため、再試行ディレクトリを作成できませんでした。
ko: 다시 시도에도 불구하고 '{0}'의 충돌로 인해 재시도 디렉터리를 만들지 못했습니다.
pl: Nie można utworzyć katalogu ponownych prób z powodu kolizji w katalogu „{0}” mimo ponownej próby.
pt_br: Falha ao criar o diretório de novas tentativas devido a colisões em '{0}', apesar das novas tentativas.
ru: Не удалось создать каталог повторов из-за конфликтов в '{0}' несмотря на повторную попытку.
tr: Yeniden denemeye rağmen '{0} ' içindeki çakışmalar nedeniyle yeniden deneme dizini oluşturulamadı.
zh_hans: 未能创建重试目录，因为尽管重试，但“{0}”中存在冲突。
zh_hant: 無法建立重試目錄，因為 '{0}' 中發生衝突，但仍在重試。

# FailureThresholdPolicy
source: Failure threshold policy is enabled, failed tests will not be restarted.
cs: Je povolena zásada prahové hodnoty selhání, neúspěšné testy se nerestartují.
de: Wenn die Richtlinie für fehlgeschlagene Tests aktiviert ist, werden fehlgeschlagene Tests nicht neu gestartet.
es: La directiva de umbral de errores está habilitada; no se reiniciarán las pruebas con errores.
fr: La stratégie de seuil d’échec est activée, les tests ayant échoué ne seront pas redémarrés.
it: Se il criterio della soglia di errore è abilitato, i test non riusciti non verranno riavviati.
ja: 失敗しきい値ポリシーが有効になっているため、失敗したテストは再開されません。
ko: 실패 임계값 정책을 사용하도록 설정했습니다. 실패한 테스트는 다시 시작되지 않습니다.
pl: Zasady progu błędów są włączone, a testy zakończone niepowodzeniem nie zostaną ponownie uruchomione.
pt_br: A política de limite de falha está habilitada, os testes com falha não serão reiniciados.
ru: Политика порога отказа включена, неудачные тесты не будут перезапущены.
tr: Hata eşiği ilkesi etkinleştirildi, başarısız testler yeniden başlatılmaz.
zh_hans: 已启用失败阈值策略，将不会重新启动失败的测试。
zh_hant: 已啟用失敗節流原則，將不會重新啟動失敗的測試。

# FailureThresholdPolicyMaxCount
source: Maximum failed tests threshold is {0} and {1} tests failed
cs: Prahová hodnota maximálního počtu neúspěšných testů je {0} a tento počet testů selhal: {1}.
de: Der Schwellenwert für die maximale Anzahl fehlerhafter Tests ist {0} und {1} Tests mit Fehlern
es: El umbral máximo de pruebas con errores es {0} y {1} pruebas erróneas
fr: Le seuil maximal des tests ayant échoué est {0} et {1} tests ont échoué
it: La soglia massima dei test non superati è {0} e i test {1} non sono riusciti
ja: 失敗したテストの最大しきい値は {0} で、{1} のテストが失敗しました
ko: 실패한 최대 테스트 임계값이 {0}이고 {1} 테스트가 실패했습니다.
pl: Próg maksymalnej liczby testów zakończonych niepowodzeniem to {0} i liczba testów zakończonych niepowodzeniem wyniosła {1}
pt_br: O limite máximo de testes com falha é {0} e {1} testes falharam
ru: Максимальное пороговое значение для неудачных тестов — {0}, и неудачных тестов — {1}
tr: Maksimum başarısız test eşiği {0} ve {1} test başarısız oldu
zh_hans: 最大失败测试阈值为 {0}，有 {1} 测试失败
zh_hant: 失敗的測試閾值上限是 {0}，有 {1} 個測試失敗

# FailureThresholdPolicyMaxPercentage
source: Percentage failed threshold is {0}% and {1}% tests failed ({2}/{3})
cs: Procentuální prahová hodnota selhání je {0} % a toto procento testů selhalo: {1} % ({2}/{3}).
de: Der Schwellenwert für den Prozentsatz fehlgeschlagener Tests ist {0} %, und {1} % Tests mit Fehlern ({2}/{3})
es: El umbral de porcentaje de errores es {0}% y {1}% de pruebas no superadas ({2}/{3})
fr: Le seuil de pourcentage d’échec est {0}% et {1}% de tests ont échoué ({2}/{3})
it: La soglia percentuale di operazioni non riuscite è del {0}% e del {1}% di test non riusciti ({2}/{3})
ja: 失敗率のしきい値は {0} % で、失敗したテストは {1} % です ({2}/{3})
ko: 실패한 임계값 백분율은 {0}%이며 {1}% 테스트에 실패했습니다({2}/{3}).
pl: Wartość procentowa progu niepowodzenia wynosi {0}% i {1}% testów nie powiodło się ({2}/{3})
pt_br: O limite de porcentagem com falha é {0}% e {1}% dos testes falharam ({2}/{3})
ru: Пороговое значение доли неудачных тестов — {0}%, и доля неудачных тестов — {1}% ({2}/{3})
tr: Başarısız olan yüzde eşiği %{0} ve başarısız %{1} ({2}/{3})
zh_hans: 失败的阈值百分比为 {0}%，有 {1}% 测试失败({2}/{3})
zh_hant: 失敗的百分比閾值為 {0}%，有 {1}% 個測試失敗 ({2}/{3})

# MoveFiles
source: ===================== Moving last attempt asset files to the default result directory =====================
cs: ===================== Přesouvání souborů prostředků posledního pokusu do výchozího adresáře výsledků =====================
de: ===================== Medienobjektdateien des letzten Versuchs werden in das Standardergebnisverzeichnis verschoben. =====================
es: ===================== Moviendo los archivos de recursos del último intento al directorio de resultados predeterminado =====================
fr: ===================== Déplacement des fichiers de ressources de la dernière tentative vers le répertoire de résultats par défaut =====================
it: ===================== Spostamento dei file di asset dell'ultimo tentativo nella directory dei risultati predefinita =====================
ja: ===================== 前回試行した資産ファイルを既定の結果ディレクトリに移動しています =====================
ko: ===================== 마지막 시도 자산 파일을 기본 결과 디렉터리로 이동 =====================
pl: ===================== Przeniesienie plików zasobów ostatniej próby do domyślnego katalogu wyników =====================
pt_br: ===================== Movendo arquivos de ativo da última tentativa para o diretório de resultados padrão =====================
ru: ===================== Перемещение файлов ресурсов последней попытки в каталог результатов по умолчанию =====================
tr: ===================== Son deneme varlık dosyaları, varsayılan sonuç dizinine taşınıyor =====================
zh_hans: ===================== 正在将上次尝试资产文件移动到默认结果目录 =====================
zh_hant: ===================== 將上次嘗試的資產檔案移至預設結果目錄 =====================

# MovingFileToLocation
source: Moving file '{0}' to '{1}'
cs: Soubor {0} se přesouvá do umístění {1}.
de: Die Datei "{0}" wird nach "{1}" verschoben
es: Moviendo el archivo '{0}' a '{1}'
fr: Déplacement du fichier '{0}' vers '{1}'
it: Spostamento del file '{0}' in '{1}'
ja: ファイル '{0}' を '{1}' に移動しています
ko: 파일 {0}을(를) {1}(으)로 이동
pl: Przenoszenie pliku „{0}” do {1}
pt_br: Movendo o arquivo ''{0}'' para ''{1}''
ru: Перемещение файла "{0}" в "{1}"
tr: '{0}' dosyasını '{1}'e taşıma
zh_hans: 正在将文件“{0}”移动到“{1}”
zh_hant: 正在將檔案 '{0}' 移至 '{1}'

# RetryExtensionNotSupportedOnBrowserErrorMessage
source: The retry extension is not supported on browser platform. Browser-based tests cannot be retried due to platform limitations.
pl: Rozszerzenie ponawiania próby nie jest obsługiwane na platformie przeglądarki. Testów opartych na przeglądarce nie da się powtórzyć z powodu ograniczeń platformy.
tr: Yeniden deneme uzantısı tarayıcı platformunda desteklenmemektedir. Tarayıcı tabanlı testler, platform sınırlamaları nedeniyle tekrar denenemez.
zh_hans: 浏览器平台不支持重试扩展。由于平台限制，无法重试基于浏览器的测试。

# RetryFailedTestsCannotStartProcessErrorMessage
source: Failed to start process '{0}'
cs: Nepovedlo se spustit proces {0}.
de: Fehler beim Starten von Prozess "{0}".
es: No se pudo iniciar el proceso '{0}'
fr: Échec de démarrage du processus « {0} »
it: Impossibile avviare il processo '{0}'
ja: 処理 '{0}' を開始できませんでした
ko: 프로세스 '{0}'을(를) 시작하지 못했습니다.
pl: Nie można uruchomić procesu „{0}”
pt_br: Falha ao iniciar o processo '{0}'
ru: Не удалось запустить процесс "{0}".
tr: '{0}' işlemi başlatılamadı
zh_hans: 无法启动进程“{0}”
zh_hant: 無法啟動處理程序 '{0}'

# RetryFailedTestsExtensionDescription
source: Retry failed tests feature allows to restart test execution upon failure.
cs: Funkce opakování neúspěšných testů umožňuje po selhání znovu spustit test.
de: Das Feature zum Wiederholen fehlerhafter Tests ermöglicht es, die Testausführung bei einem Fehler neu zu starten.
es: La característica Reintentar pruebas con errores permite reiniciar la ejecución de pruebas en caso de error.
fr: La fonctionnalité de nouvelles tentatives de tests ayant échoué permet de redémarrer l’exécution des tests en cas d’échec.
it: La funzionalità di ripetizione dei test non riusciti consente di riavviare l'esecuzione dei test in caso di errore.
ja: 失敗したテストの再試行機能を使用すると、失敗時にテストの実行を再開できます。
ko: 실패한 테스트 다시 시도 기능을 사용하면 실패 시 테스트 실행을 다시 시작할 수 있습니다.
pl: Funkcja ponawiania testów zakończonych niepowodzeniem umożliwia ponowne uruchomienie wykonywania testu po niepowodzeniu.
pt_br: O recurso repetir testes com falha permite reiniciar a execução de teste após falha.
ru: Функция повтора неудачных тестов позволяет перезапустить выполнение теста после сбоя.
tr: Başarısız testleri yeniden dene özelliği, başarısızlık durumunda test yürütmenin yeniden başlatılmasına olanak tanır.
zh_hans: 重试失败的测试功能允许在失败时重新启动测试执行。
zh_hant: 重試失敗的測試功能允許在失敗時重新啟動測試執行。

# RetryFailedTestsExtensionDisplayName
source: Retry failed tests
cs: Opakovat neúspěšné testy
de: Tests mit Wiederholungsfehlern
es: Reintentar pruebas con errores
fr: Nouvelle tentative de tests ayant échoué
it: Ripeti i test non riusciti
ja: 失敗したテストの再試行
ko: 실패한 테스트 다시 시도
pl: Ponów próbę testów zakończonych niepowodzeniem
pt_br: Repetir testes com falha
ru: Включить повтор неудачных тестов
tr: Başarısız testleri yeniden deneyin
zh_hans: 重试失败的测试
zh_hant: 重試失敗的測試

# RetryFailedTestsInvalidTestApplicationBuilderErrorMessage
source: Retry failed tests only works with builders of type 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder'
cs: Opakování neúspěšných testů funguje pouze s tvůrci typu Microsoft.Testing.Platform.Builder.TestApplicationBuilder.
de: Das Wiederholen fehlerhafter Tests funktioniert nur mit Generatoren vom Typ "Microsoft.Testing.Platform.Builder.TestApplicationBuilder".
es: Reintentar pruebas con errores solo funciona con generadores de tipo "Microsoft.Testing.Platform.Builder.TestApplicationBuilder"
fr: Les nouvelles tentatives de tests ayant échoué fonctionnent uniquement avec les générateurs de type « Microsoft.Testing.Platform.Builder.TestApplicationBuilder »
it: La ripetizione dei test non riusciti funziona solo con i generatori di tipo 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder'.
ja: 失敗したテストの再試行は、'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' 型のビルダーでのみ機能します
ko: 실패한 테스트 다시 시도는 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' 유형의 작성기에서만 작동합니다.
pl: Ponawianie testów zakończonych niepowodzeniem działa tylko z konstruktorami typu „Microsoft.Testing.Platform.Builder.TestApplicationBuilder”
pt_br: A repetição de testes com falha funciona somente com construtores do tipo ''Microsoft.Testing.Platform.Builder.TestApplicationBuilder''
ru: Повтор неудачных тестов работает только с построителями типа "Microsoft.Testing.Platform.Builder.TestApplicationBuilder"
tr: Başarısız testleri yeniden deneme yalnızca 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' türündeki oluşturucularla çalışır
zh_hans: 重试失败的测试仅适用于“Microsoft.Testing.Platform.Builder.TestApplicationBuilder”类型的生成器
zh_hant: 重試失敗的測試僅適用於類型為 'Microsoft.Testing.Platform.Builder.TestApplicationBuilder' 的建立器

# RetryFailedTestsMaxPercentageOptionDescription
source: Disable retry mechanism if the percentage of failed tests is greater than the specified value
cs: Zakázat mechanismus opakování, pokud je procento neúspěšných testů větší než zadaná hodnota
de: Wiederholungsmechanismus deaktivieren, wenn der Prozentsatz fehlerhafter Tests größer als der angegebene Wert ist
es: Deshabilitar el mecanismo de reintento si el porcentaje de pruebas con errores es mayor que el valor especificado
fr: Désactiver le mécanisme de nouvelle tentative si le pourcentage de tests ayant échoué est supérieur à la valeur spécifiée
it: Disabilita il meccanismo di ripetizione dei tentativi se la percentuale di test non riusciti è maggiore del valore specificato.
ja: 失敗したテストの割合が指定した値を超える場合は再試行メカニズムを無効にする
ko: 실패한 테스트의 비율이 지정된 값보다 큰 경우 다시 시도 메커니즘을 사용하지 않도록 설정
pl: Wyłącz mechanizm ponawiania prób, jeśli procent testów zakończonych niepowodzeniem jest większy niż określona wartość
pt_br: Desabilitar o mecanismo de repetição se a porcentagem de testes com falha for maior que o valor especificado
ru: Отключить механизм повторных попыток, если процент неудачных тестов превышает указанное значение
tr: Başarısız testlerin yüzdesi belirtilen değerden büyükse yeniden deneme mekanizmasını devre dışı bırak
zh_hans: 如果失败的测试百分比大于指定值，则禁用重试机制
zh_hant: 如果失敗的測試百分比大於指定的值，則停用重試機制

# RetryFailedTestsMaxTestsOptionDescription
source: Disable retry mechanism if the number of failed tests is greater than the specified value
cs: Zakázat mechanismus opakování, pokud je počet neúspěšných testů větší než zadaná hodnota
de: Wiederholungsmechanismus deaktivieren, wenn die Anzahl fehlerhafter Tests größer als der angegebene Wert ist
es: Deshabilitar el mecanismo de reintento si el número de pruebas con errores es mayor que el valor especificado
fr: Désactiver le mécanisme de nouvelle tentative si le nombre de tests ayant échoué est supérieur à la valeur spécifiée
it: Disabilita il meccanismo di ripetizione dei tentativi se il numero di test non riusciti è maggiore del valore specificato.
ja: 失敗したテストの数が指定した値を超える場合は再試行メカニズムを無効にする
ko: 실패한 테스트 수가 지정된 값보다 큰 경우 다시 시도 메커니즘을 사용하지 않도록 설정
pl: Wyłącz mechanizm ponawiania prób, jeśli liczba testów zakończonych niepowodzeniem jest większa niż określona wartość
pt_br: Desabilitar o mecanismo de repetição se o número de testes com falha for maior que o valor especificado
ru: Отключить механизм повторных попыток, если число неудачных тестов превышает указанное значение
tr: Başarısız testlerin yüzdesi belirtilen değerden büyükse yeniden deneme mekanizmasını devre dışı bırak
zh_hans: 如果失败的测试数大于指定值，则禁用重试机制
zh_hant: 如果失敗的測試數目大於指定的值，則停用重試機制

# RetryFailedTestsNotSupportedInHotReloadErrorMessage
source: Retry failed tests feature is not supported in hot reload mode
cs: Funkce opakování neúspěšných testů není v režimu opětovného načítání za provozu podporovaná.
de: Das Feature zum Wiederholen fehlerhafter Tests wird im Hot Reload-Modus nicht unterstützt
es: La característica Reintentar pruebas con errores no se admite en el modo de recarga activa
fr: La fonctionnalité de nouvelles tentatives de tests ayant échoué n’est pas prise en charge en mode rechargement à chaud
it: La funzionalità di ripetizione dei test non riusciti non è supportata nella modalità di ricaricamento rapido.
ja: 失敗したテストの再試行機能は、ホット リロード モードではサポートされていません
ko: 실패한 테스트 다시 시도 기능은 핫 다시 로드 모드에서 지원되지 않습니다.
pl: Funkcja ponownych testów zakończonych niepowodzeniem nie jest obsługiwana w trybie ponownego ładowania na gorąco
pt_br: Não há suporte para o recurso de repetição de testes com falha no modo de recarga dinâmica
ru: Функция повтора неудачных тестов не поддерживается в режиме горячей перезагрузки
tr: Başarısız testleri yeniden deneme özelliği, çalışırken yeniden yükleme modunda desteklenmez
zh_hans: 热重载模式下不支持重试失败的测试功能
zh_hant: 熱重新載入模式不支援重試失敗的測試功能

# RetryFailedTestsNotSupportedInServerModeErrorMessage
source: Retry failed tests feature is not supported in server mode
cs: Funkce opakování neúspěšných testů není v režimu serveru podporovaná.
de: Das Feature zum Wiederholen fehlerhafter Tests wird im Servermodus nicht unterstützt
es: La característica reintentar pruebas con errores no se admite en el modo de servidor
fr: La fonctionnalité de nouvelles tentatives de tests ayant échoué n’est pas prise en charge en mode serveur
it: La funzionalità di ripetizione dei test non riusciti non è supportata in modalità server
ja: 失敗したテストの再試行機能は、サーバー モードではサポートされていません
ko: 실패한 테스트 다시 시도 기능은 서버 모드에서 지원되지 않습니다.
pl: Funkcja ponawiania testów zakończonych niepowodzeniem nie jest obsługiwana w trybie serwera
pt_br: Não há suporte para o recurso de repetição de testes com falha no modo de servidor
ru: Функция повтора неудачных тестов не поддерживается в режиме сервера
tr: Başarısız testleri yeniden deneme özelliği sunucu modunda desteklenmiyor
zh_hans: 服务器模式不支持重试失败的测试功能
zh_hant: 伺服器模式不支援重試失敗的測試功能

# RetryFailedTestsOptionDescription
source: Retry failed tests the given number of times
cs: Povolit opakování neúspěšných testů
de: Tests mit Wiederholungsfehlern aktivieren
es: Reintenta las pruebas fallidas el número de veces indicado
fr: Activer les nouvelles tentatives de tests ayant échoué
it: Ripetere i test non superati per il numero di volte indicato
ja: 失敗したテストの再試行を有効にする
pl: Ponów testy zakończone niepowodzeniem określoną liczbę razy
pt_br: Habilitar repetição de testes com falha
ru: Повторить неудачные тесты указанное количество раз
tr: Başarısız testleri belirtilen sayıda yeniden deneyin
zh_hans: 将失败的测试重试指定次数
zh_hant: 重試失敗測試給定次數

# RetryFailedTestsOptionIsMissingErrorMessage
source: Option '{0}' requires option '{1}' to be specified
cs: Možnost {0} vyžaduje, aby byla zadaná možnost {1}.
de: Die "{0}"-Option erfordert, dass "{1}" angegeben ist
es: La opción '{0}' requiere que se especifique la opción '{1}'
fr: L’option '{0}' nécessite la spécification de l’option '{1}'
it: L'opzione '{0}' richiede l'opzione '{1}' da specificare
ja: オプション '{0}' では、オプション '{1}' を指定する必要があります
ko: '{0}' 옵션을(를) 사용하려면 '{1}' 옵션을 지정해야 합니다.
pl: Opcja „{0}” wymaga określenia opcji „{1}”
pt_br: A opção ''{0}'' requer que a opção ''{1}'' seja especificada
ru: Параметр "{0}" требует указания параметра "{1}"
tr: '{0}' seçeneği, '{1}' seçeneğinin belirtilmesini gerektirir
zh_hans: 选项“{0}”需要指定选项“{1}”
zh_hant: 使用 '{0}' 選項時必須指定選項 '{1}'。

# RetryFailedTestsOptionSingleIntegerArgumentErrorMessage
source: Option '{0}' expects a single integer argument
cs: Možnost {0} očekává jeden celočíselný argument.
de: Option "{0}" erwartet ein einzelnes ganzzahliges Argument
es: La opción '{0}' espera un único argumento entero
fr: L’option '{0}' attend un seul argument entier
it: L'opzione '{0}' prevede un singolo argomento integer
ja: オプション '{0}' には 1 つの整数引数が必要です
ko: '{0}' 옵션에는 단일 정수 인수가 필요합니다.
pl: Opcja „{0}” oczekuje argumentu pojedynczej liczby całkowitej
pt_br: A opção ''{0}'' espera um único argumento inteiro
ru: Параметр "{0}" ожидает один целочисленный аргумент
tr: Seçenek '{0}' tek bir tamsayı argümanı bekliyor
zh_hans: 选项“{0}”需要单一整数参数
zh_hant: 選項 '{0}' 需要單一整數引數

# RetryFailedTestsPercentageAndCountCannotBeMixedErrorMessage
source: Options '{0}' and '{1}' cannot be used together
cs: Možnost {0} nelze používat společně s možností {1}.
de: Optionen "{0}" und "{1}" können nicht zusammen verwendet werden
es: Las opciones '{0}' y '{1}' no se pueden usar juntas
fr: Les options «{0}» et «{1}» ne peuvent pas être utilisées ensemble
it: Le opzioni '{0}' e '{1}' non possono essere usate insieme
ja: オプション '{0}' と '{1}' を一緒に使用することはできません
ko: '{0}' 및 '{1}' 옵션은 함께 사용할 수 없습니다.
pl: Opcji „{0}” i „{1}” nie można używać razem
pt_br: As opções ''{0}'' e ''{1}'' não podem ser usadas juntas
ru: Параметры "{0}" и "{1}" не могут использоваться вместе
tr: '{0}' ve '{1}' seçenekleri birlikte kullanılamaz
zh_hans: 选项“{0}”和“{1}”不能一起使用
zh_hant: 選項 '{0}' 和 '{1}' 不能同時使用

# TestHostProcessExitedBeforeRetryCouldConnect
source: Test host process exited before the retry service could connect to it. Exit code: {0}
cs: Hostitelský proces testu byl ukončen dříve, než se k němu mohla služba opakování připojit. Ukončovací kód: {0}
de: Der Testhostprozess wurde beendet, bevor der Wiederholungsdienst eine Verbindung herstellen konnte. Exitcode: {0}
es: El proceso de host de prueba se cerró antes de que el servicio de reintento pudiera conectarse a él. Código de salida: {0}
fr: Le processus hôte de test s’est arrêté avant que le service de nouvelle tentative puisse s’y connecter. Code de sortie : {0}
it: Il processo host di test è stato chiuso prima che il servizio di ripetizione potesse connettersi ad esso. Codice di uscita: {0}
ja: 再試行サービスが接続する前に、テスト ホスト プロセスが終了しました。終了コード: {0}
ko: 다시 시도 서비스가 연결되기 전에 테스트 호스트 프로세스가 종료되었습니다. 종료 코드: {0}
pl: Proces hosta testowego zakończył się, zanim usługa ponawiania próby mogła nawiązać z nim połączenie. Kod zakończenia: {0}
pt_br: O processo de host de teste foi encerrado antes que o serviço de repetição pudesse se conectar a ele. Código de saída: {0}
ru: Тестовый хост-процесс завершился прежде, чем к нему смогла подключиться служба повторной попытки. Код выхода: {0}
tr: Yeniden deneme hizmeti ona bağlanamadan test ana makinesi işleminden çıkıldı. Çıkış kodu: {0}
zh_hans: 测试主机进程已在重试服务可以连接到它之前退出。退出代码: {0}
zh_hant: 測試主機處理序在重試服務連線到它之前已結束。結束代碼: {0}

# TestSuiteCompletedSuccessfully
source: ===================== Tests suite completed successfully in {0} attempts =====================
cs: ===================== Sada testů byla úspěšně dokončena při {0} pokusech =====================
de: ===================== Die Testsammlung wurde in {0} Versuchen erfolgreich abgeschlossen. =====================
es: ===================== El conjunto de pruebas se completó correctamente en {0} intentos =====================
fr: ===================== La suite de tests s’est correctement terminée dans les {0} tentatives =====================
it: ===================== Il gruppo di test è stato completato correttamente in {0} tentativi =====================
ja: ===================== テスト スイートが {0} 回の試行で正常に完了しました =====================
ko: ===================== 테스트 도구 모음이 {0} 시도에서 완료되었습니다. =====================
pl: ===================== Pomyślnie ukończono pakiet testów w {0} próbach =====================
pt_br: ===================== Pacote de testes concluído com êxito em {0} tentativas =====================
ru: ===================== Набор тестов успешно завершен за несколько ({0}) попыток =====================
tr: ===================== Test paketi {0} denemede de başarıyla tamamlandı =====================
zh_hans: ===================== 测试套件已成功完成 {0} 次尝试 =====================
zh_hant: ===================== 測試套件已順利在 {0} 次嘗試內完成 =====================
