Repository: microsoft/testfx
Catalog: src/Platform/Microsoft.Testing.Extensions.Retry/Resources/xlf/ExtensionResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TestSuiteFailed
source: ===================== Tests suite failed, total failed tests: {0}, exit code: {1}, attempt: {2}/{3} =====================
cs: ===================== Sada testů selhala, celkový počet neúspěšných testů: {0}, ukončovací kód: {1}, pokus: {2}/{3} =====================
de: ===================== Fehler bei der Testsammlung. Fehlerhafte Tests gesamt: {0}, Exitcode: {1}, Versuch: {2}/{3} =====================
es: ===================== Error del conjunto de pruebas, total de pruebas erróneas: {0}, código de salida: {1}, intento: {2}/{3} =====================
fr: ===================== Échec de la suite de tests, nombre total de tests ayant échoué : {0}, code de sortie : {1}, tentative : {2}/{3} =====================
it: ===================== Gruppo di test non riuscito, totale test non superati: {0}, codice di uscita: {1}, tentativo: {2}/{3} =====================
ja: ===================== テスト スイートが失敗しました。失敗したテストの合計数: {0}、終了コード: {1}、試行: {2}/{3} =====================
ko: ===================== 테스트 도구 모음이 실패했습니다. 실패한 총 테스트: {0}, 종료 코드: {1}, 시도: {2}/{3} =====================
pl: ===================== Pakiet testów nie powiódł się, łączna liczba testów zakończonych niepowodzeniem: {0}, kod zakończenia: {1}, próba: {2}/{3} =====================
pt_br: ===================== Falha no pacote de testes, total de testes com falha: {0}, código de saída: {1}, tentativa: {2}/{3} =====================
ru: ===================== Сбой набора тестов. Всего неудачных тестов: {0}, код завершения: {1}, попытка: {2}/{3} =====================
tr: ===================== Test paketi başarısız oldu, toplam başarısız test: {0}, çıkış kodu: {1}, deneme: {2}/{3} =====================
zh_hans: ===================== 测试套件失败，失败的测试总数: {0}，退出代码: {1}，尝试次数: {2}/{3} =====================
zh_hant: ===================== 測試套件失敗，失敗的測試總數: {0}，結束代碼: {1}，嘗試: {2}/{3} =====================

# TestSuiteFailedInAllAttempts
source: ===================== Tests suite failed in all {0} attempts =====================
cs: ===================== Sada testů selhala při všech {0} pokusech =====================
de: ===================== Fehler bei der Testsammlung bei allen {0} Versuchen. =====================
es: ===================== Error del conjunto de pruebas en los {0} intentos =====================
fr: ===================== Échec de la suite de tests dans toutes les {0} tentatives =====================
it: ===================== Gruppo di test non riuscito in tutti i {0} tentativi =====================
ja: ===================== テスト スイートが {0} 回の試行すべてで失敗しました =====================
ko: ===================== 테스트 도구 모음이 모든 {0} 시도에 실패했습니다 =====================
pl: ===================== Pakiet testów nie powiódł się we wszystkich {0} próbach =====================
pt_br: ===================== Falha no pacote de testes em todas as {0} tentativas =====================
ru: ===================== Сбой набора тестов во всех попытках ({0}) =====================
tr: ===================== Test paketi tüm {0} denemede de başarısız oldu =====================
zh_hans: ===================== 测试套件在所有 {0} 尝试中均失败 =====================
zh_hant: ===================== 測試套件在所有 {0} 次嘗試中都失敗 =====================

# TestSuiteFailedWithWrongExitCode
source: Test suite failed with and exit code different that 2 (failed tests). Failure related to an unexpected condition. Exit code '{0}'
cs: Sada testů neproběhla úspěšně a ukončovací kód je jiný než 2 (neúspěšné testy). Selhání související s neočekávanou podmínkou. Ukončovací kód: {0}
de: Bei der Testsammlung ist ein Fehler aufgetreten, und der Exitcode unterscheidet sich von 2 (fehlgeschlagene Tests). Fehler im Zusammenhang mit einer unerwarteten Bedingung. Exitcode "{0}"
es: Error del conjunto de pruebas con código de salida distinto de 2 (pruebas con errores). Error relacionado con una condición inesperada. '{0}' de código de salida
fr: La suite de tests a échoué avec un code de sortie différent de 2 (tests échoués). Défaillance liée à une condition inattendue. Code de sortie « {0} »
it: Il gruppo di test non è riuscito e il codice di uscita è diverso da 2 (test non superati). Errore correlato a una condizione imprevista. Codice di uscita "{0}"
ja: テスト スイートが失敗し、終了コードが 2 (失敗したテスト) と異なりました。予期しない状態に関連するエラーです。終了コード '{0}'
ko: 테스트 도구 모음이 2와 다른 종료 코드를 사용하여 실패했습니다(테스트 실패). 예기치 않은 조건과 관련된 오류입니다. 종료 코드 '{0}'
pl: Zestaw testów nie powiódł się. Kod zakończenia jest inny niż 2 (testy zakończone niepowodzeniem). Błąd związany z nieoczekiwanym warunkiem. Kod zakończenia „{0}”
pt_br: Falha no conjunto de testes e código de saída diferente de 2 (testes com falha). Falha relacionada a uma condição inesperada. Código de saída "{0}"
ru: Сбой набора тестов с кодом завершения, который отличается от 2 (неудачные тесты). Сбой, связанный с неожиданным условием. Код завершения "{0}"
tr: Test paketi 2 (başarısız testler) kodundan farklı bir çıkış koduyla başarısız oldu. Beklenmeyen bir koşulla ilgili hata. Çıkış kodu '{0}'
zh_hans: 测试套件失败，且退出代码不是 2 (测试失败)。与意外情况相关的失败。退出代码“{0}”
zh_hant: 測試套件失敗，結束代碼與 2 不同 (測試失敗)。與未預期情况有關的失敗。結束代碼 '{0}'
