Repository: microsoft/testfx
Catalog: src/Adapter/MSTest.TestAdapter/Resources/xlf/Resource.*.xlf
Languages: cs, it, ja, ko, pl, ru

# UTA_ExecuteThrewException
source: Exception thrown while executing test. If using extension of TestMethodAttribute then please contact vendor. Error message: {0}, Stack trace: {1}
cs: Při provádění testu se vyvolala výjimka. Pokud používáte rozšíření TestMethodAttribute, obraťte se prosím na dodavatele. Chybová zpráva: {0}, trasování zásobníku: {1}
it: È stata generata un'eccezione durante l'esecuzione del test. Se si usa l'estensione di TestMethodAttribute, contattare il fornitore. Messaggio di errore: {0}, analisi dello stack: {1}
ja: テストの実行中に例外がスローされました。TestMethodAttribute の拡張クラスを使用している場合は、ベンダーに連絡してください。エラー メッセージ: {0}、スタック トレース: {1}
ko: 테스트를 실행하는 동안 예외가 발생했습니다. TestMethodAttribute 확장을 사용하는 경우 공급업체에 문의하세요. 오류 메시지: {0}. 스택 추적: {1}
pl: Zgłoszono wyjątek podczas wykonywania testu. W przypadku korzystania z rozszerzenia atrybutu TestMethodAttribute należy skontaktować się z dostawcą. Komunikat o błędzie: {0}, ślad stosu: {1}
ru: При выполнении теста возникло исключение. Если используется расширение атрибута TestMethodAttribute, обратитесь к поставщику. Сообщение об ошибке: {0}. Трассировка стека: {1}

# UTA_NoTestResult
source: Error in executing test. No result returned by extension. If using extension of TestMethodAttribute then please contact vendor.
cs: Při provádění testu došlo k chybě. Rozšíření nevrátilo žádný výsledek. Pokud používáte rozšíření třídy TestMethodAttribute, obraťte se na dodavatele.
it: Si è verificato un errore durante l'esecuzione del test. L'estensione non ha restituito alcun risultato. Se si usa l'estensione di TestMethodAttribute, contattare il fornitore.
ja: テストの実行中にエラーが発生しました。拡張から結果が返されませんでした。TestMethodAttribute の拡張クラスを使用している場合は、ベンダーに連絡してください。
ko: 테스트를 실행하는 중에 오류가 발생했습니다. 확장에서 결과가 반환되지 않았습니다. TestMethodAttribute 확장을 사용하는 경우 공급업체에 문의하세요.
pl: Błąd podczas wykonywania testu. Rozszerzenie nie zwróciło żadnego wyniku. W przypadku korzystania z rozszerzenia atrybutu TestMethodAttribute należy skontaktować się z dostawcą.
ru: Ошибка при выполнении теста. Расширение не возвратило результаты. Если используется расширение атрибута TestMethodAttribute, обратитесь к поставщику.

# UTA_ClassOrAssemblyCleanupMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be static, public, does not return a value and should not take any parameter. Additionally, if you are using async-await in method then return-type must be 'Task' or 'ValueTask'.
cs: Metoda {0}.{1} má špatný podpis. Metoda musí být static nebo public, nevrací hodnotu a nesmí přijímat žádný parametr. Pokud navíc v metodě používáte operátor async-await, musí být návratový typ Task nebo ValueTask.
it: La firma del metodo {0}.{1}non è corretta. Il metodo deve essere statico e pubblico, non deve restituire un valore né accettare parametri. Se inoltre si usa async-await nel metodo di test, il tipo restituito deve essere 'Task' o 'ValueTask'.
ja: メソッド {0}。{1} は不適切なシグネチャを含んでいます。メソッドは static および public である必要があり、値を返しません。また、パラメーターを受け取ることはできません。また、メソッドで async-await を使用している場合、戻り値の型は 'Task' または 'ValueTask' である必要があります。
ko: {0}.{1} 메서드의 서명이 잘못되었습니다. 메서드는 정적이고 공용이어야 하며, 값을 반환하거나 매개 변수를 취하지 않습니다. 또한 메서드에서 비동기 대기를 사용하는 경우 반환 형식은 'Task' 또는 'ValueTask'여야 합니다.
pl: Metoda {0}.{1} ma nieprawidłową sygnaturę. Metoda musi być statyczna i publiczna, nie może zwracać wartości i nie powinna przyjmować żadnego parametru. Ponadto jeśli w metodzie jest używane oczekiwanie asynchroniczne, zwracanym typem musi być typ Task.
ru: Метод {0}.{1} имеет неправильную сигнатуру. Метод должен быть статическим и открытым, не должен возвращать значение и принимать параметры. Кроме того, при использовании async-await в методе возвращаемое значение должно иметь тип "Task" или "ValueTask".

# UTA_ClassOrAssemblyInitializeMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be static, public, does not return a value and should take a single parameter of type TestContext. Additionally, if you are using async-await in method then return-type must be 'Task' or 'ValueTask'.
cs: Metoda {0}.{1} má špatný podpis. Metoda musí být static nebo public, nevrací hodnotu a musí přijímat jeden parametr typu TestContext. Pokud navíc v metodě používáte operátor async-await, musí být návratový typ Task nebo ValueTask.
it: La firma del metodo {0}.{1}non è corretta. Il metodo deve essere statico e pubblico, non deve restituire un valore e deve accettare un singolo parametro di tipo TestContext. Se inoltre si usa async-await nel metodo di test, il tipo restituito deve essere 'Task' o 'ValueTask'.
ja: メソッド {0}。{1} は不適切なシグネチャを含んでいます。メソッドは static および public である必要があり、値を返しません。また、TestContext 型の 1 つのパラメーターを受け取る必要があります。また、メソッドで async-await を使用している場合、戻り値の型は 'Task' または 'ValueTask' である必要があります。
ko: {0}.{1} 메서드의 서명이 잘못되었습니다. 메서드는 static, public이어야 하고, 값을 반환하지 않으며, TestContext 형식의 단일 매개 변수를 사용해야 합니다. 또한 메서드에서 비동기 대기를 사용하는 경우 반환 형식은 'Task' 또는 'ValueTask'여야 합니다.
pl: Metoda {0}.{1} ma nieprawidłową sygnaturę. Metoda musi być statyczna i publiczna, nie może zwracać wartości i nie powinna przyjmować pojedynczego parametru typu TestContext. Ponadto jeśli w metodzie jest używane oczekiwanie asynchroniczne, zwracanym typem musi być typ Task.
ru: Метод {0}.{1} имеет неправильную сигнатуру. Метод должен быть статическим и открытым, не должен возвращать значение и должен принимать один параметр, имеющий тип TestContext. Кроме того, при использовании async-await в методе возвращаемое значение должно иметь тип "Task" или "ValueTask".

# UTA_ErrorInvalidTimeout
source: UTA054: {0}.{1} has invalid Timeout attribute. The timeout must be an integer value greater than 0.
cs: UTA054: {0}.{1} má neplatný atribut Timeout. Hodnota timeline musí být celé číslo větší než 0.
ko: UTA054: {0}.{1}에 잘못된 Timeout 특성이 있습니다. 시간 제한 값은 0보다 큰 정수여야 합니다.
ru: UTA054: {0}.{1} имеет недопустимый атрибут Timeout. Время ожидания должно быть допустимым целым числом и не может быть меньше 0.

# UTA_ErrorPredefinedTestProperty
source: UTA023: {0}: Cannot define predefined property {2} on method {1}.
cs: UTA023: {0}: V metodě {1} nejde definovat předdefinovanou vlastnost {2}.
it: UTA023: {0}: non è possibile definire la proprietà predefinita {2} per il metodo {1}.
ja: UTA023: {0}: メソッド {1} 上の以前に定義されたプロパティ {2} を定義することはできません。
ko: UTA023: {0}: {1} 메서드에서 미리 정의된 속성 {2}을(를) 정의할 수 없습니다.
pl: UTA023: {0}: Nie można zdefiniować wstępnie zdefiniowanej właściwości {2} dla metody {1}.
ru: UTA023: {0}: не удается определить предопределенное свойство {2} в методе {1}.

# UTA_ErrorTestPropertyNullOrEmpty
source: UTA021: {0}: Null or empty custom property defined on method {1}. The custom property must have a valid name.
cs: UTA021: {0}: V metodě {1} je definovaná vlastní vlastnost, která je null nebo je prázdná. Vlastní vlastnost musí mít platný název.
it: UTA021: {0}: per il metodo {1} è stata definita una proprietà personalizzata Null o vuota. Specificare un nome valido per la proprietà personalizzata.
ja: UTA021: {0}: Null または空のカスタム プロパティが、メソッド {1} で定義されています。カスタム プロパティには有効な名前を指定しなければなりません。
ko: UTA021: {0}: {1} 메서드에서 Null 또는 빈 사용자 지정 속성을 정의했습니다. 사용자 지정 속성에는 올바른 이름이 지정되어 있어야 합니다.
pl: UTA021: {0}: Zerowa lub pusta niestandardowa właściwość została zdefiniowana dla metody {1}. Niestandardowa właściwość musi mieć prawidłową nazwę.
ru: UTA021: {0}: в методе {1} определено пользовательское свойство, имя которого имеет значение NULL или пусто. Пользовательское свойство должно иметь допустимое имя.

# UTA_MethodDoesNotExists
source: Method {0}.{1} does not exist.
cs: Metoda {0}.{1} neexistuje.
it: Il metodo {0}.{1} non esiste.
ja: メソッド {0}.{1} は存在しません。
ko: {0}.{1} 메서드가 없습니다.
pl: Metoda {0}.{1} nie istnieje.
ru: Метод {0}.{1} не существует.

# UTA_TestContextLoadError
source: Unable to find property {0}.TestContext. Error:{1}.
cs: Nepodařilo se najít vlastnost {0}.TestContext. Chyba:{1}.
it: La proprietà {0}.TestContext non è stata trovata. Errore: {1}.
ja: プロパティ {0}.TestContext が見つかりません。エラー: {1}。
ko: {0}.TestContext 속성을 찾을 수 없습니다. 오류: {1}
pl: Nie można znaleźć właściwości {0}.TestContext. Błąd:{1}.
ru: Не удается найти свойство {0}.TestContext. Ошибка: {1}.

# UTA_TestContextTypeMismatchLoadError
source: The {0}.TestContext has incorrect type.
cs: {0}.TestContext má nesprávný typ.
it: Il tipo di {0}.TestContext non è corretto.
ja: {0}.TestContext は不適切な型を含んでいます。
ko: {0}.TestContext의 형식이 잘못되었습니다.
pl: Element {0}.TestContext ma niepoprawny typ.
ru: Для свойства {0}.TestContext указан неправильный тип.

# UTA_TestInitializeAndCleanupMethodHasWrongSignature
source: Method {0}.{1} has wrong signature. The method must be non-static, public, does not return a value and should not take any parameter. Additionally, if you are using async-await in method then return-type must be 'Task' or 'ValueTask'.
cs: Metoda {0}.{1} má špatný podpis. Metoda nesmí být static nebo public, nevrací hodnotu a nesmí přijímat žádný parametr. Pokud navíc v metodě používáte operátor async-await, musí být návratový typ Task nebo ValueTask.
it: La firma del metodo {0}.{1}non è corretta. Il metodo deve essere non statico e pubblico, non deve restituire un valore né accettare parametri. Se inoltre si usa async-await nel metodo di test, il tipo restituito deve essere 'Task' o 'ValueTask'.
ja: メソッド {0}。{1} は不適切なシグネチャを含んでいます。メソッドは non-static および public である必要があり、値を返しません。また、パラメーターを受け取ることはできません。また、メソッドで async-await を使用している場合、戻り値の型は 'Task' または 'ValueTask' である必要があります。
ko: {0}.{1} 메서드의 서명이 잘못되었습니다. 메서드는 정적이 아니고 공용이어야 하며, 값을 반환하거나 매개 변수를 사용할 수 없습니다. 또한 메서드에서 비동기 대기를 사용하는 경우 반환 형식은 'Task' 또는 'ValueTask'여야 합니다.
pl: Metoda {0}.{1} ma nieprawidłową sygnaturę. Metoda musi być niestatyczna i publiczna, nie może zwracać wartości i nie powinna przyjmować żadnego parametru. Ponadto jeśli w metodzie jest używane oczekiwanie asynchroniczne, zwracanym typem musi być typ Task.
ru: Метод {0}.{1} имеет неправильную сигнатуру. Метод должен быть нестатическим и открытым, не должен возвращать значение и принимать параметры. Кроме того, при использовании async-await в методе возвращаемое значение должно иметь тип "Task" или "ValueTask".

# UTA_TypeLoadError
source: Unable to get type {0}. Error: {1}.
cs: Nepodařilo se získat typ {0}. Chyba: {1}.
it: Non è possibile ottenere il tipo {0}. Errore: {1}.
ja: 型 {0} を取得できません。エラー: {1}。
ko: {0} 형식을 가져올 수 없습니다. 오류: {1}
pl: Nie można uzyskać typu {0}. Błąd: {1}.
ru: Не удается получить тип {0}. Ошибка: {1}.

# TestNotFound
source: Test method {0} was not found.
cs: Testovací metoda {0} se nenašla.
it: Il metodo di test {0} non è stato trovato.
ja: テスト メソッド {0} が見つかりませんでした。
ko: {0} 테스트 메서드를 찾을 수 없습니다.
pl: Nie znaleziono metody testowej {0}.
ru: Метод теста {0} не найден.

# DebugTraceBanner
source: Debug Trace:
cs: Trasování ladění:
it: Traccia di debug:
ja: デバッグ トレース:
ko: 디버그 추적:
pl: Ślad debugowania:
ru: Трассировка отладки:

# UTA_FailedToGetTestMethodException
source: Failed to obtain the exception thrown by test method {0}.{1}.
cs: Nepovedlo se získat výjimku vyvolanou testovací metodou {0}.{1}.
it: Non è stato possibile ottenere l'eccezione generata dal metodo di test {0}.{1}.
ja: テスト メソッド {0}.{1} によってスローされた例外を取得できませんでした。
ko: 테스트 메서드 {0}.{1}에서 throw한 예외를 가져오지 못했습니다.
pl: Nie powiodło się uzyskanie wyjątku zgłoszonego przez metodę testową {0}.{1}.
ru: Не удалось получить исключение, созданное методом теста {0}.{1}.

# UTA_TestMethodThrows
source: Test method {0}.{1} threw exception: {2}
cs: V testovací metodě {0}.{1} došlo k výjimce: {2}
it: Il metodo di test {0}.{1} ha generato un'eccezione: {2}
ja: テスト メソッド {0}.{1} が例外をスローしました: {2}
ko: 테스트 메서드 {0}.{1}에서 예외를 throw했습니다. {2}
pl: Metoda testowa {0}.{1} zgłosiła wyjątek: {2}
ru: Метод теста {0}.{1} создал исключение: {2}.

# UTA_WrongThread
source: {0} For UWP projects, if you are using UI objects in test consider using [UITestMethod] attribute instead of [TestMethod] to execute test in UI thread.
cs: {0}. Pokud v testu používáte objekty uživatelského rozhraní, zvažte u projektů pro platformu UPW použití atributu [UITestMethod] místo atributu [TestMethod], aby se test provedl ve vlákně uživatelského rozhraní.
it: {0}. Se, per i progetti della piattaforma UWP, nel test si usano oggetti dell'interfaccia utente, provare a specificare l'attributo [UITestMethod] invece di [TestMethod] per eseguire il test nel thread di UI.
ja: {0} UWP プロジェクトについて、テスト内で UI オブジェクトを使用している場合は、[TestMethod] の代わりに [UITestMethod] 属性を使用して UI スレッド内でテストを実行することを検討してください。
ko: {0} UWP 프로젝트의 경우 테스트에서 UI 개체를 사용 중이면 [TestMethod] 대신 [UITestMethod] 특성을 사용하여 UI 스레드에서 테스트를 실행하세요.
pl: {0} Jeśli w projektach UWP korzystasz z obiektów interfejsu użytkownika podczas testowania, rozważ użycie atrybutu [UITestMethod] zamiast atrybutu [TestMethod], aby wykonywać test w wątku interfejsu użytkownika.
ru: {0} В проектах UWP, если в тесте используются объекты пользовательского интерфейса, рассмотрите возможность использования атрибута [UITestMethod] вместо атрибута [TestMethod] для выполнения теста в потоке пользовательского интерфейса.

# InvalidSettingsXmlAttribute
source: Invalid settings '{0}'. Unexpected XmlAttribute: '{1}'.
cs: Neplatné nastavení {0}. Neočekávaný XmlAttribute: {1}.
it: Le impostazioni '{0}' non sono valide. Elemento XmlAttribute imprevisto: '{1}'.
ja: 設定 '{0}' は無効です。予期しない XmlAttribute: '{1}'。
ko: '{0}' 설정이 잘못되었습니다. 예기치 않은 XmlAttribute '{1}'이(가) 있습니다.
pl: Nieprawidłowe ustawienia „{0}”. Nieoczekiwany atrybut XmlAttribute: „{1}”.
ru: Недопустимые параметры "{0}". Непредвиденный атрибут XmlAttribute: "{1}".

# InvalidSettingsXmlElement
source: Invalid settings '{0}'. Unexpected XmlElement: '{1}'.
cs: Neplatné nastavení {0}. Neočekávaný XmlElement: {1}.
it: Le impostazioni '{0}' non sono valide. Elemento XmlElement imprevisto: '{1}'.
ja: 設定 '{0}' は無効です。予期しない XmlElement: '{1}'。
ko: '{0}' 설정이 잘못되었습니다. 예기치 않은 XmlElement '{1}'이(가) 있습니다.
pl: Nieprawidłowe ustawienia „{0}”. Nieoczekiwany atrybut XmlElement: „{1}”.
ru: Недопустимые параметры "{0}". Непредвиденный элемент XmlElement: "{1}".

# DataDrivenResultDisplayName
source: {0} (Data Row {1})
cs: {0} (datový řádek {1})
it: {0} (riga dati {1})
ja: {0} (データ行 {1})
ko: {0}(데이터 행 {1})
pl: {0} (wiersz danych {1})
ru: {0} (строка данных {1})

# UTA_ExpectedExceptionAttributeConstructionException
source: The ExpectedException attribute defined on test method {0}.{1} threw an exception during construction. {2}
cs: Atribut ExpectedException definovaný u testovací metody {0}.{1} vyvolal během vytváření výjimku. {2}
it: L'attributo ExpectedException definito nel metodo di test {0}.{1} ha generato un'eccezione durante la costruzione. {2}
ja: テスト メソッド {0}.{1} に定義されている ExpectedException 属性が、作成中に例外をスローしました。 {2}
ko: 테스트 메서드 {0}.{1}에 정의된 ExpectedException 특성이 생성하는 동안 예외를 throw했습니다. {2}
pl: Atrybut ExpectedException zdefiniowany dla metody testowej {0}.{1} zgłosił wyjątek w trakcie konstruowania. {2}
ru: Атрибут ExpectedException, определенный в методе теста {0}.{1}, породил исключение во время создания. {2}

# UTA_MultipleExpectedExceptionsOnTestMethod
source: The test method {0}.{1} has multiple attributes derived from ExpectedExceptionBaseAttribute defined on it. Only one such attribute is allowed.
cs: Testovací metoda {0}.{1} má definovaných více atributů odvozených od atributu ExpectedExceptionBaseAttribute. Povolený je jenom jeden takový atribut.
it: Il metodo di test {0}.{1} contiene più attributi derivati dall'elemento ExpectedExceptionBaseAttribute definito per esso. È consentito solo uno di tali attributi.
ja: テスト メソッド {0}.{1} には、ExpectedExceptionBaseAttribute から派生した属性が複数定義されています。このような属性は 1 つしか許可されません。
ko: 테스트 메서드 {0}.{1}에는 정의되어 있는 ExpectedExceptionBaseAttribute에서 파생된 특성이 여러 개 있습니다. 이러한 특성은 하나만 허용됩니다.
pl: Metoda testowa {0}.{1} ma wiele zdefiniowanych dla niej atrybutów pochodzących od atrybutu ExpectedExceptionBaseAttribute. Dozwolony jest tylko jeden taki atrybut.
ru: В методе теста {0}.{1} определено несколько атрибутов, производных от ExpectedExceptionBaseAttribute, заданного в нем. Допускается только один такой атрибут.

# LegacyScenariosNotSupportedWarning
source: Warning : A testsettings file or a vsmdi file is not supported with the MSTest V2 Adapter.
cs: Upozornění: Adaptér MSTest V2 nepodporuje soubor testsettings ani vsmdi.
it: Avviso: con l'adattatore MSTest V2 non è possibile usare un file testsettings o un file vsmdi.
ja: 警告: testsettings ファイル、vsmdi ファイルは MSTest V2 アダプターではサポートされていません。
ko: 경고: MSTest V2 어댑터에서는 testsettings 파일 또는 vsmdi 파일이 지원되지 않습니다.
pl: Ostrzeżenie: Plik testsettings lub plik vsmdi nie jest obsługiwany przez adapter MSTest w wersji 2.
ru: Внимание! Адаптер MSTest версии 2 не поддерживает файл TESTSETTINGS или VSMDI.

# TestContextMessageBanner
source: TestContext Messages:
cs: Zprávy pro TestContext:
it: Messaggi di TestContext:
ja: TestContext メッセージ:
ko: TestContext 메시지:
pl: Komunikaty TestContext:
ru: Сообщения TestContext:

# UTA_CleanupMethodThrowsGeneralError
source: Error calling Test Cleanup method for test class {0}: {1}
cs: Při volání čisticí metody testu pro třídu {0} došlo k chybě: {1}
it: Si è verificato un errore durante la chiamata del metodo TestCleanup per la classe di test {0}: {1}
ja: テスト クラス {0} のテスト クリーンアップ メソッドの呼び出しでエラーが発生しました: {1}
ko: 테스트 클래스 {0}에 대한 테스트 정리 메서드를 호출하는 오류: {1}
pl: Błąd podczas wywoływania metody czyszczącej testu dla klasy testowej {0}: {1}
ru: Ошибка при вызове метода TestCleanup для тестового класса {0}: {1}

# UTA_CleanupStackTrace
source: TestCleanup Stack Trace
cs: Trasování zásobníku čištění testu
it: Analisi dello stato di TestCleanup
ja: TestCleanup スタック トレース
ko: TestCleanup 스택 추적
pl: Ślad stosu dla TestCleanup
ru: Трассировка стека TestCleanup

# TestParallelizationBanner
source: MSTest Executor: Test Parallelization enabled for {0} (Workers: {1}, Scope: {2}).
cs: Prováděcí modul MSTest: Je povolená paralelizace testu pro {0} (pracovní procesy: {1}, obor: {2}).
it: Executor MSTest: Parallelizzazione test abilitata per {0} (Workers: {1}. Scope: {2}).
ja: MSTest 実行プログラム: {0} でテスト並列処理が有効にされています (Workers: {1}、Scope: {2})。
ko: MSTest 실행기: {0}에 대해 테스트 병렬 처리를 사용합니다(Workers: {1}, Scope: {2}).
pl: Moduł wykonywania MSTest: włączono obsługę równoległego wykonywania testów dla elementu {0} (procesy robocze: {1}, zakres: {2}).
ru: Исполнитель MSTest: включена параллелизация тестов для {0} (рабочие роли: {1}, область: {2}).

# InvalidParallelScopeValue
source: Invalid value '{0}' specified for 'Scope'. Supported scopes are {1}.
cs: Pro Obor je zadaná neplatná hodnota {0}. Podporované obory jsou {1}.
it: Il valore '{0}', specificato per 'Scope', non è valido. I valori supportati per Scope sono {1}.
ja: 無効な値 '{0}' が 'Scope' に指定されました。サポートされているスコープは {1} です。
ko: 'Scope'에 대해 잘못된 값 '{0}'이(가) 지정되었습니다. 지원되는 범위는 {1}입니다.
pl: Określono nieprawidłową wartość „{0}” dla właściwości „Scope”. Obsługiwane zakresy to {1}.
ru: В поле "Область" указано недопустимое значение "{0}". Поддерживаемые области: {1}.

# InvalidParallelWorkersValue
source: Invalid value '{0}' specified for 'Workers'. The value should be a non-negative integer.
cs: Pro Pracovní procesy je zadaná neplatná hodnota {0}. Hodnota by měla být nezáporné celé číslo.
it: Il valore '{0}', specificato per 'Workers', non è valido. Il valore deve essere un numero intero non negativo.
ja: 無効な値 '{0}' が 'Workers' に指定されました。値は負ではない整数である必要があります。
ko: 'Workers'에 대해 잘못된 값 '{0}'이(가) 지정되었습니다. 이 값은 음수가 아닌 정수여야 합니다.
pl: Określono nieprawidłową wartość „{0}” dla właściwości „Workers”. Wartość musi być nieujemną liczbą całkowitą.
ru: В поле "Рабочие роли" указано недопустимое значение "{0}". Оно должно быть неотрицательным целым числом.

# TestAssembly_AssemblyDiscoveryFailure
source: Failed to discover tests from assembly {0}. Reason:{1}
cs: Nepovedlo se zjistit testy ze sestavení {0}. Důvod:{1}
it: Non è stato possibile individuare i test dall'assembly {0}. Motivo: {1}
ja: アセンブリ {0} からテストを検出できませんでした。理由:{1}
ko: 어셈블리 {0}에서 테스트를 검색하지 못했습니다. 이유:{1}
pl: Nie można odnaleźć testów z zestawu {0}. Przyczyna:{1}
ru: Не удалось обнаружить тесты из сборки {0}. Причина:{1}

# Execution_Test_Cancelled
source: Test '{0}' execution has been aborted.
cs: Spouštění testu {0} se přerušilo.
it: L'esecuzione del test '{0}' è stata interrotta.
ja: テスト '{0}' の実行が中止されました。
ko: 테스트 '{0}' 실행이 중단되었습니다.
pl: Wykonanie testu „{0}” zostało przerwane.
ru: Выполнение теста "{0}" было прервано.

# InvalidClassCleanupLifecycleValue
source: Invalid value '{0}' specified for 'ClassCleanupLifecycle'. Supported scopes are {1}.
cs: Pro classCleanupLifecycle byla zadána neplatná hodnota {0}. Podporované obory jsou {1}.
it: Il valore '{0}', specificato per 'ClassCleanupLifecycle', non è valido. I valori supportati per Scope sono {1}.
ja: 'ClassCleanupLifecycle' に無効な値 '{0}' が指定されました。サポートされているスコープは {1} です。
ko: 'ClassCleanupLifecycle'에 대해 '{0}' 잘못된 값이 지정되었습니다. 지원되는 범위는 {1}입니다.
pl: Dla ustawienia „ClassCleanupLifecycle” określono nieprawidłową wartość „{0}”. Obsługiwane zakresy to {1}.
ru: Для параметра "ClassCleanupLifecycle" указано недопустимое значение "{0}". Поддерживаемые области: {1}.

# CannotEnumerateIDataSourceAttribute
source: Exception occurred while enumerating IDataSource attribute on "{0}.{1}": {2}
cs: Při vytváření výčtu atributu IDataSource došlo k výjimce. „{0}.{1}“: {2}
it: Si è verificata un'eccezione durante l'enumerazione dell'attributo IDataSource in "{0}.{1}": {2}
ja: "{0}.{1}" で IDataSource 属性を列挙中に例外が発生しました: {2}
ko: "{0}.{1}"에서 IDataSource 특성을 열거하는 동안 예외가 발생했습니다. {2}
pl: Wystąpił wyjątek podczas wyliczania atrybutu IDataSource w przestrzeni nazwy „{0}.{1}”: {2}
ru: Возникло исключение при перечислении атрибута IDataSource в "{0}.{1}": {2}

# ExceptionOccuredWhileGettingTheExceptionDescription
source: "{0}": (Failed to get exception description due to an exception of type "{1}".
cs: „{0}“: (Nepodařilo se získat popis výjimky z důvodu výjimky typu „{1}“.
it: "{0}": (non è stato possibile ottenere la descrizione dell'eccezione a causa di un'eccezione di tipo "{1}".
ja: "{0}": (種類が "{1}"の例外のため、例外の説明を取得できませんでした。
ko: "{0}": ("{1}" 형식의 예외로 인해 예외 설명을 가져오지 못했습니다.
pl: „{0}”: (Nie można uzyskać opisu wyjątku z powodu wyjątku typu „{1}”.
ru: "{0}": (Не удалось получить описание исключения из-за исключения типа "{1}".

source: Exceptions thrown:
cs: Vyvolané výjimky:
it: Eccezioni generate:
ja: スローされた例外:
ko: 예외 발생:
pl: Zgłoszone wyjątki:
ru: Выданные исключения:

# FailedFetchAttributeCache
source: Failed to get attribute cache. Ignoring attribute inheritance and falling into 'type defines Attribute model', so that we have some data.
cs: Nepodařilo se získat mezipaměť atributů. Ignoruje se dědičnost atributů a spadání do „type defines Attribute model“, abychom získali určitá data.
it: Non è stato possibile ottenere la cache degli attributi. L'ereditarietà dell'attributo verrà ignorata e verrà considerato 'il tipo definisce il modello di attributo', in modo che siano disponibili alcuni dati.
ja: 属性キャッシュを取得できませんでした。属性の継承を無視すると、'type defines Attribute model' に分類されるため、いくつかのデータがあるようになります。
ko: 특성 캐시를 가져오지 못했습니다. 일부 데이터가 있도록 특성 상속을 무시하고 'type defines Attribute model'로 바꿉니다.
pl: Nie można pobrać pamięci podręcznej atrybutów. Ignorowanie dziedziczenia atrybutów i wpadnięcie do elementu „typ definiuje model atrybutu”, dzięki czemu mamy pewne dane.
ru: Не удалось получить кэш атрибутов. Наследование атрибутов игнорируется и выполняется переход к схеме "тип определяет модель атрибута", чтобы получить некоторые данные.
