Repository: microsoft/testfx
Catalog: src/Adapter/MSTest.TestAdapter/Resources/xlf/Resource.*.xlf
Languages: cs, it, ja, ko, pl, ru

# FailedToGetCustomAttribute
source: Getting custom attributes for type {0} threw exception (will ignore and use the reflection way): {1}
cs: Získání vlastních atributů pro typ {0} vyvolalo výjimku (bude ignorovat a používat způsob reflexe): {1}
it: Il recupero degli attributi personalizzati per il tipo {0} ha generato un'eccezione (verrà ignorata e verrà usata la modalità reflection): {1}
ja: 型 {0} のカスタム属性を取得中に例外がスローされました (無視してリフレクションの方法を使用します): {1}
ko: {0} 형식에 대한 사용자 지정 특성을 가져오는 데 예외가 발생했습니다(무시하고 리플렉션 방법 사용). {1}
pl: Pobieranie atrybutów niestandardowych dla typu {0} zgłosiło wyjątek (zignoruje i użyje sposobu odbicia): {1}
ru: При получении настраиваемых атрибутов для типа {0} возникло исключение (оно будет проигнорировано и будет использовано отражение): {1}

# OlderTFMVersionFound
source: An older version of MSTestV2 package is loaded in assembly, test discovery might fail to discover all data tests if they depend on `.runsettings` file.
cs: V sestavení je načtena starší verze balíčku MSTestV2. Zjišťování testů může selhat při zjišťování všech testů dat, pokud jsou závislé na souboru .runsettings.
it: Nell'assembly è caricata una versione precedente del pacchetto MSTestV2. L'individuazione dei test potrebbe non riuscire a individuare tutti i test dei dati se dipendono dal file '.runsettings'.
ja: 古いバージョンの MSTestV2 パッケージがアセンブリに読み込まれています。`.runsettings` ファイルに依存している場合、テスト検出ですべてのデータ テストを検出できない可能性があります。
ko: 이전 버전 MSTestV2 패키지가 어셈블리에 로드되어 테스트 검색이 '.runsettings' 파일에 종속된 경우 모든 데이터 테스트를 검색하지 못할 수 있습니다.
pl: Starsza wersja pakietu MSTestV2 jest załadowana do zestawu. Odnajdywanie testów może nie odnaleźć wszystkich testów danych, jeśli zależą od pliku „.runsettings”.
ru: В сборку загружена старая версия пакета MSTestV2. При обнаружении тестов могут быть обнаружены не все тесты данных, если они зависят от файла ".runsettings".

# UTA_UserCodeThrewNullValueException
source: The called code threw an exception that was caught, but the exception value was null
cs: Volaný kód vyvolal výjimku, která byla zachycena, ale její hodnota byla null.
it: Il codice chiamato ha generato un'eccezione che è stata rilevata, ma il valore dell'eccezione è Null
ja: 呼び出されたコードはキャッチされた例外をスローしましたが、例外値が null でした
ko: 호출된 코드에서 확인된 예외가 발생했지만 예외 값이 null입니다.
pl: Wywołany kod zgłosił wyjątek, który został przechwycony, ale wartość wyjątku miała wartość null
ru: Вызванный код вызвал исключение, которое было перехвачено, но значение исключения было равно NULL

# OlderTFMVersionFoundClassCleanup
source: An older version of MSTestV2 package is loaded in assembly, test cleanup methods might not run as expected. Please make sure all your test projects references MSTest packages newer then version 2.2.8.
cs: V sestavení je načtena starší verze balíčku MSTestV2. Metody čištění testů se nemusí spustit očekávaným způsobem. Ujistěte se prosím, že všechny vaše testovací projekty odkazují na balíčky MSTest novější než verze 2.2.8.
it: Nell'assembly è caricata una versione precedente del pacchetto MSTestV2. I metodi di pulizia dei test potrebbero non essere eseguiti come previsto. Assicurarsi che tutti i progetti di test facciano riferimento a pacchetti MSTest più recenti della versione 2.2.8.
ja: 古いバージョンの MSTestV2 パッケージがアセンブリに読み込まれています。テスト クリーンアップ メソッドが正しく実行されない可能性があります。すべてのテスト プロジェクトが、バージョン 2.2.8 より新しい MSTest パッケージを参照していることを確認してください。
ko: 이전 버전 MSTestV2 패키지가 어셈블리에 로드되어 테스트 정리 메서드가 예상대로 실행되지 않을 수 있습니다. 모든 테스트 프로젝트가 2.2.8 이후 버전 MSTest 패키지를 참조하는지 확인하세요.
pl: Starsza wersja pakietu MSTestV2 jest załadowana do zestawu. Metody czyszczenia testów mogą nie działać zgodnie z oczekiwaniami. Upewnij się, że wszystkie projekty testowe odwołują się do pakietów MSTest nowszych niż wersja 2.2.8.
ru: В сборку загружена старая версия пакета MSTestV2. Методы очистки тестов могут выполняться неправильно. Убедитесь, что все тестовые проекты ссылаются на пакеты MSTest с версией выше 2.2.8.

# CannotExpandIDataSourceAttribute
source: Exception occurred while expanding IDataSource rows from attribute on "{0}.{1}": {2}
cs: Došlo k výjimce při rozbalování řádků IDataSource z atributu na „{0}.{1}“: {2}
it: Si è verificata un'eccezione durante l'espansione delle righe IDataSource dall'attributo in "{0}.{1}": {2}
ja: "{0}.{1}" の属性から IDataSource 行を展開中に例外が発生しました: {2}
ko: "{0}.{1}"의 특성에서 IDataSource 행을 확장하는 동안 예외가 발생했습니다. {2}
pl: Wystąpił wyjątek podczas rozwijania wierszy IDataSource z atrybutu w przestrzeni nazw „{0}.{1}”: {2}
ru: Возникло исключение при развертывании строк IDataSource из атрибута "{0}.{1}": {2}

# CannotExpandIDataSourceAttribute_DuplicateDisplayName
source: Display name "{2}" on indexes {0} and {1} are duplicate. Display names should be unique.
cs: Zobrazovaný název „{2}“ u indexů {0} a {1} je duplicitní. Zobrazované názvy by měly být jedinečné.
it: Il nome visualizzato "{2}" negli indici {0} e {1} è duplicato. I nomi visualizzati devono essere univoci.
ja: インデックス {0} と {1} の表示名 "{2}" が重複しています。表示名は一意である必要があります。
ko: {0} 및 {1} 인덱스의 "{2}" 표시 이름이 중복됩니다. 표시 이름은 고유해야 합니다.
pl: Nazwa wyświetlana „{2}” w indeksach {0} i {1} jest duplikatem. Nazwy wyświetlane powinny być unikatowe.
ru: Отображаемые имена "{2}" в индексах {0} и {1} дублируются. Отображаемые имена должны быть уникальными.

# CannotExpandIDataSourceAttribute_CannotSerialize
source: Data on index {0} for "{1}" cannot be serialized. All data provided through "IDataSource" should be serializable. If you need to test non-serializable data sources, please make sure you add "TestDataSourceDiscovery" attribute on your test assembly and set the discovery option to "DuringExecution".
cs: Data v {0} indexu pro „{1}“ nelze serializovat. Všechna data poskytnutá prostřednictvím „IDataSource“ by měla být serializovatelná. Pokud potřebujete testovat neserializovatelné zdroje dat, nezapomeňte do testovacího sestavení přidat atribut TestDataSourceDiscovery a nastavit možnost zjišťování na „DuringExecution“.
it: Non è possibile serializzare i dati nell'indice {0} per "{1}". Tutti i dati forniti tramite "IDataSource" devono essere serializzabili. Se è necessario testare origini dati non serializzabili, assicurarsi di aggiungere l'attributo "TestDataSourceDiscovery" nell'assembly di test e impostare l'opzione di individuazione su "DuringExecution".
ja: "{1}" のインデックス {0} のデータをシリアル化できません。"IDataSource" を介して提供されるすべてのデータはシリアル化可能である必要があります。シリアル化できないデータ ソースをテストする必要がある場合は、テスト アセンブリに "TestDataSourceDiscovery" 属性を追加し、検出オプションを "DuringExecution" に設定してください。
ko: "{1}"에 대한 {0} 인덱스의 데이터를 직렬화할 수 없습니다. "IDataSource"를 통해 제공된 모든 데이터를 직렬화할 수 있어야 합니다. 직렬화할 수 없는 데이터 원본을 테스트해야 하는 경우 테스트 어셈블리에 "TestDataSourceDiscovery" 특성을 추가하고 검색 옵션을 "DuringExecution"으로 설정하세요.
pl: Nie można serializować danych w indeksie {0} dla „{1}”. Wszystkie dane dostarczane za pomocą źródła „IDataSource” powinny być możliwe do serializacji. Jeśli chcesz przetestować nieserializowalne źródła danych, upewnij się, że dodasz atrybut „ TestDataSourceDiscovery” w zestawie testowym i ustaw opcję odnajdywania na wartość „DuringExecution”.
ru: Не удается сериализовать данные в индексе {0} для "{1}". Все данные, предоставленные через IDataSource, должны быть сериализуемыми. Если необходимо протестировать несериализуемые источники данных, добавьте атрибут "TestDataSourceDiscovery" в тестовую сборку и установите для параметра обнаружения значение "DuringExecution".

# DiscoveryWarning
source: [MSTest][Discovery][{0}] {1}
it: [MSTest][Individuazione][{0}] {1}
ko: [MSTest][검색][{0}] {1}

# AssemblyCleanupWasCancelled
source: Assembly cleanup method '{0}.{1}' was cancelled
it: Il metodo di pulizia dell'assembly '{0}.{1}' è stato annullato
ja: アセンブリ クリーンアップ メソッド '{0}.{1}' が取り消されました
ru: Метод очистки сборки "{0}.{1}" отменен

# AssemblyInitializeWasCancelled
source: Assembly initialize method '{0}.{1}' was cancelled
it: Il metodo di inizializzazione dell'assembly "{0}.{1}" è stato annullato
ja: アセンブリ初期化メソッド '{0}.{1}' が取り消されました
pl: Anulowano metodę inicjowania zestawu „{0}.{1}”.
ru: Метод инициализации сборки "{0}.{1}" отменен

# ClassCleanupWasCancelled
source: Class cleanup method '{0}.{1}' was cancelled
it: Il metodo di pulizia della classe '{0}.{1}' è stato annullato
ja: クラス クリーンアップ メソッド '{0}.{1}' が取り消されました
ru: Метод очистки класса "{0}.{1}" отменен

# ClassInitializeWasCancelled
source: Class initialize method '{0}.{1}' was cancelled
it: Il metodo di inizializzazione della classe "{0}.{1}" è stato annullato
ja: クラス初期化メソッド '{0}.{1}' が取り消されました
pl: Anulowano metodę inicjowania klasy „{0}.{1}”.
ru: Метод инициализации класса "{0}.{1}" отменен

# TestCleanupWasCancelled
source: Test cleanup method '{0}.{1}' was cancelled
it: Il metodo di pulizia del test '{0}.{1}' è stato annullato
ja: テスト クリーンアップ メソッド '{0}.{1}' が取り消されました
ru: Метод очистки теста "{0}.{1}" отменен

# TestInitializeWasCancelled
source: Test initialize method '{0}.{1}' was cancelled
it: Il metodo di inizializzazione del test '{0}.{1}' è stato annullato
ja: テスト初期化メソッド '{0}.{1}' が取り消されました
ru: Метод инициализации теста "{0}.{1}" отменен

# AssemblyCleanupTimedOut
source: Assembly cleanup method '{0}.{1}' timed out
it: Il metodo di pulizia dell'assembly '{0}.{1}' è scaduto
ja: アセンブリ クリーンアップ メソッド '{0}.{1}' がタイムアウトしました

# AssemblyInitializeTimedOut
source: Assembly initialize method '{0}.{1}' timed out
it: Timeout del metodo di inizializzazione dell'assembly "{0}.{1}"
ja: アセンブリ初期化メソッド '{0}.{1}' がタイムアウトになりました
pl: Upłynął limit czasu metody inicjowania zestawu „{0}.{1}”.

# ClassCleanupTimedOut
source: Class cleanup method '{0}.{1}' timed out
it: Il metodo di pulizia della classe '{0}.{1}' è scaduto
ja: クラス クリーンアップ メソッド '{0}.{1}' がタイムアウトしました

# ClassInitializeTimedOut
source: Class initialize method '{0}.{1}' timed out
it: Timeout del metodo di inizializzazione della classe "{0}.{1}"
ja: クラス初期化メソッド '{0}.{1}' がタイムアウトになりました
pl: Upłynął limit czasu metody inicjowania klasy „{0}.{1}”.

# TestCleanupTimedOut
source: Test cleanup method '{0}.{1}' timed out
it: Il metodo di pulizia del test '{0}.{1}' è scaduto
ja: テスト クリーンアップ メソッド '{0}.{1}' がタイムアウトしました

# TestInitializeTimedOut
source: Test initialize method '{0}.{1}' timed out
it: Il metodo di inizializzazione del test '{0}.{1}' è scaduto
ja: テスト初期化メソッド '{0}.{1}' がタイムアウトになりました

# UTA_ErrorInvalidTimeout
source: UTA054: {0}.{1} has invalid Timeout attribute. The timeout must be a valid integer value and cannot be less than 0.
it: UTA054: l'attributo Timeout di {0}.{1} non è valido. Il timeout deve essere un valore intero valido non minore di 0.
ja: UTA054: {0}.{1} は無効な Timeout 属性を含んでいます。タイムアウトは有効な整数値でなければなりません。0 よりも小さい値にすることはできません。
pl: UTA054: {0}.{1} ma nieprawidłowy atrybut Timeout. Limit czasu musi być prawidłową liczbą całkowitą i nie może być mniejszy niż 0.

# UTA_NoDefaultConstructor
source: Unable to get default constructor for class {0}.
it: Non è possibile ottenere il costruttore predefinito per la classe {0}.
ja: クラス {0} の既定コンストラクターを取得できません。
pl: Nie można pobrać domyślnego konstruktora dla klasy {0}.

# UTA_TestMethodExpectedParameters
source: Only data driven test methods can have parameters. Did you intend to use [DataRow] or [DynamicData]?
ja: データ ドリブン テスト メソッドのみがパラメーターを使用できます。[DataRow] または [DynamicData] の使用を意図していましたか?
pl: Tylko metody testowe bazujące na danych mogą mieć parametry. Czy chodziło Ci o użycie elementu [DataRow] lub [DynamicData]?
