Repository: microsoft/testfx
Catalog: src/Adapter/MSTest.TestAdapter/Resources/xlf/Resource.*.xlf
Languages: cs, it, ja, ko, pl, ru

# AssemblyCleanupTimedOut
source: Assembly cleanup method '{0}.{1}' timed out after {2}ms
cs: Po {2} ms vypršel časový limit metody čištění sestavení {0}.{1}.
ko: {2}밀리초 후 어셈블리 정리 메서드 '{0}.{1}'이(가) 시간 초과되었습니다.
ru: Время ожидания метода очистки сборки "{0}.{1}" истекло через {2} мс

# AssemblyCleanupWasCancelled
source: Assembly cleanup method '{0}.{1}' was canceled
cs: Metoda čištění sestavení {0}.{1} byla zrušena.
ko: 어셈블리 정리 메서드 '{0}.{1}'이(가) 취소되었습니다.

# AssemblyInitializeTimedOut
source: Assembly initialize method '{0}.{1}' timed out after {2}ms
cs: Po {2} ms vypršel časový limit metody inicializace sestavení {0}.{1}.
ko: {2}밀리초 후 '{0}.{1}' 어셈블리 초기화 메서드의 시간이 초과되었습니다.
ru: Время ожидания метода инициализации сборки "{0}.{1}" истекло через {2} мс

# AssemblyInitializeWasCancelled
source: Assembly initialize method '{0}.{1}' was canceled
cs: Metoda inicializace sestavení {0}.{1} byla zrušena.
ko: 어셈블리 초기화 메서드 '{0}.{1}'(이)가 취소되었습니다.

# CannotRunTestArgumentsMismatchError
source: Cannot run test method '{0}.{1}': Test data doesn't match method parameters. Either the count or types are different. Test expected {2} parameter(s), with types '{3}', but received {4} argument(s), with types '{5}'.
cs: Testovací metodu {0}.{1} nejde spustit: Testovací data neodpovídají parametrům metody. Liší se počet nebo typy. Pro test se očekával tento počet parametrů: {2} s typy {3}, byl však přijat tento počet argumentů: {4} s typy {5}.
ko: 테스트 메서드 '{0}{1}'을(를) 실행할 수 없음: 테스트 데이터가 메서드 매개 변수와 일치하지 않습니다. 개수 또는 형식이 다릅니다. 테스트에 {2} 매개 변수로 ‘{3}’ 형식이 필요하지만, {4} 인수의 ‘{5}’ 형식을 받았습니다.
ru: Не удается запустить метод теста "{0}.{1}": тестовые данные не соответствуют параметрам метода. Количество или типы отличаются. Число ожидаемых для теста параметров: {2} с типами "{3}", но число полученных аргументов: {4} с типами "{5}".

# CannotRunTestMethodNoDataError
source: Cannot run test method '{0}.{1}': Method has parameters, but does not define any test source. Use '[DataRow]', '[DynamicData]', or a custom 'ITestDataSource' data source to provide test data.
cs: Nelze spustit testovací metodu {0}.{1}: Metoda má parametry, ale nedefinuje žádný zdroj testu. K poskytování testovacích dat použijte zdroj dat [DataRow] nebo [DynamicData], případně vlastní zdroj dat ITestDataSource.
ko: 테스트 메서드 '{0}{1}'을(를) 실행할 수 없음: 메서드에 매개 변수가 있지만 테스트 원본을 정의하지 않습니다. '[DataRow]', '[DynamicData]' 또는 사용자 지정 'ITestDataSource' 데이터 원본을 사용하여 테스트 데이터를 제공합니다.
ru: Не удается запустить метод теста "{0}.{1}": метод имеет параметры, но не определяет источник теста. Используйте "[DataRow]", "[DynamicData]" или настраиваемый источник данных "ITestDataSource" для предоставления тестовых данных.

# ClassCleanupTimedOut
source: Class cleanup method '{0}.{1}' timed out after {2}ms
cs: Po {2} ms vypršel časový limit metody čištění třídy {0}.{1}.
ko: {2}밀리초 후 클래스 정리 메서드 '{0}.{1}'이(가) 시간 초과되었습니다.
ru: Время ожидания метода очистки класса "{0}.{1}" истекло через {2} мс

# ClassCleanupWasCancelled
source: Class cleanup method '{0}.{1}' was canceled
cs: Metoda čištění třídy {0}.{1} byla zrušena.
ko: 클래스 정리 메서드 '{0}.{1}'이(가) 취소되었습니다.

# ClassInitializeTimedOut
source: Class initialize method '{0}.{1}' timed out after {2}ms
cs: Po {2} ms vypršel časový limit metody inicializace třídy {0}.{1}.
ko: {2}밀리초 후 '{0}.{1}' 클래스 초기화 메서드의 시간이 초과되었습니다.
ru: Время ожидания метода инициализации класса "{0}.{1}" истекло через {2} мс

# ClassInitializeWasCancelled
source: Class initialize method '{0}.{1}' was canceled
cs: Metoda inicializace třídy {0}.{1} byla zrušena.
ko: '클래스 초기화 메서드 '{0}.{1}'이(가) 취소되었습니다.

# DynamicDataShouldBeValidMessageFormat_MemberType
source: '[DynamicData]' referenced member '{0}.{1}' should return 'IEnumerable<object[]>', 'IEnumerable<Tuple>` or 'IEnumerable<ValueTuple>'
cs: Odkazovaný člen [DynamicData] {0}.{1} by měl vracet IEnumerable<object[]>, IEnumerable<Tuple> nebo IEnumerable<ValueTuple>.

# Execution_Test_Timeout
source: Test '{0}' exceeded execution timeout period.
cs: Test {0} překročil časový limit spuštění.
it: È stato superato il periodo di timeout per l'esecuzione del test '{0}'.
ja: テスト '{0}' は実行タイムアウトを超えました。
ko: '{0}' 테스트가 실행 시간 제한을 초과했습니다.
pl: Test „{0}” przekroczył okres limitu czasu na wykonanie.
ru: Превышено время ожидания выполнения теста "{0}".

# InvalidValue
source: Invalid value '{0}' for runsettings entry '{1}', setting will be ignored.
cs: Neplatná hodnota {0} pro položku runsettings {1}. Nastavení bude ignorováno.

# STAIsOnlySupportedOnWindowsWarning
source: Runsettings entry '<ExecutionApartmentState>STA</ExecutionApartmentState>' is not supported on non-Windows OSes.
cs: Položka runsettings <ExecutionApartmentState>STA</ExecutionApartmentState> se v operačních systémech jiných než Windows nepodporuje.
ko: Runsettings 항목 '<ExecutionApartmentState>STA</ExecutionApartmentState>'는 Windows 이외의 OS에서는 지원되지 않습니다.
ru: Запись Runsettings "<ExecutionApartmentState>STA</ExecutionApartmentState>" не поддерживается в ОС, отличных от Windows.

# SourcesNotSupported
source: Running tests in any of the provided sources is not supported for the selected platform
cs: Spouštění testů v některém z uvedených zdrojů se pro vybranou platformu nepodporuje.
it: L'esecuzione di test in una delle origini specificate non è supportata per la piattaforma selezionata
ja: 指定されたソースのいずれかでのテストの実行は、選択されたプラットフォームでサポートされていません
ko: 선택된 플랫폼의 경우 제공된 소스에서 테스트를 실행할 수 없습니다.
pl: Uruchamianie testów w żadnym z podanych źródeł nie jest obsługiwane dla wybranej platformy
ru: Запуск тестов в любом из предоставленных источников не поддерживается на выбранной платформе

# TestCleanupTimedOut
source: Test cleanup method '{0}.{1}' timed out after {2}ms
cs: Po {2} ms vypršel časový limit metody čištění testu {0}.{1}.
ko: {2}밀리초 후 테스트 정리 메서드 '{0}.{1}'이(가) 시간 초과되었습니다.
ru: Время ожидания метода очистки теста "{0}.{1}" истекло через {2} мс

# TestCleanupWasCancelled
source: Test cleanup method '{0}.{1}' was canceled
cs: Metoda čištění testu {0}.{1} byla zrušena.
ko: 테스트 정리 메서드 '{0}.{1}'이(가) 취소되었습니다.

# TestInitializeTimedOut
source: Test initialize method '{0}.{1}' timed out after {2}ms
cs: Po {2} ms vypršel časový limit metody inicializace testu {0}.{1}.
ko: {2}밀리초 후 '{0}.{1}' 테스트 초기화 메서드의 시간이 초과되었습니다.
ru: Время ожидания метода инициализации теста "{0}.{1}" истекло через {2} мс

# TestInitializeWasCancelled
source: Test initialize method '{0}.{1}' was canceled
cs: Metoda inicializace testu {0}.{1} byla zrušena.
ko: 테스트 초기화 메서드 '{0}.{1}'이(가) 취소되었습니다.

# UTA_CleanupMethodThrows
source: TestCleanup method {0}.{1} threw exception. {2}.
cs: Metoda TestCleanup {0}.{1} vyvolala výjimku. {2}.
it: Il metodo TestCleanup {0}.{1} ha generato un'eccezione. {2}.
ja: TestCleanup メソッド {0}.{1} は例外をスローしました。{2}。
ko: TestCleanup 메서드 {0}.{1}에서 예외가 발생했습니다. {2}.
pl: Metoda TestCleanup {0}.{1} zgłosiła wyjątek {2}.
ru: Метод TestCleanup {0}.{1} создал исключение. {2}.

# UTA_EndOfInnerExceptionTrace
source: --- End of inner exception stack trace ---
cs: --- Konec trasování zásobníku pro vnitřní výjimku ---
it: --- Fine dell'analisi dello stack dell'eccezione interna ---
ja: --- 内部例外スタック トレースの終わり ---
ko: --- 내부 예외 스택 추적의 끝 ---
pl: --- Koniec śledzenia stosu wyjątku wewnętrznego ---
ru: --- Конец трассировки стека внутренних исключений ---

# UTA_ErrorMultiAssemblyClean
source: UTA014: {0}: Cannot define more than one method with the AssemblyCleanup attribute inside an assembly.
cs: UTA014: {0}: V jednom sestavení nejde definovat více jak jednu metodu s atributem AssemblyCleanup.
it: UTA014: {0}: non è possibile definire più di un metodo con l'attributo AssemblyCleanup all'interno di un assembly.
ja: UTA014: {0}: 1 つのアセンブリ内で、AssemblyCleanup 属性を伴う 2 つ以上のメソッドを定義することはできません。
ko: UTA014: {0}: 어셈블리 내부에서 AssemblyCleanup 특성을 사용하는 메서드를 여러 개 정의할 수 없습니다.
pl: UTA014: {0}: W zestawie nie można zdefiniować więcej niż jednej metody z atrybutem AssemblyCleanup.
ru: UTA014: {0}: в сборке невозможно определить несколько методов с атрибутом AssemblyCleanup.

# UTA_ErrorMultiAssemblyInit
source: UTA013: {0}: Cannot define more than one method with the AssemblyInitialize attribute inside an assembly.
cs: UTA013: {0}: V jednom sestavení nejde definovat více jak jednu metodu s atributem AssemblyInitialize.
it: UTA013: {0}: non è possibile definire più di un metodo con l'attributo AssemblyInitialize all'interno di un assembly.
ja: UTA013: {0}: 1 つのアセンブリ内で、AssemblyInitialize 属性を伴う 2 つ以上のメソッドを定義することはできません。
ko: UTA013: {0}: 어셈블리 내부에서 AssemblyInitialize 특성을 사용하는 메서드를 여러 개 정의할 수 없습니다.
pl: UTA013: {0}: W zestawie nie można zdefiniować więcej niż jednej metody z atrybutem AssemblyInitialize.
ru: UTA013: {0}: в сборке невозможно определить несколько методов с атрибутом AssemblyInitialize.

# UTA_ErrorMultiClassClean
source: UTA026: {0}: Cannot define more than one method with the ClassCleanup attribute inside a class.
cs: UTA026: {0}: Uvnitř třídy nejde definovat více jak jednu metodu s atributem ClassCleanup.
it: UTA026: {0}: non è possibile definire più di un metodo con l'attributo ClassCleanup all'interno di una classe.
ja: UTA026: {0}: 1 つのクラス内で、ClassCleanup 属性を伴う 2 つ以上のメソッドを定義することはできません。
ko: UTA026: {0}: 클래스 내부에서 ClassCleanup 특성을 사용하는 메서드를 여러 개 정의할 수 없습니다.
pl: UTA026: {0}: W klasie nie można zdefiniować więcej niż jednej metody z atrybutem ClassCleanup.
ru: UTA026: {0}: в классе невозможно определить несколько методов с атрибутом ClassCleanup.

# UTA_ErrorMultiClassInit
source: UTA025: {0}: Cannot define more than one method with the ClassInitialize attribute inside a class.
cs: UTA025: {0}: Uvnitř třídy nejde definovat více jak jednu metodu s atributem ClassInitialize.
it: UTA025: {0}: non è possibile definire più di un metodo con l'attributo ClassInitialize all'interno di una classe.
ja: UTA025: {0}: 1 つのクラス内で、ClassInitialize 属性を伴う 2 つ以上のメソッドを定義することはできません。
ko: UTA025: {0}: 클래스 내부에서 ClassInitialize 특성을 사용하는 메서드를 여러 개 정의할 수 없습니다.
pl: UTA025: {0}: W klasie nie można zdefiniować więcej niż jednej metody z atrybutem ClassInitialize.
ru: UTA025: {0}: в классе невозможно определить несколько методов с атрибутом ClassInitialize.

# UTA_ErrorMultiClean
source: UTA024: {0}: Cannot define more than one method with the TestCleanup attribute.
cs: UTA024: {0}: Nejde definovat více jak jednu metodu s atributem TestCleanup.
it: UTA024: {0}: non è possibile definire più di un metodo con l'attributo TestCleanup.
ja: UTA024: {0}: TestCleanup 属性を伴う 2 つ以上のメソッドを定義することはできません。
ko: UTA024: {0}: TestCleanup 특성을 사용하는 메서드를 여러 개 정의할 수 없습니다.
pl: UTA024: {0}: Nie można zdefiniować więcej niż jednej metody z atrybutem TestCleanup.
ru: UTA024: {0}: невозможно определить несколько методов с атрибутом TestCleanup.

# UTA_ErrorMultiInit
source: UTA018: {0}: Cannot define more than one method with the TestInitialize attribute.
cs: UTA018: {0}: Nejde definovat více jak jednu metodu s atributem TestInitialize.
it: UTA018: {0}: non è possibile definire più di un metodo con l'attributo TestInitialize.
ja: UTA018: {0}: TestInitialize 属性を伴う 2 つ以上のメソッドを定義することはできません。
ko: UTA018: {0}: TestInitialize 특성을 사용하는 메서드를 여러 개 정의할 수 없습니다.
pl: UTA018: {0}: Nie można zdefiniować więcej niż jednej metody z atrybutem TestInitialize.
ru: UTA018: {0}: невозможно определить несколько методов с атрибутом TestInitialize.

# UTA_ErrorTestClassIsGenericNonAbstract
source: TestClass attribute defined on generic non-abstract class {0}
cs: Atribut TestClass definovaný u obecné neabstraktní třídy {0}
it: Attributo TestClass definito nella classe generica non astratta {0}
ja: 汎用の非抽象クラス {0}で定義された TestClass 属性
ko: 일반 비추상 클래스 {0}에 정의된 TestClass 속성
ru: Атрибут TestClass, определенный в универсальном не абстрактном классе {0}

# UTA_InitMethodThrows
source: Initialization method {0}.{1} threw exception. {2}.
cs: Inicializační metoda {0}.{1} způsobila výjimku. {2}.
it: Il metodo di inizializzazione {0}.{1} ha generato un'eccezione. {2}.
ja: 初期化メソッド {0}.{1} は例外をスローしました。{2}。
ko: 초기화 메서드 {0}.{1}에서 예외를 throw했습니다. {2}.
pl: Metoda inicjowania {0}.{1} zgłosiła wyjątek. {2}.
ru: Метод инициализации {0}.{1} вызвал исключение. {2}.

# UTA_InstanceCreationError
source: Unable to create instance of class {0}. Error: {1}.
cs: Nepodařilo se vytvořit instanci třídy {0}. Chyba: {1}.
it: Non è possibile creare un'istanza della classe {0}. Errore: {1}.
ja: クラス {0} のインスタンスを作成できません。エラー: {1}。
ko: {0} 클래스의 인스턴스를 만들 수 없습니다. 오류: {1}
pl: Nie można utworzyć wystąpienia klasy {0}. Błąd: {1}.
ru: Не удалось создать экземпляр класса {0}. Ошибка: {1}.

# UTA_NoValidConstructor
source: Cannot find a valid constructor for test class '{0}'. Valid constructors are 'public' and either parameterless or with one parameter of type 'TestContext'.
cs: Nelze najít platný konstruktor pro testovací třídu {0}. Platné konstruktory jsou public a buď bez parametrů, nebo s jedním parametrem typu TestContext.
ko: 테스트 클래스 '{0}'에 대한 유효한 생성자를 찾을 수 없습니다. 유효한 생성자는 'public'이며 매개 변수가 없거나 'TestContext' 유형의 매개 변수가 하나 있습니다.

# UTA_TestContextSetError
source: Unable to set TestContext property for the class {0}. Error: {1}.
cs: Pro třídu {0} se nepodařilo nastavit vlastnost TestContext. Chyba: {1}.
it: Non è possibile impostare la proprietà TestContext per la classe {0}. Errore: {1}.
ja: クラス {0} の TestContext プロパティを設定できません。エラー: {1}。
ko: {0} 클래스에 대해 TestContext 속성을 설정할 수 없습니다. 오류: {1}
pl: Nie można ustawić właściwości TestContext w klasie {0}. Błąd: {1}.
ru: Не удалось задать свойство TestContext для класса {0}. Ошибка: {1}.

# UTF_FailedToGetExceptionMessage
source: (Failed to get the message for an exception of type {0} due to an exception.)
cs: (Z důvodu výjimky se nepodařilo získat zprávu o výjimce typu {0}.)
it: Non è stato possibile ottenere il messaggio per un'eccezione di tipo {0} a causa di un'eccezione.
ja: (例外が発生したため、型 {0} の例外のメッセージを取得できませんでした。)
ko: (예외로 인해 {0} 형식의 예외에 대한 메시지를 가져오지 못했습니다.)
pl: (Nie można pobrać komunikatu dotyczącego wyjątku typu {0} z powodu wyjątku).
ru: (Не удалось получить сообщение для исключения с типом {0} в связи с возникновением исключения.)

# UTA_ErrorInValidTestContextSignature
source: UTA031: class {0} does not have valid TestContext property. TestContext must be of type TestContext, must be non-static, public and must not be read-only. For example: public TestContext TestContext.
cs: UTA031: Třída {0} neobsahuje platnou vlastnost TestContext. Vlastnost TestContext musí být typu TestContext, musí být nestatická, veřejná a nemůže být určena jenom pro čtení. Například: public TestContext TestContext.
it: UTA031: la classe {0} non contiene una proprietà TestContext valida. TestContext deve essere una proprietà di tipo TestContext, non statica, pubblica e non di sola lettura. Esempio: public TestContext TestContext.
ja: UTA031: クラス {0} は有効な TestContext プロパティを含んでいません。TestContext は、型 TestContext でなければなりません。また、non-static および public である必要があり、読み取り専用に指定することはできません。例: public TestContext TestContext。
ko: UTA031: {0} 클래스에 올바른 TestContext 속성이 없습니다. TestContext는 TestContext 형식이어야 하고 읽기 전용이 아니어야 하며, static이 아니고 public이어야 합니다. 예: public TestContext TestContext.
pl: UTA031: Klasa {0} nie ma prawidłowej właściwości TestContext. Właściwość TestContext musi być typu TestContext, niestatyczna, publiczna i nie może być tylko do odczytu. Na przykład : public TestContext TestContext.
ru: UTA031: в классе {0} отсутствует допустимое свойство TestContext. Свойство TestContext должно иметь тип TestContext, быть нестатическим, открытым и не должно быть предназначено только для чтения. Например: public TestContext TestContext.

# UTA_ErrorNonPublicTestClass
source: UTA001: TestClass attribute defined on non-public class {0}
cs: UTA001: Atribut TestClass se definoval v neveřejné třídě {0}.
it: UTA001: è stato definito l'attributo TestClass per la classe non pubblica {0}
ja: UTA001: TestClass 属性がパブリックでないクラス {0} で定義されています
ko: UTA001: public이 아닌 클래스 {0}에서 TestClass 특성을 정의했습니다.
pl: UTA001: Atrybut TestClass zdefiniowany dla niepublicznej klasy {0}
ru: UTA001: атрибут TestClass определен в классе {0}, не являющемся открытым

# CouldNotInspectTypeDuringDiscovery
source: MSTestAdapter failed to discover tests in class '{0}' of assembly '{1}' because {2}.
cs: MSTestAdapter nezjistil v třídě {0} sestavení {1} žádný test, protože: {2}.
it: MSTestAdapter non è riuscito a individuare test nella classe '{0}' dell'assembly '{1}' perché {2}.
ja: MSTestAdapter でアセンブリ '{1}' のクラス '{0}' にテストが見つかりませんでした。理由 {2}。
ko: MSTestAdapter가 {2} 때문에 어셈블리 '{1}'의 클래스 '{0}'에서 테스트를 검색하지 못했습니다.
pl: Adapter MSTestAdapter nie mógł odnaleźć testów w klasie „{0}” zestawu „{1}”, przyczyna: {2}.
ru: Средству MSTestAdapter не удалось обнаружить тесты в классе "{0}" сборки "{1}", так как {2}.

# TypeLoadFailed
source: Unable to load types from the test source '{0}'. Some or all of the tests in this source may not be discovered. Error: {1}
cs: Nepovedlo se načíst typy ze zdroje testu {0}. Je možné, že se některé nebo všechny testy v tomto zdroji nezjistily. Chyba: {1}
it: Non è possibile caricare i tipi dall'origine test '{0}'. È possibile che alcuni o tutti i test non siano stati individuati in questa origine. Errore: {1}
ja: テスト ソース '{0}' から型を読み込むことができません。このソース内の一部またはすべてのテストが見つからない可能性があります。 エラー: {1}
ko: 테스트 소스 '{0}'에서 형식을 로드할 수 없습니다. 이 소스의 일부 또는 모든 테스트를 검색할 수 없습니다. 오류: {1}
pl: Nie można załadować typów ze źródła testów „{0}”. Niektóre lub wszystkie testy w tym źródle mogły nie zostać odnalezione. Błąd: {1}
ru: Не удалось загрузить типы из тестового источника "{0}". В этом источнике могут быть не обнаружены некоторые или все тесты. Ошибка: {1}

# UTA_ErrorGenericTestMethod
source: UTA015: A generic method cannot be a test method. {0}.{1} has invalid signature
cs: UTA015: Obecná metoda nemůže být testovací metodou. {0}.{1} má neplatný podpis.
it: UTA015: un metodo generico non può essere un metodo di test. La firma di {0}.{1} non è valida
ja: UTA015: ジェネリック メソッドがテスト メソッドになることはできません。{0}.{1} のシグネチャは無効です
ko: UTA015: 제네릭 메서드는 테스트 메서드일 수 없습니다. {0}.{1}에 잘못된 서명이 있습니다.
pl: UTA015: Metoda ogólna nie może być metodą testową. {0}{1} ma nieprawidłową sygnaturę
ru: UTA015: универсальный метод не может быть методом теста. {0}.{1} имеет недопустимую сигнатуру

# TestAssembly_FileDoesNotExist
source: File does not exist: {0}
cs: Neexistující soubor: {0}
it: Il file {0} non esiste
ja: ファイルが存在しません: {0}
ko: 파일이 없습니다. {0}
pl: Plik nie istnieje: {0}
ru: Файл не существует: {0}

# UTA_ErrorIncorrectTestMethodSignature
source: UTA007: Method {1} defined in class {0} does not have correct signature. Test method marked with the [TestMethod] attribute must be non-static, public, return-type as void and should not take any parameter. Example: public void Test.Class1.Test(). Additionally, if you are using async-await in test method then return-type must be 'Task' or 'ValueTask'. Example: public async Task Test.Class1.Test2()
cs: UTA007: Metoda {1} definovaná ve třídě {0} nemá správný podpis. Testovací metoda označená atributem [TestMethod] nesmí být static ani public, musí mít návratový typ void a nesmí přijímat žádný parametr. Například: public void Test.Class1.Test(). Pokud navíc v testovací metodě používáte operátor async-await, musí být návratový typ Task nebo ValueTask. Například: public async Task Test.Class1.Test2()
it: UTA007: la firma del metodo {1} definito nella classe {0} non è corretta. Il metodo di test contrassegnato con l'attributo [TestMethod] deve essere pubblico e non statico, non deve accettare parametri e deve includere un tipo restituito void. Esempio: public void Test.Class1.Test(). Se inoltre nel metodo di test si usa async-await, il tipo restituito deve essere 'Task' o 'ValueTask'. Esempio: public async Task Test.Class1.Test2()
ja: UTA007: クラス {0} で定義されているメソッド {1} に適切なシグネチャが含まれていません。[TestMethod] 属性でマークされたテスト メソッドは、non-static および public である必要があり、戻り値の型は void である必要があります。また、パラメーターを受け取ることはできません。例: public void Test.Class1.Test()。また、テスト メソッドで async-await を使用している場合、戻り値の型は 'Task' または 'ValueTask' である必要があります。例: public async Task Test.Class1.Test2()
ko: UTA007: 클래스 {0}에 정의된 메서드 {1}에 올바른 서명이 없습니다. [TestMethod] 특성으로 표시된 테스트 메서드는 non-static, public, return-type이 void여야 하며 매개 변수를 사용하지 않아야 합니다. 예: public void Test.Class1.Test(). 또한 테스트 메서드에서 비동기 대기를 사용하는 경우 반환 형식은 Task여야 합니다. 예: public async Task Test.Class1.Test2()
pl: UTA007: Metoda {1} zdefiniowana w klasie {0} nie ma poprawnej sygnatury. Metoda testowa oznaczona przez atrybut [TestMethod] musi być niestatyczna, publiczna, zwracać wartość typu void i nie powinna przyjmować żadnego parametru. Przykład: public void Test.Class1.Test(). Ponadto zwracana wartość musi być typu Task, gdy w metodzie testowej jest używane oczekiwanie asynchroniczne. Przykład: public async Task Test.Class1.Test2()
ru: UTA007: метод {1}, определенный в классе {0}, имеет неправильную сигнатуру. Метод теста, помеченный атрибутом [TestMethod], должен быть нестатическим, открытым и иметь тип возвращаемого значения void; он также не должен принимать параметры. Пример: public void Test.Class1.Test(). Кроме того, при использовании async-await в методе теста возвращаемое значение должно иметь тип "Task" или "ValueTask". Пример: public async Task Test.Class1.Test2()

# TestContextIsNull
source: TestContext cannot be Null.
cs: TestContext nemůže být Null.
it: TestContext non può essere Null.
ja: TestContext を Null にすることはできません。
ko: TestContext는 null일 수 없습니다.
pl: Wartość TestContext nie może być równa null.
ru: TestContext не может иметь значение NULL.

# UTA_AssemblyCleanupMethodWasUnsuccesful
source: Assembly Cleanup method {0}.{1} failed. Error Message: {2}. StackTrace: {3}
cs: Čisticí metoda sestavení {0}.{1} selhala. Chybová zpráva: {2}. Trasování zásobníku: {3}
it: Il metodo di pulizia assembly {0}.{1} non è riuscito. Messaggio di errore: {2}. Analisi dello stack: {3}
ja: アセンブリ クリーンアップ メソッド {0}.{1} に失敗しました。エラー メッセージ: {2}。スタック トレース: {3}
ko: 어셈블리 정리 메서드 {0}.{1}이(가) 실패했습니다. 오류 메시지: {2}. StackTrace: {3}
pl: Metoda czyszczenia zestawu {0}.{1} nie powiodła się. Komunikat o błędzie: {2}. Ślad stosu: {3}
ru: Не удалось применить метод очистки сборки {0}.{1}. Сообщение об ошибке: {2}. Трассировка стека (StackTrace): {3}.

# UTA_AssemblyInitMethodThrows
source: Assembly Initialization method {0}.{1} threw exception. {2}: {3}. Aborting test execution.
cs: Inicializační metoda sestavení {0}.{1} vyvolala výjimku. {2}: {3}. Přerušuje se provádění testu.
it: Il metodo di inizializzazione assembly {0}.{1} ha generato un'eccezione. {2}: {3}. L'esecuzione del test verrà interrotta.
ja: アセンブリ初期化メソッド {0}.{1} は例外をスローしました。{2}: {3}。テストの実行を中止しています。
ko: 어셈블리 초기화 메서드 {0}.{1}에서 예외를 throw했습니다. {2}: {3}. 테스트 실행을 중단합니다.
pl: Metoda inicjująca zestaw {0}.{1} nie powiodła się. {2}: {3}. Przerywanie wykonywania testu.
ru: Методом инициализации сборки {0}.{1} создано исключение. {2}: {3}. Выполнение теста прекращается.

# UTA_ClassCleanupMethodWasUnsuccesful
source: Class Cleanup method {0}.{1} failed. Error Message: {2}. Stack Trace: {3}
cs: Čisticí metoda třídy {0}.{1} selhala. Chybová zpráva: {2}. Trasování zásobníku: {3}
it: Il metodo di pulizia classi {0}.{1} non è riuscito. Messaggio di errore: {2}. Analisi dello stack: {3}
ja: クラス クリーンアップ メソッド {0}.{1} に失敗しました。エラー メッセージ: {2}。スタック トレース: {3}
ko: 클래스 정리 메서드 {0}.{1}이(가) 실패했습니다. 오류 메시지: {2}. 스택 추적: {3}
pl: Metoda czyszczenia klasy {0}.{1} nie powiodła się. Komunikat o błędzie: {2}. Ślad stosu: {3}
ru: Не удалось применить метод очистки класса {0}.{1}. Сообщение об ошибке: {2}. Трассировка стека: {3}.

# UTA_ClassInitMethodThrows
source: Class Initialization method {0}.{1} threw exception. {2}: {3}.
cs: Inicializační metoda třídy {0}.{1} vyvolala výjimku. {2}: {3}.
it: Il metodo di inizializzazione classi {0}.{1} ha generato un'eccezione. {2}: {3}.
ja: クラス初期化メソッド {0}.{1} は例外をスローしました。{2}: {3}。
ko: 클래스 초기화 메서드 {0}.{1}에서 예외를 throw했습니다. {2}: {3}
pl: Metoda inicjowania klasy {0}.{1} zgłosiła wyjątek. {2}: {3}.
ru: Методом инициализации класса {0}.{1} создано исключение. {2}: {3}.
