Repository: microsoft/testfx
Catalog: src/TestFramework/TestFramework/Resources/xlf/FrameworkMessages.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AccessStringInvalidSyntax
source: Access string has invalid syntax.
cs: Přístupový řetězec má neplatnou syntaxi.
de: Die Zugriffszeichenfolge weist eine ungültige Syntax auf.
es: La cadena de acceso tiene una sintaxis no válida.
fr: La chaîne Access possède une syntaxe non valide.
it: La sintassi della stringa di accesso non è valida.
ja: アクセス文字列は無効な構文を含んでいます。
ko: 액세스 문자열의 구문이 잘못되었습니다.
pl: Ciąg dostępu ma nieprawidłową składnię.
pt_br: A cadeia de caracteres de acesso tem sintaxe inválida.
ru: Строка доступа имеет недопустимый синтаксис.
tr: Erişim dizesi geçersiz söz dizimine sahip.
zh_hans: 访问字符串的语法无效。
zh_hant: 存取字串有無效的語法。

# ActualHasMismatchedElements
source: The expected collection contains {1} occurrence(s) of <{2}>. The actual collection contains {3} occurrence(s). {0}
cs: Očekávaná kolekce obsahuje {1} výskyt(ů) <{2}>. Aktuální kolekce obsahuje {3} výskyt(ů). {0}
de: Die erwartete Sammlung enthält {1} Vorkommen von <{2}>. Die tatsächliche Sammlung enthält {3} Vorkommen. {0}
es: Apariciones que contiene la colección esperada: {1} de <{2}>. Apariciones que contiene la colección real: {3}. {0}
fr: La collection attendue contient {1} occurrence(s) de <{2}>. La collection réelle contient {3} occurrence(s). {0}
it: La raccolta prevista contiene {1} occorrenza/e di <{2}>. La raccolta effettiva contiene {3} occorrenza/e. {0}
ja: 予期されたコレクションでは、<{2}> が {1} 回発生します。実際のコレクションでは、{3} 回発生します。{0}
ko: 필요한 컬렉션에 <{2}>은(는) {1}개가 포함되어야 하는데 실제 컬렉션에는 {3}개가 포함되어 있습니다. {0}
pl: Oczekiwana kolekcja zawiera {1} wystąpień <{2}>. Bieżąca kolekcja zawiera {3} wystąpień. {0}
pt_br: A coleção esperada contém {1} ocorrência(s) de <{2}>. A coleção real contém {3} ocorrência(s). {0}
ru: Ожидаемый набор содержит следующее число событий <{2}>: {1}. Фактический набор содержит число событий: {3}. {0}
tr: Beklenen koleksiyon {1} <{2}> örneği içerir. Gerçek koleksiyon {3} örnek içerir. {0}
zh_hans: 所需集合包含 <{2}> 的 {1} 个匹配项。实际集合包含 {3} 个匹配项。{0}
zh_hant: 預期在集合中包含 {1} 項 <{2}>，但實際的集合卻有 {3} 項。{0}

# AllItemsAreUniqueFailMsg
source: Duplicate item found:<{1}>. {0}
cs: Byla nalezena duplicitní položka:<{1}>. {0}
de: Doppeltes Element gefunden: <{1}>. {0}
es: Se encontró un elemento duplicado:<{1}>. {0}
fr: Un élément dupliqué a été trouvé : <{1}>. {0}
it: Rilevato elemento duplicato:<{1}>. {0}
ja: 重複する項目が見つかりました:<{1}>。{0}
ko: 중복된 항목이 있습니다. <{1}>. {0}
pl: Znaleziono duplikat:<{1}>. {0}
pt_br: Item duplicado encontrado:<{1}>. {0}
ru: Обнаружен совпадающий элемент: <{1}>. {0}
tr: Yinelenen öğe bulundu:<{1}>. {0}
zh_hans: 找到了重复项: <{1}>。{0}
zh_hant: 找到重複的項目: <{1}>。{0}

# AreEqualFailMsg
source: Expected:<{1}>. Actual:<{2}>. {0}
cs: Očekáváno:<{1}>. Aktuálně:<{2}>. {0}
de: Erwartet:<{1}>. Tatsächlich:<{2}>. {0}
es: Se esperaba <{1}>, pero es <{2}>. {0}
fr: Attendu : <{1}>, Réel : <{2}>. {0}
it: Previsto:<{1}>. Effettivo:<{2}>. {0}
ja: <{1}> が必要ですが、<{2}> が指定されました。{0}
ko: 예상 값: <{1}>. 실제 값: <{2}>. {0}
pl: Oczekiwana:<{1}>. Rzeczywista:<{2}>. {0}
pt_br: Esperado:<{1}>. Real:<{2}>. {0}
ru: Ожидается: <{1}>. Фактически: <{2}>. {0}
tr: Beklenen:<{1}>. Gerçek:<{2}>. {0}
zh_hans: 应为: <{1}>，实际为: <{2}>。{0}
zh_hant: 預期: <{1}>。實際: <{2}>。{0}

# AreEqualDeltaFailMsg
source: Expected a difference no greater than <{3}> between expected value <{1}> and actual value <{2}>. {0}
cs: Očekáván rozdíl, který není větší jak <{3}> mezi očekávanou hodnotou <{1}> a aktuální hodnotou <{2}>. {0}
de: Es wurde eine Differenz nicht größer als <{3}> zwischen dem erwarteten Wert <{1}> und dem tatsächlichen Wert <{2}> erwartet. {0}
es: Se esperaba una diferencia no superior a <{3}> entre el valor esperado <{1}> y el valor actual <{2}>. {0}
fr: Différence attendue non supérieure à <{3}> comprise entre la valeur attendue <{1}> et la valeur réelle <{2}>. {0}
it: Prevista una differenza non maggiore di <{3}> tra il valore previsto <{1}> e il valore effettivo <{2}>. {0}
ja: 指定する値 <{1}> と実際の値 <{2}> との間には <{3}> 以内の差が必要です。{0}
ko: 예상 값 <{1}>과(와) 실제 값 <{2}>의 차이가 <{3}>보다 크지 않아야 합니다. {0}
pl: Oczekiwano różnicy nie większej niż <{3}> pomiędzy oczekiwaną wartością <{1}> a rzeczywistą wartością <{2}>. {0}
pt_br: Esperada uma diferença não maior que <{3}> entre o valor esperado <{1}> e o valor real <{2}>. {0}
ru: Между ожидаемым значением <{1}> и фактическим значением <{2}> требуется разница не более чем <{3}>. {0}
tr: Beklenen değer <{1}> ile gerçek değer <{2}> arasında, şundan büyük olmayan fark bekleniyor: <{3}>. {0}
zh_hans: 预期值 <{1}> 和实际值 <{2}> 之间的差不应大于 <{3}>。{0}
zh_hant: 預期值 <{1}> 和實際值 <{2}> 之間的預期差異沒有大於 <{3}>。{0}

# AreEqualCaseFailMsg
source: Expected:<{1}>. Case is different for actual value:<{2}>. {0}
cs: Očekáváno:<{1}>. Případ je rozdílný pro aktuální hodnotu:<{2}>. {0}
de: Erwartet:<{1}>. Die Großschreibung des tatsächlichen Werts weicht davon ab:<{2}>. {0}
es: Se esperaba:<{1}>. La caja es diferente para el valor actual:<{2}>. {0}
fr: Attendu :<{1}>. La casse est différente pour la valeur réelle :<{2}>. {0}
it: Previsto:<{1}>. La combinazione di maiuscole e minuscole è diversa per il valore effettivo:<{2}>. {0}
ja: <{1}> が必要です。実際の値: <{2}> では大文字と小文字が異なります。{0}
ko: 예상 값: <{1}>. 대/소문자가 다른 실제 값: <{2}>. {0}
pl: Oczekiwano:<{1}>. Przypadek różni się od rzeczywistej wartości:<{2}>. {0}
pt_br: Esperado:<{1}>. Capitalização é diferente para o valor real:<{2}>. {0}
ru: Ожидается: <{1}>. Отличается на фактическое значение: <{2}>. {0}
tr: Beklenen:<{1}>. Durum, gerçek değer için farklı:<{2}>. {0}
zh_hans: 应为: <{1}>。实际值的大小写有所不同: <{2}>。{0}
zh_hant: 預期: <{1}>。大小寫與下列實際值不同: <{2}>。{0}

# AreEqualDifferentTypesFailMsg
source: Expected:<{1} ({2})>. Actual:<{3} ({4})>. {0}
cs: Očekáváno:<{1} ({2})>. Aktuálně:<{3} ({4})>. {0}
de: Erwartet:<{1} ({2})>. Tatsächlich:<{3} ({4})>. {0}
es: Se esperaba:<{1} ({2})>, pero es:<{3} ({4})>. {0}
fr: Attendu : <{1} ({2})>, Réel : <{3} ({4})>. {0}
it: Previsto:<{1} ({2})>. Effettivo:<{3} ({4})>. {0}
ja: <{1} ({2})> が必要ですが、<{3} ({4})> が指定されました。{0}
ko: 예상 값: <{1} ({2})>. 실제 값: <{3} ({4})>. {0}
pl: Oczekiwana:<{1} ({2})>. Rzeczywista:<{3} ({4})>. {0}
pt_br: Esperado:<{1} ({2})>. Real:<{3} ({4})>. {0}
ru: Ожидается: <{1} ({2})>. Фактически: <{3} ({4})>. {0}
tr: Beklenen:<{1} ({2})>. Gerçek:<{3} ({4})>. {0}
zh_hans: 应为: <{1} ({2})>，实际为: <{3} ({4})>。{0}
zh_hant: 預期: <{1} ({2})>。實際: <{3} ({4})>。{0}

# AreEqualStringDiffExpectedPrefix
source: Expected:
pt_br: Esperado:

# AreEqualStringDiffActualPrefix
source: But was:
pt_br: Mas foi:

# AreEqualStringDiffLengthBothMsg
source: String lengths are both {0} but differ at index {1}.
pt_br: Os comprimentos de cadeia de caracteres são ambos {0}, mas diferem no índice {1}.

# AreEqualStringDiffLengthDifferentMsg
source: Expected string length {0} but was {1}.
pt_br: Comprimento esperado da cadeia de caracteres {0}, mas foi {1}.

# AreNotEqualFailMsg
source: Expected any value except:<{1}>. Actual:<{2}>. {0}
cs: Nebyla očekávána žádná hodnota kromě:<{1}>. Aktuálně:<{2}>. {0}
de: Es wurde ein beliebiger Wert erwartet außer:<{1}>. Tatsächlich:<{2}>. {0}
es: Se esperaba cualquier valor excepto <{1}>, pero es <{2}>. {0}
fr: Toute valeur attendue sauf :<{1}>. Réel :<{2}>. {0}
it: Previsto qualsiasi valore tranne:<{1}>. Effettivo:<{2}>. {0}
ja: <{1}> 以外の任意の値が必要ですが、<{2}> が指定されています。{0}
ko: 예상 값: <{1}>을(를) 제외한 모든 값. 실제 값: <{2}>. {0}
pl: Oczekiwano dowolnej wartości za wyjątkiem:<{1}>. Rzeczywista:<{2}>. {0}
pt_br: Esperado qualquer valor exceto:<{1}>. Real:<{2}>. {0}
ru: Ожидается любое значение, кроме: <{1}>. Фактически: <{2}>. {0}
tr: Şunun dışında bir değer bekleniyor:<{1}>. Gerçek:<{2}>. {0}
zh_hans: 应为: <{1}> 以外的任意值，实际为: <{2}>。{0}
zh_hant: 預期任何值 (<{1}> 除外)。實際: <{2}>。{0}

# AreNotEqualDeltaFailMsg
source: Expected a difference greater than <{3}> between expected value <{1}> and actual value <{2}>. {0}
cs: Očekáván rozdíl, který je větší jak <{3}> mezi očekávanou hodnotou <{1}> a aktuální hodnotou <{2}>. {0}
de: Es wurde eine Differenz größer als <{3}> zwischen dem erwarteten Wert <{1}> und dem tatsächlichen Wert <{2}> erwartet. {0}
es: Se esperaba una diferencia mayor que <{3}> entre el valor esperado <{1}> y el valor actual <{2}>. {0}
fr: Différence attendue supérieure à <{3}> comprise entre la valeur attendue <{1}> et la valeur réelle <{2}>. {0}
it: Prevista una differenza maggiore di <{3}> tra il valore previsto <{1}> e il valore effettivo <{2}>. {0}
ja: 指定する値 <{1}> と実際の値 <{2}> との間には、<{3}> を超える差が必要です。{0}
ko: 예상 값 <{1}>과(와) 실제 값 <{2}>의 차이가 <{3}>보다 커야 합니다. {0}
pl: Oczekiwano różnicy większej niż <{3}> pomiędzy oczekiwaną wartością <{1}> a rzeczywistą wartością <{2}>. {0}
pt_br: Esperada uma diferença maior que <{3}> entre o valor esperado <{1}> e o valor real <{2}>. {0}
ru: Между ожидаемым значением <{1}> и фактическим значением <{2}> требуется разница более чем <{3}>. {0}
tr: Beklenen değer <{1}> ile gerçek değer <{2}> arasında, şundan büyük olan fark bekleniyor: <{3}>. {0}
zh_hans: 预期值 <{1}> 和实际值 <{2}> 之间的差应大于 <{3}>。{0}
zh_hant: 預期值 <{1}> 和實際值 <{2}> 之間的預期差異大於 <{3}>。{0}

# AreSameGivenValues
source: Do not pass value types to AreSame(). Values converted to Object will never be the same. Consider using AreEqual(). {0}
cs: Nevkládejte hodnotu typů do AreSame(). Hodnoty převedené do typu Object už nebudou nikdy stejné. Zvažte použití AreEqual(). {0}
de: Übergeben Sie keine Werttypen an AreSame(). In ein Objekt konvertierte Werte sind niemals identisch. Verwenden Sie stattdessen AreEqual(). {0}
es: No pase tipos de valor a AreSame(). Los valores convertidos a Object no serán nunca iguales. Considere el uso de AreEqual(). {0}
fr: Ne passez pas de types valeur à AreSame(). Les valeurs converties en Object ne seront plus jamais les mêmes. Si possible, utilisez AreEqual(). {0}
it: Non passare tipi valore a AreSame(). I valori convertiti in Object non saranno mai uguali. Usare AreEqual(). {0}
ja: AreSame() には値型を渡すことはできません。オブジェクトに変換された値が同じにはなりません。AreEqual() を使用することを検討してください。{0}
ko: AreSame()에 값 형식을 전달하면 안 됩니다. Object로 변환된 값은 동일한 값으로 간주되지 않습니다. AreEqual()을 사용해 보세요. {0}
pl: Nie przekazuj typów wartości do metody AreSame(). Wartości przekonwertowane na typ Object nigdy nie będą takie same. Rozważ użycie metody AreEqual(). {0}
pt_br: Não passe tipos de valores para AreSame(). Os valores convertidos para Object nunca serão os mesmos. Considere usar AreEqual(). {0}
ru: Не передавайте типы значений в функцию AreSame(). Значения, преобразованные в Object, никогда не будут одинаковыми. Попробуйте использовать AreEqual(). {0}
tr: AreSame()'e değer türleri geçirmeyin. Object olarak dönüştürülen değerler asla aynı olamayacak. AreEqual() kullanmayı düşün. {0}
zh_hans: 不要向 AreSame() 传递值类型。转换为 Object 的值将永远不会相等。请考虑使用 AreEqual()。{0}
zh_hant: 不要將實值型別傳遞給 AreSame()。轉換成 Object 的值從此不再一樣。請考慮使用 AreEqual()。{0}

# AssertThatDetailsPrefix
source: Details:
pt_br: Detalhes:

# AssertThatFailedFormat
source: Assert.That({0}) failed.
pt_br: Assert.That({0}) falhou.

# AssertThatMessageFormat
source: Message: {0}
pt_br: Mensagem: {0}

# BothCollectionsEmpty
source: Both collections are empty. {0}
cs: Obě kolekce jsou prázdné. {0}
de: Beide Sammlungen sind leer. {0}
es: Ambas colecciones están vacías. {0}
fr: Les deux collections sont vides. {0}
it: Le raccolte sono entrambe vuote. {0}
ja: 両方のコレクションが空です。{0}
ko: 두 컬렉션이 모두 비어 있습니다. {0}
pl: Obie kolekcje są puste. {0}
pt_br: Ambas as coleções estão vazias. {0}
ru: Обе коллекции пусты. {0}
tr: Koleksiyonların her ikisi de boş. {0}
zh_hans: 这两个集合都为空。{0}
zh_hant: 兩個集合皆空白。{0}

# BothCollectionsSameElements
source: Both collection contain same elements.
cs: Obě kolekce obsahují stejné elementy.
de: Beide Sammlungen enthalten dieselben Elemente.
es: Ambas colecciones tienen los mismos elementos.
fr: Les deux collections contiennent des éléments identiques.
it: Le raccolte contengono entrambe gli stessi elementi.
ja: 両方のコレクションが同じ要素を含んでいます。
ko: 두 컬렉션에 같은 요소가 포함되어 있습니다.
pl: Obie kolekcje zawierają te same elementy.
pt_br: Ambas as coleções contêm os mesmos elementos.
ru: Обе коллекции содержат одинаковые элементы.
tr: Her iki koleksiyon da aynı öğeleri içeriyor.
zh_hans: 这两个集合包含相同的元素。
zh_hant: 兩個集合含有相同的項目。

# BothCollectionsSameReference
source: Both collection references point to the same collection object. {0}
cs: Obě reference na kolekci odkazují na stejný objekt kolekce. {0}
de: Beide Sammlungsverweise zeigen auf dasselbe Sammlungsobjekt. {0}
es: Las referencias de ambas colecciones apuntan al mismo objeto de colección. {0}
fr: Les deux collections Reference pointent vers le même objet Collection. {0}
it: I riferimenti a raccolte puntano entrambi allo stesso oggetto Collection. {0}
ja: 両方のコレクションの参照が、同じコレクション オブジェクトにポイントしています。{0}
ko: 두 컬렉션 참조가 동일한 컬렉션 개체를 가리킵니다. {0}
pl: Odwołania do obu kolekcji wskazują ten sam obiekt kolekcji. {0}
pt_br: Ambas as referências de coleção apontam para o mesmo objeto de coleção. {0}
ru: Ссылки в обоих коллекциях указывают на один и тот же объект коллекции. {0}
tr: Her iki koleksiyon başvurusu da aynı koleksiyon nesnesine işaret ediyor. {0}
zh_hans: 这两个集合引用指向同一个集合对象。{0}
zh_hant: 兩個集合參考都指向同一個集合物件。{0}

# BothSameElements
source: Both collections contain the same elements. {0}
cs: Obě kolekce obsahují stejné elementy. {0}
de: Beide Sammlungen enthalten dieselben Elemente. {0}
es: Ambas colecciones tienen los mismos elementos. {0}
fr: Les deux collections contiennent les mêmes éléments. {0}
it: Le raccolte contengono entrambe gli stessi elementi. {0}
ja: 両方のコレクションが同じ要素を含んでいます。{0}
ko: 두 컬렉션에 같은 요소가 포함되어 있습니다. {0}
pl: Obie kolekcje zawierają te same elementy. {0}
pt_br: Ambas as coleções contêm os mesmos elementos. {0}
ru: Обе коллекции содержат одинаковые элементы. {0}
tr: Her iki koleksiyon da aynı öğeleri içeriyor. {0}
zh_hans: 这两个集合包含相同的元素。{0}
zh_hant: 兩個集合含有相同的項目。{0}

# CallerArgumentExpressionSingleParameterMessage
source: '{0}' expression: '{1}'.
pt_br: Expressão "{0}": "{1}".

# CallerArgumentExpressionThreeParametersMessage
source: '{0}' expression: '{1}', '{2}' expression: '{3}', '{4}' expression: '{5}'.
pt_br: Expressão "{0}": "{1}", "{2}" expressão: "{3}", "{4}" expressão: "{5}".

# CallerArgumentExpressionTwoParametersMessage
source: '{0}' expression: '{1}', '{2}' expression: '{3}'.
pt_br: Expressão "{0}": "{1}", "{2}" expressão: "{3}".

# ContainsFail
source: String '{0}' does not contain string '{1}'. {2}.
cs: Řetězec '{0}' neobsahuje řetězec '{1}'. {2}.
de: Die Zeichenfolge "{0}" enthält nicht die Zeichenfolge "{1}". {2}.
es: La cadena '{0}' no contiene la cadena '{1}'. {2}.
fr: La chaîne '{0}' ne contient pas la chaîne '{1}'. {2}.
it: La stringa '{0}' non contiene la stringa '{1}'. {2}.
ja: 文字列 '{0}' は文字列 '{1}' を含んでいません。{2}。
ko: '{0}' 문자열이 '{1}' 문자열을 포함하지 않습니다. {2}
pl: Ciąg „{0}” nie zawiera ciągu „{1}”. {2}.
pt_br: A cadeia de caracteres '{0}' não contém a cadeia de caracteres '{1}'. {2}.
ru: Строка "{0}" не содержит строку "{1}". {2}.
tr: '{0}' dizesi, '{1}' dizesini içermiyor. {2}.
zh_hans: 字符串“{0}”不包含字符串“{1}”。{2}。
zh_hant: 字串 '{0}' 未包含字串 '{1}'。{2}。

# ContainsItemFailMsg
source: Expected collection to contain the specified item. {0}
cs: Očekávala se kolekce, která bude obsahovat zadanou položku. {0}
de: Es wurde erwartet, dass die Sammlung das angegebene Element enthält. {0}
es: Se esperaba que la colección contuviera el elemento especificado. {0}
fr: Collection attendue pour contenir l’élément spécifié. {0}
it: La raccolta dovrebbe contenere l'elemento specificato. {0}
ja: 指定された項目を含むコレクションが必要です。{0}
ko: 지정한 항목을 포함할 컬렉션이 필요합니다. {0}
pl: Oczekiwano, że kolekcja będzie zawierać określony element. {0}
pt_br: A coleção esperada contém o item especificado. {0}
ru: Ожидалось, что коллекция будет содержать указанный элемент. {0}
tr: Koleksiyonun belirtilen öğeyi içermesi bekleniyordu. {0}

# ContainsPredicateFailMsg
source: Expected at least one item to match the predicate. {0}
cs: Očekávala se alespoň jedna položka odpovídající predikátu. {0}
de: Es wurde erwartet, dass mindestens ein Element mit dem Prädikat übereinstimmt. {0}
es: Se esperaba al menos un elemento para que coincida con el predicado. {0}
fr: Au moins un élément doit correspondre au prédicat. {0}
it: Almeno un elemento dovrebbe corrispondere al predicato. {0}
ja: 述語と一致する項目が少なくとも 1 つ必要です。{0}
ko: 조건자와 일치하는 항목이 하나 이상 필요합니다. {0}
pl: Oczekiwano co najmniej jednego elementu zgodnego z predykatem. {0}
pt_br: Esperava-se que pelo menos um item correspondesse ao predicado. {0}
ru: Ожидался по крайней мере один элемент, соответствующий предикату. {0}
tr: En az bir öğenin koşulla eşleşmesi bekleniyordu. {0}

# ContainsSingleFailMsg
source: Expected collection to contain exactly one element but found {1} element(s). {0}
cs: Očekávalo se, že kolekce bude obsahovat přesně jeden prvek, ale našlo se tolik elementů: {1}. {0}
de: Es wurde erwartet, dass die Sammlung genau ein Element enthält, es wurden jedoch {1} gefunden. {0}
es: Se esperaba que la colección contuviera exactamente un elemento, pero se encontraron {1} elementos. {0}
fr: Collection attendue pour contenir exactement un élément mais {1} élément(s) trouvé(s). {0}
it: La raccolta dovrebbe contenere un unico elemento, ma ne sono stati trovati {1}. {0}
ja: コレクションには 1 つの要素だけを含める必要がありますが、{1} 要素が見つかりました。{0}
ko: 정확히 하나의 요소를 포함할 컬렉션이 필요하지만 {1}개 요소가 발견되었습니다. {0}
pl: Oczekiwano, że kolekcja będzie zawierać dokładnie jeden element, ale znaleziono {1} elementów. {0}
pt_br: A coleção esperada contém exatamente um elemento, mas encontrou {1} elementos. {0}
ru: Ожидалось, что коллекция будет содержать ровно один элемент, но найдено элементов: {1}. {0}
tr: Beklenen koleksiyonun tam olarak bir öğe içermesi beklenirken, {1} öğe bulundu. {0}

# ContainsSingleMatchFailMsg
source: Expected exactly one item to match the predicate but found {1} item(s). {0}
cs: Očekávala se přesně jedna položka odpovídající predikátu, ale našlo se tolik položek: {1}. {0}
de: Es wurde erwartet, dass genau ein Element mit dem Prädikat übereinstimmt, es wurden jedoch {1} Element(e) gefunden. {0}
es: Se esperaba exactamente un elemento para que coincida con el predicado, pero se encontraron {1} elementos. {0}
fr: Un seul élément était attendu pour correspondre au prédicat, mais {1} élément(s) trouvé(s). {0}
it: Un unico elemento dovrebbe corrispondere al predicato, ma ne sono stati trovati {1}. {0}
ja: 述語と一致する項目が 1 つだけ必要ですが、{1} 項目が見つかりました。{0}
ko: 조건자에 일치하는 항목이 하나만 필요하지만 {1}개 항목이 발견되었습니다. {0}
pl: Oczekiwano dokładnie jednego elementu zgodnego z predykatem, ale znaleziono {1} elementów. {0}
pt_br: Esperava-se exatamente um item para corresponder ao predicado, mas encontrou {1} itens. {0}
ru: Ожидался ровно один элемент, соответствующий предикату, но найдено элементов: {1}. {0}
tr: Özellikle bir öğenin koşulla eşleşmesi beklenirken {1} öğe bulundu. {0}

# DoesNotContainFail
source: String '{0}' does contain string '{1}'. {2}.
cs: Řetězec {0} obsahuje řetězec {1}. {2}.
de: Die Zeichenfolge „{0}“ enthält die Zeichenfolge „{1}“. {2}.
es: La cadena '{0}' contiene la cadena '{1}'. {2}.
fr: La chaîne « {0} » contient la chaîne « {1} ». {2}.
it: La stringa '{0}' contiene la stringa '{1}'. {2}.
ja: 文字列 '{0}' は文字列 '{1}' を含んでいます。{2}。
ko: '{0}' 문자열에 '{1}' 문자열이 포함되어 있습니다. {2}.
pl: Ciąg „{0}” zawiera ciąg „{1}”. {2}.
pt_br: A cadeia de caracteres "{0}" contém a cadeia de caracteres "{1}". {2}.
ru: Строка "{0}" не содержит строку "{1}". {2}.
tr: '{0}' dizesi, '{1}' dizesini içermiyor. {2}.
zh_hans: 字符串“{0}”确实包含字符串“{1}”。{2}
zh_hant: 字串 '{0}' 有包含字串 '{1}'。{2}。

# DoesNotContainItemFailMsg
source: Expected collection to not contain the specified item. {0}
cs: Očekávalo se, že kolekce nebude obsahovat zadanou položku. {0}
de: Es wurde erwartet, dass die Sammlung das angegebene Element nicht enthält. {0}
es: Se esperaba que la colección no contenga el elemento especificado. {0}
fr: Collection attendue pour ne pas contenir l’élément spécifié. {0}
it: La raccolta non dovrebbe contenere l'elemento specificato. {0}
ja: 指定された項目を含まないコレクションが必要です。{0}
ko: 지정한 항목을 포함하지 않을 컬렉션이 필요합니다. {0}
pl: Oczekiwano, że kolekcja nie będzie zawierać określonego elementu. {0}
pt_br: A coleção esperada não contém o item especificado. {0}
ru: Ожидалось, что коллекция не будет содержать указанный элемент. {0}
tr: Koleksiyonun belirtilen öğeyi içermemesi bekleniyordu. {0}

# DoesNotContainPredicateFailMsg
source: Expected no items to match the predicate. {0}
cs: Očekávaly se žádné položky, které by odpovídaly predikátu. {0}
de: Es wurden erwartet, dass keine Elemente mit dem Prädikat übereinstimmen. {0}
es: No se esperaba que ningún elemento coincidía con el predicado. {0}
fr: Aucun élément ne doit correspondre au prédicat. {0}
it: Nessun elemento dovrebbe corrispondere al predicato. {0}
ja: 述語に一致する項目が必要ありません。{0}
ko: 조건자와 일치하는 항목이 필요하지 않습니다. {0}
pl: Nie oczekiwano elementów zgodnych z predykatem. {0}
pt_br: Não era esperado nenhum item que corresponda ao predicado. {0}
ru: Ожидалось, что ни один элемент не будет соответствовать предикату. {0}
tr: Hiçbir öğenin koşulla eşleşmesi beklenmiyordu. {0}

# DoesNotEndWithFail
source: String '{0}' ends with string '{1}'. {2}
cs: Řetězec „{0}“ končí řetězcem „{1}“. {2}
de: Die Zeichenfolge „{0}“ endet mit der Zeichenfolge „{1}“. {2}
es: La cadena "{0}" termina con la cadena "{1}". {2}
fr: La chaîne '{0}' se termine par la chaîne '{1}'. {2}
it: La stringa '{0}' termina con la stringa '{1}'. {2}
ja: 文字列 '{0}' の末尾は文字列 '{1}' です。{2}
ko: 문자열 '{0}'은 문자열 '{1}'(으)로 끝납니다. {2}
pl: Ciąg „{0}” kończy się ciągiem „{1}”. {2}
pt_br: A cadeia de caracteres “{0}” termina com cadeia de caracteres “{1}”. {2}
ru: Строка "{0}" заканчивается строкой "{1}". {2}
tr: '{0}' dizesi '{1}' dizesi ile bitiyor. {2}

# DoesNotStartWithFail
source: String '{0}' starts with string '{1}'. {2}
cs: Řetězec „{0}“ začíná řetězcem „{1}“. {2}
de: Die Zeichenfolge „{0}“ beginnt mit der Zeichenfolge „{1}“. {2}
es: La cadena "{0}" comienza con la cadena "{1}". {2}
fr: La chaîne '{0}' commence par la chaîne '{1}'. {2}
it: La stringa '{0}' inizia con la stringa '{1}'. {2}
ja: 文字列 '{0}' は文字列 '{1}' で始まります。 {2}
ko: 문자열 '{0}'은 문자열 '{1}'(으)로 시작합니다. {2}
pl: Ciąg „{0}” rozpoczyna się od ciągu „{1}”. {2}
pt_br: A cadeia de caracteres “{0}” começa com a cadeia de caracteres “{1}”. {2}
ru: Строка "{0}" начинается со строки "{1}". {2}
tr: '{0}' dizesi '{1}' dizesi ile başlıyor. {2}

# DynamicDataInvalidFieldLayout
source: Dynamic data field '{0}' should be static.
pt_br: O campo de dados dinâmicos '{0}' deve ser estático.

# DynamicDataInvalidMethodLayout
source: Dynamic data method '{0}' should be static, non-generic, and cannot have 'params' parameter.
cs: Dynamická datová metoda {0} by měla být statická a neobecná a nemůže mít parametr params.
de: Die dynamische Datenmethode „{0}“ muss statisch, nicht generisch sein und darf keinen Parameter „params“ enthalten.
es: El método de datos dinámicos '{0}' debe ser estático, no genérico y no puede tener un parámetro 'params'.
fr: La méthode de données dynamiques « {0} » doit être statique, non générique et ne peut pas avoir le paramètre « params ».
it: Il metodo dei dati dinamici '{0}' deve essere statico, non generico e non può includere un parametro 'params'.
ja: 動的データ メソッド '{0}' は、静的で、非ジェネリックである必要があり、'params' パラメーターを持つことはできません。
ko: 동적 데이터 메서드 '{0}'은(는) 정적이고 제네릭이 아니어야 하며 'params' 매개 변수를 사용할 수 없습니다.
pl: Metoda danych dynamicznych „{0}” powinna być statyczna, niestandardowa i nie może mieć parametru „params”.
pt_br: O método de dados dinâmicos '{0}' deve ser estático, não genérico e não pode ter um parâmetro 'params'.
ru: Метод динамических данных "{0}" должен быть статическим, неуниверсальным и не может иметь содержать параметр params.
tr: Dinamik veri yöntemi ‘{0}’ statik, genel olmayan ve ‘params’ parametresine sahip olamaz.
