Repository: microsoft/testfx
Catalog: src/TestFramework/TestFramework/Resources/xlf/FrameworkMessages.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DynamicDataInvalidPropertyLayout
source: Dynamic data property '{0}' should be static and have a getter.
cs: Vlastnost dynamických dat {0} by měla být statická a měla by mít metodu getter.
de: Die dynamische Dateneigenschaft "{0}" muss statisch sein und über einen Getter verfügen.
es: La propiedad de datos dinámicos '{0}' debe ser estática y tener un captador.
fr: La propriété de données dynamiques « {0} » doit être statique et avoir un getter.
it: La proprietà '{0}' di Dynamic Data deve essere statica e avere un getter.
ja: 動的データ プロパティ '{0}' は静的であり、ゲッターを持つ必要があります。
ko: 동적 데이터 속성 '{0}'은(는) 정적이고 getter가 있어야 합니다.
pl: Właściwość danych dynamicznych „{0}” powinna być statyczna i mieć metodę pobierającą.
pt_br: A propriedade de dados dinâmicos "{0}" deve ser estática e ter um getter.
ru: Свойство динамических данных "{0}" должно быть статическим и иметь метод получения.
tr: '{0}' dinamik veri özelliği statik olmalı ve bir alıcı içermelidir.
zh_hans: 动态数据属性“{0}”应为静态且具有 getter。
zh_hant: 動態資料屬性 '{0}' 應為靜態且具有 getter。

# DynamicDataSourceShouldExistAndBeValid
source: The dynamic data source '{0}' in type '{1}' should exist and be a property, a method, or a field.
cs: Dynamický zdroj dat '{0}' v typu '{1}' by měl existovat a být vlastností nebo metodou.
de: Die dynamische Datenquelle '{0}' im Typ '{1}' muss vorhanden sein und eine Eigenschaft oder Methode sein.
es: El origen de datos dinámico '{0}' en el tipo '{1}' debe existir y ser una propiedad o un método.
fr: La source de données dynamique '{0}' dans le type '{1}' doit exister et être une propriété ou une méthode.
it: L'origine dati dinamica '{0}' nel tipo '{1}' deve esistere ed essere una proprietà o un metodo.
ja: 型 '{1}' の動的データ ソース '{0}' は、プロパティまたはメソッドである必要があります。
ko: '{1}' 형식의 동적 데이터 원본 '{0}' 존재하며 속성 또는 메서드여야 합니다.
pl: Dynamiczne źródło danych '{0}' w typie '{1}' powinno istnieć i być właściwością lub metodą.
pt_br: A fonte de dados dinâmica '{0}' do tipo '{1}' deve existir e ser uma propriedade, um método ou um campo.
ru: Динамический источник '{0}' в типе '{1}' должен существовать и быть свойством или методом.
tr: Dinamik veri kaynağı '{0}' türdeki '{1}' bir özellik veya yöntem olmalıdır.

# ElementNumbersDontMatch
source: The number of elements in the collections do not match. Expected:<{1}>. Actual:<{2}>.{0}
cs: Počet elementů v kolekcích nesouhlasí. Očekáváno:<{1}>. Aktuálně:<{2}>.{0}
de: Die Anzahl der Elemente in den Sammlungen stimmt nicht überein. Erwartet: <{1}>. Tatsächlich: <{2}>.{0}
es: El número de elementos de las colecciones no coincide. Se esperaba:<{1}>, pero es:<{2}>.{0}
fr: Le nombre d'éléments dans les collections ne correspond pas. Attendu : <{1}>, Réel : <{2}>.{0}
it: Il numero di elementi nelle raccolte non corrisponde. Previsto:<{1}>. Effettivo:<{2}>.{0}
ja: コレクション内の要素数が一致しません。<{1}> が必要ですが <{2}> が指定されています。{0}
ko: 컬렉션의 요소 수가 일치하지 않습니다. 예상 값: <{1}>. 실제 값: <{2}>.{0}
pl: Nie zgadza się liczba elementów w kolekcji. Oczekiwana:<{1}>. Rzeczywista:<{2}>.{0}
pt_br: O número de elementos nas coleções não coincidem. Esperado:<{1}>. Real:<{2}>.{0}
ru: Число элементов в наборе не соответствует ожидаемому. Ожидается: <{1}>. Фактически: <{2}>.{0}
tr: Koleksiyonlar içindeki öğe sayıları eşleşmiyor. Beklenen:<{1}>. Gerçek:<{2}>.{0}
zh_hans: 集合中元素的数量不匹配。应为: <{1}>，实际为: <{2}>。{0}
zh_hant: 集合中的項目數目不符。預期: <{1}>。實際: <{2}>。{0}

# ElementsAtIndexDontMatch
source: Element at index {0} do not match. Expected: {1} Actual: {2}
cs: Element v indexu {0} nesouhlasí. Očekáváno: {1} Skutečnost: {2}
de: Das Element bei Index {0} stimmt nicht überein. Erwartet: {1} Tatsächlich: {2}
es: El elemento del índice {0} no coincide. Esperado: {1} Real: {2}
fr: L’élément au {0} d’index ne correspond pas. Attendu : {1} Réel : {2}
it: L'elemento nell'indice {0} non corrisponde. Previsto: {1} Effettivo: {2}
ja: インデックス {0} の要素が一致しません。 予想: {1} 実際: {2}
ko: 인덱스 {0}에 있는 요소가 일치하지 않습니다. 예상: {1} 실제: {2}
pl: Element w indeksie {0} nie jest zgodny. Oczekiwano: {1} Rzeczywiste: {2}
pt_br: O elemento no índice {0} não corresponde. Esperado: {1} Real: {2}
ru: Элемент по индексу {0} не совпадает. Ожидается: {1} Фактическое значение: {2}
tr: {0} dizinindeki öğe eşleşmiyor. Beklenen: {1} Gerçekte olan: {2}
zh_hans: 索引 {0} 处的元素不匹配。 预计值: {1} 实际值: {2}
zh_hant: 位於索引 {0} 的項目不符。 預期為: {1} 實際為: {2}

# ElementTypesAtIndexDontMatch
source: Element at index {1} is not of expected type. Expected type:<{2}>. Actual type:<{3}>.{0}
cs: Element na indexu {1} není očekávaného typu. Očekávaný typ:<{2}>. Aktuální typ:<{3}>.{0}
de: Das Element bei Index "{1}" weist nicht den erwarteten Typ auf. Erwarteter Typ:<{2}>. Tatsächlicher Typ:<{3}>.{0}
es: El elemento del índice {1} no es del tipo esperado. Tipo esperado:<{2}>, pero es el tipo:<{3}>.{0}
fr: L'élément à l'index {1} n'est pas du type attendu. Type attendu : <{2}>, Type réel : <{3}>.{0}
it: L'elemento nell'indice {1} non è del tipo previsto. Tipo previsto:<{2}>. Tipo effettivo:<{3}>.{0}
ja: インデックス {1} の要素は、必要な型ではありません。<{2}> が必要ですが、<{3}> が指定されています。{0}
ko: 인덱스 {1}에 있는 요소가 필요한 형식이 아닙니다. 필요한 형식: <{2}>, 실제 형식: <{3}>.{0}
pl: Element o indeksie {1} jest innego typu niż oczekiwano. Oczekiwany typ:<{2}>. Rzeczywisty typ:<{3}>.{0}
pt_br: Elemento de índice {1} não é de tipo esperado. Tipo esperado:<{2}>. Tipo real:<{3}>.{0}
ru: Тип элемента по индексу {1} не соответствует ожидаемому. Ожидаемый тип: <{2}>. Фактический тип: <{3}>.{0}
tr: {1} dizinindeki öğe, beklenen türde değil. Beklenen tür:<{2}>. Gerçek tür:<{3}>.{0}
zh_hans: 索引 {1} 处的元素不是所需类型。所需类型为: <{2}>，实际类型为: <{3}>。{0}
zh_hant: 位於索引 {1} 的項目不是預期的類型。預期的類型: <{2}>。實際的類型: <{3}>。{0}

# EndsWithFail
source: String '{0}' does not end with string '{1}'. {2}
cs: Řetězec „{0}“ nekončí řetězcem „{1}“. {2}
de: Die Zeichenfolge „{0}“ endet nicht auf die Zeichenfolge „{1}“. {2}
es: La cadena "{0}" no termina con la cadena "{1}". {2}
fr: La chaîne '{0}' ne se termine pas par la chaîne '{1}'. {2}
it: La stringa '{0}' non termina con la stringa '{1}'. {2}
ja: 文字列 '{0}' は文字列 '{1}' で終わりません。{2}
ko: '{0}' 문자열이 '{1}' 문자열로 끝나지 않습니다. {2}
pl: Ciąg „{0}” nie kończy się ciągiem „{1}”. {2}
pt_br: A cadeia de caracteres “{0}” não termina com a cadeia de caracteres “{1}”. {2}
ru: Строка "{0}" не заканчивается строкой "{1}". {2}
tr: '{0}' dizesi, '{1}' dizesi ile sonlanmıyor. {2}

# AssertionFailed
source: {0} failed. {1}
cs: {0} selhalo. {1}
de: Fehler bei "{0}". {1}
es: Error de {0}. {1}
fr: Échec de {0}. {1}
it: {0} non riuscita. {1}
ja: {0} に失敗しました。{1}
ko: {0}이(가) 실패했습니다. {1}
pl: {0} — niepowodzenie. {1}
pt_br: {0} falhou. {1}
ru: Сбой {0}. {1}
tr: {0} başarısız. {1}
zh_hans: {0} 失败。{1}
zh_hant: {0} 失敗。 {1}

# HasCountFailMsg
source: Expected collection of size {1}. Actual: {2}. {0}
cs: Očekávala se kolekce {1} velikosti. Skutečnost: {2} {0}
de: Es wurde eine Sammlung mit einer Größe {1} erwartet. Tatsächlich: {2}. {0}
es: Se esperaba una colección de tamaño {1}. Real: {2}. {0}
fr: Collection de tailles attendue {1}. Réel : {2}. {0}
it: Prevista raccolta di dimensioni {1}. Effettivo: {2}. {0}
ja: サイズ {1} のコレクションが必要です。実際: {2}。{0}
ko: {1} 크기 컬렉션이 필요합니다. 실제: {2}. {0}
pl: Oczekiwano kolekcji rozmiaru {1}. Wartość rzeczywista: {2}. {0}
pt_br: Coleção esperada de tamanho {1}. Real: {2}. {0}
ru: Ожидается коллекция размеров {1}. Фактически: {2}. {0}
tr: Beklenen boyut {1}. Gerçek: {2}. {0}
zh_hans: 大小 {1} 的预期集合。实际： {2}。{0}
zh_hant: 預期的大小集合 {1}。實際： {2}。{0}

# InvalidAccessToTestContextProperty
source: The property 'TestContext.{0}' is related to current test is not available during assembly or class fixtures.
pt_br: A propriedade "TestContext.{0}" está relacionada ao teste atual não está disponível durante os acessórios de assembly ou classe.

# InvalidGitHubUrl
source: Invalid GitHub ticket URL
cs: Neplatná adresa URL lístku GitHubu
de: Ungültige GitHub-Ticket-URL.
es: Dirección URL de vale de GitHub no válida
fr: URL de ticket GitHub non valide
it: L'URL del ticket GitHub non è valido
ja: GitHub チケット URL が無効です
ko: 잘못된 GitHub 티켓 URL
pl: Nieprawidłowy adres URL biletu usługi GitHub
pt_br: URL de tíquete do GitHub inválida
ru: Недопустимый URL-адрес билета GitHub
tr: Geçersiz GitHub anahtar URL'si
zh_hans: GitHub 票证 URL 无效
zh_hant: 無效的 GitHub 票證 URL

# IsInRangeFail
source: Value '{0}' is not within the expected range [{1}..{2}]. {3}
pt_br: O valor '{0}' não está dentro do intervalo esperado [{1}.. {2}]. {3}

# IsInRangeMaxValueMustBeGreaterThanMinValue
source: The maximum value must be greater than the minimum value.
pt_br: O valor máximo deve ser maior que o valor mínimo.

# IsInstanceOfFailMsg
source: {0} Expected type:<{1}>. Actual type:<{2}>.
cs: {0} Očekávaný typ:<{1}>. Aktuální typ:<{2}>.
de: {0}Erwarteter Typ:<{1}>. Tatsächlicher Typ:<{2}>.
es: {0} Tipo esperado:<{1}>. Tipo real:<{2}>.
fr: {0}Type attendu :<{1}>. Type réel :<{2}>.
it: {0} Tipo previsto:<{1}>. Tipo effettivo:<{2}>.
ja: {0} には型 <{1}> が必要ですが、型 <{2}> が指定されました。
ko: {0} 예상 형식: <{1}>, 실제 형식: <{2}>.
pl: {0} Oczekiwany typ:<{1}>. Rzeczywisty typ:<{2}>.
pt_br: {0} Tipo esperado:<{1}>. Tipo real:<{2}>.
ru: {0}Ожидается тип: <{1}>. Фактический тип: <{2}>.
tr: {0} Beklenen tür:<{1}>. Gerçek tür:<{2}>.
zh_hans: {0} 类型应为: <{1}>。类型实为: <{2}>。
zh_hant: {0} 預期的類型: <{1}>，實際的類型: <{2}>。

# IsMatchFail
source: String '{0}' does not match pattern '{1}'. {2}
cs: Řetězec „{0}“ neodpovídá vzoru „{1}“. {2}
de: Die Zeichenfolge „{0}“ stimmt nicht mit dem Muster „{1}“ überein. {2}
es: La cadena "{0}" no coincide con el patrón "{1}". {2}
fr: La chaîne '{0}' ne correspond pas au modèle '{1}'. {2}
it: La stringa '{0}' non corrisponde al criterio '{1}'. {2}
ja: 文字列 '{0}' はパターン '{1}' と一致しません。{2}
ko: '{0}' 문자열이 '{1}' 패턴과 일치하지 않습니다. {2}
pl: Ciąg „{0}” nie jest zgodny ze wzorcem „{1}”. {2}
pt_br: A cadeia de caracteres “{0}” não corresponde ao padrão “{1}”. {2}
ru: Строка "{0}" не соответствует шаблону "{1}". {2}
tr: '{0}' dizesi, '{1}' deseni ile eşleşmiyor. {2}

# IsNotEmptyFailMsg
source: Expected collection to contain any item but it is empty. {0}
cs: Očekávalo se, že kolekce bude obsahovat libovolnou položku, ale je prázdná. {0}
de: Es wurde erwartet, dass die Sammlung ein beliebiges Element enthält, aber leer ist. {0}
es: Se esperaba que la colección contenga cualquier elemento, pero está vacía. {0}
fr: La collection doit contenir n’importe quel élément, mais elle est vide. {0}
it: È previsto che la raccolta contenga qualsiasi elemento, ma è vuota. {0}
ja: コレクションには項目が含まれている必要がありますが、空です。{0}
ko: 항목을 포함할 컬렉션이 필요한데 비어 있습니다. {0}
pl: Oczekiwano, że kolekcja będzie zawierać dowolny element, ale jest pusta. {0}
pt_br: A coleção esperada conter qualquer item, mas ela está vazia. {0}
ru: Ожидается, что коллекция будет содержать любой элемент, но она пуста. {0}
tr: Koleksiyonun herhangi bir öğe içermesi bekleniyordu ancak boş. {0}
zh_hans: 集合应包含任何项，但它为空。{0}
zh_hant: 預期集合包含任何專案，但卻是空的。{0}

# IsNotInstanceOfFailMsg
source: Wrong Type:<{1}>. Actual type:<{2}>. {0}
cs: Špatný typ:<{1}>. Aktuální typ:<{2}>. {0}
de: Falscher Typ:<{1}>. Tatsächlicher Typ:<{2}>. {0}
es: Tipo incorrecto:<{1}>. Tipo actual:<{2}>. {0}
fr: Type incorrect : <{1}>, Type réel : <{2}>. {0}
it: Tipo errato:<{1}>. Tipo effettivo:<{2}>. {0}
ja: 正しくない型は <{1}> であり、実際の型は <{2}> です。{0}
ko: 잘못된 형식: <{1}>, 실제 형식: <{2}>. {0}
pl: Zły typ:<{1}>. Rzeczywisty typ:<{2}>. {0}
pt_br: Tipo errado:<{1}>. Tipo real:<{2}>. {0}
ru: Неверный тип: <{1}>. Фактический тип: <{2}>. {0}
tr: Yanlış Tür:<{1}>. Gerçek tür:<{2}>. {0}
zh_hans: 错误类型为: <{1}>，实际类型为: <{2}>。{0}
zh_hant: 錯誤的類型: <{1}>。實際的類型: <{2}>。{0}

# IsNotMatchFail
source: String '{0}' matches pattern '{1}'. {2}
cs: Řetězec „{0}“ odpovídá vzoru „{1}“. {2}
de: Die Zeichenfolge „{0}“ stimmt mit dem Muster „{1}“ überein. {2}
es: La cadena "{0}" coincide con el patrón "{1}". {2}
fr: La chaîne '{0}' correspond au modèle '{1}'. {2}
it: La stringa '{0}' corrisponde al criterio '{1}'. {2}
ja: 文字列 '{0}' はパターン '{1}' と一致します。{2}
ko: '{0}' 문자열이 '{1}' 패턴과 일치합니다. {2}
pl: Ciąg „{0}” jest zgodny ze wzorcem „{1}”. {2}
pt_br: A cadeia de caracteres “{0}” corresponde ao padrão “{1}”. {2}
ru: Строка "{0}" соответствует шаблону "{1}". {2}
tr: '{0}' dizesi, '{1}' deseni ile eşleşiyor. {2}

# PrivateAccessorMemberNotFound
source: The member specified ({0}) could not be found. You might need to regenerate your private accessor, or the member may be private and defined on a base class. If the latter is true, you need to pass the type that defines the member into PrivateObject's constructor.
cs: Zadaný člen ({0}) nemohl být nalezen. Je možné, že bude zapotřebí obnovit soukromý přístupový objekt, nebo může být člen soukromý a definovaný v základní třídě. Pokud je tvrzení pravdivé, bude zapotřebí předat typ , který definuje člena do konstruktoru PrivateObject.
de: Der angegebene Member ({0}) wurde nicht gefunden. Sie müssen möglicherweise Ihren privaten Accessor erneut generieren, oder der Member ist möglicherweise privat und für die Basisklasse definiert. Wenn letzteres zutrifft, müssen Sie den Typ, der den Member definiert, an den Konstruktor von PrivateObject übergeben.
es: No se encontró el miembro especificado ({0}). Es posible que tenga que volver a generar el descriptor de acceso privado, o que el miembro sea privado y esté definido en una clase base. Si esto último es cierto, debe pasar el tipo que define el miembro al constructor de PrivateObject.
fr: Le membre spécifié ({0}) est introuvable. Vous devrez peut-être régénérer votre accesseur private, ou le membre est peut-être private et défini sur une classe de base. Si le dernier cas est vrai, vous devez transmettre le type qui définit le membre dans le constructeur de PrivateObject.
it: Il membro specificato ({0}) non è stato trovato. Potrebbe essere necessario rigenerare la funzione di accesso privata oppure il membro potrebbe essere privato e definito per una classe base. In quest'ultimo caso, è necessario passare il tipo che definisce il membro nel costruttore di PrivateObject.
ja: 指定されたメンバー ({0}) が見つかりませんでした。プライベート アクセサーを再生成しなければならないか、 またはメンバーがプライベートであり、基底クラスで定義されている可能性があります。後者である場合は、メンバーを 定義する型を PrivateObject のコンストラクターに渡す必要があります。
ko: 지정한 멤버({0})를 찾을 수 없습니다. 프라이빗 접근자를 다시 생성해야 할 수 있습니다. 또는 멤버가 기본 클래스에 정의된 프라이빗 멤버일 수 있습니다. 기본 클래스에 정의된 전용 멤버인 경우에는 이 멤버를 정의하는 형식을 PrivateObject의 생성자에 전달해야 합니다.
pl: Nie można odnaleźć określonej składowej ({0}). Może być konieczne ponowne wygenerowanie prywatnej metody dostępu lub składowa może być zdefiniowana jako prywatna w klasie bazowej. W drugim przypadku należy przekazać typ, który definiuje składową w konstruktorze obiektu PrivateObject.
pt_br: O membro especificado ({0}) não pôde ser encontrado. Talvez seja necessário gerar novamente seu acessador particular ou o membro pode ser particular e definido em uma classe base. Se o último caso for verdadeiro, será necessário passar o tipo que define o membro no construtor do PrivateObject.
ru: Не удается найти указанный член ({0}). Возможно, требуется снова создать закрытый метод доступа либо член является закрытым и определенным на основе базового класса. Если справедливо последнее, то необходимо передать тип, определяющий член, в конструктор для PrivateObject.
tr: Belirtilen üye ({0}) bulunamadı. Özel erişimcinizi yeniden oluşturmanız gerekiyor olabilir veya üye, özel olabilir ve temel sınıfta tanımlı olabilir. Eğer ikincisi doğru ise, türü geçirmeniz gerekir; bu tür PrivateObject'in oluşturucusunda üyeyi tanımlar.
zh_hans: 未能找到指定的成员({0})。可能需要重新生成专用访问器， 或者该成员可能是私有成员并且是在基类上定义的。如果属于后一种情况，则需要将定义 该成员的类型传递到 PrivateObject 的构造函数中。
zh_hant: 找不到所指定的成員 ({0})。您可能必須重新產生私用存取子， 或者該成員可能為私用，並且定義在基底類別上。如果是後者， 您必須將定義該成員的類型傳遞至 PrivateObject 的建構函式。

# PrivateAccessorConstructorNotFound
source: The constructor with the specified signature could not be found. You might need to regenerate your private accessor, or the member may be private and defined on a base class. If the latter is true, you need to pass the type that defines the member into PrivateObject's constructor.
cs: Konstruktor se zadaným podpisem se nepovedlo najít. Je možné, že bude zapotřebí obnovit soukromý přistupující objekt, nebo může být člen soukromý a definovaný v základní třídě. Pokud je tvrzení pravdivé, bude zapotřebí předat typ , který definuje člena do konstruktoru PrivateObject.
de: Der Konstruktor mit der angegebenen Signatur wurde nicht gefunden. Sie müssen möglicherweise Ihren privaten Accessor erneut generieren, oder der Member ist möglicherweise privat und für die Basisklasse definiert. Wenn letzteres zutrifft, müssen Sie den Typ, der den Member definiert, an den Konstruktor von PrivateObject übergeben.
es: No se encontró el constructor con la signatura especificada. Es posible que tenga que volver a generar el descriptor de acceso privado, o que el miembro sea privado y esté definido en una clase base. Si esto último es cierto, debe pasar el tipo que define el miembro al constructor de PrivateObject.
fr: Le constructeur doté de la signature spécifiée est introuvable. Vous devrez peut-être régénérer votre accesseur private, ou le membre est peut-être private et défini sur une classe de base. Si le dernier cas est vrai, vous devez transmettre le type qui définit le membre dans le constructeur de PrivateObject.
it: Il costruttore con la firma specificata non è stato trovato. Potrebbe essere necessario rigenerare la funzione di accesso privata oppure il membro potrebbe essere privato e definito per una classe base. In quest'ultimo caso, è necessario passare il tipo che definisce il membro nel costruttore di PrivateObject.
ja: 指定されたシグネチャを使用するコンストラクターが見つかりませんでした。プライベート アクセサーを再生成しなければならないか、 またはメンバーがプライベートであり、基底クラスで定義されている可能性があります。後者である場合は、メンバーを 定義する型を PrivateObject のコンストラクターに渡す必要があります。
ko: 지정한 서명을 가진 생성자를 찾을 수 없습니다. 프라이빗 접근자를 다시 생성해야 할 수 있습니다. 또는 멤버가 기본 클래스에 정의된 프라이빗 멤버일 수 있습니다. 기본 클래스에 정의된 전용 멤버인 경우에는 이 멤버를 정의하는 형식을 PrivateObject의 생성자에 전달해야 합니다.
pl: Nie można odnaleźć konstruktora z określoną sygnaturą. Może być konieczne ponowne wygenerowanie prywatnej metody dostępu lub składowa może być zdefiniowana jako prywatna w klasie bazowej. W drugim przypadku należy przekazać typ, który definiuje składową w konstruktorze obiektu PrivateObject.
pt_br: O construtor com a assinatura especificada não pôde ser encontrado. Talvez seja necessário gerar novamente seu acessador particular ou o membro pode ser particular e definido em uma classe base. Se o último caso for verdadeiro, será necessário passar o tipo que define o membro para o construtor do PrivateObject.
ru: Не удается найти конструктор с указанной сигнатурой. Возможно, требуется снова создать закрытый метод доступа либо член является закрытым и определенным на основе базового класса. Если справедливо последнее, то необходимо передать тип, определяющий член, в конструктор для PrivateObject.
tr: Belirtilmiş imzaya sahip oluşturucu bulunamadı. Özel erişimcinizi yeniden oluşturmanız gerekiyor olabilir veya üye, özel olabilir ve temel sınıfta tanımlı olabilir. Eğer ikincisi doğru ise, türü geçirmeniz gerekir; bu tür, PrivateObject'in oluşturucusunda üyeyi tanımlar.
zh_hans: 未能找到具有指定签名的构造函数。可能需要重新生成专用访问器， 或者该成员可能是私有成员并且是在基类上定义的。如果属于后一种情况，则需要将定义 该成员的类型传递到 PrivateObject 的构造函数。
zh_hant: 找不到具有所指定簽章的建構函式。您可能必須重新產生私用存取子， 或者該成員可能為私用，並且定義在基底類別上。如果是後者，您必須 將定義該成員的類型傳遞至 PrivateObject 的建構函式。

# NullParameterToAssert
source: The parameter '{0}' is invalid. The value cannot be null. {1}.
cs: Parametr '{0}' je neplatný. Hodnota nemůže být null. {1}.
de: Der {0}-Parameter ist ungültig. Der Wert kann nicht NULL sein. {1}.
es: El parámetro '{0}' no es válido. El valor no puede ser null. {1}.
fr: Le paramètre '{0}' n'est pas valide. La valeur ne peut pas être null. {1}.
it: Il parametro '{0}' non è valido. Il valore non può essere Null. {1}.
ja: パラメーター '{0}' は無効です。値を null にすることはできません。{1}。
ko: '{0}' 매개 변수가 잘못되었습니다. 이 값은 null일 수 없습니다. {1}.
pl: Parametr „{0}” jest nieprawidłowy. Wartość nie może być równa null. {1}.
pt_br: O parâmetro '{0}' é inválido. O valor não pode ser nulo. {1}.
ru: Параметр "{0}" является недопустимым. Значение не может быть NULL. {1}.
tr: '{0}' parametresi geçersiz. Değer null olamaz. {1}.
zh_hans: 参数“{0}”无效。值不能为 NULL。{1}。
zh_hant: 參數 '{0}' 無效。此值不可為 null。{1}。

# NumberOfElementsDiff
source: Different number of elements.
cs: Rozdílný počet elementů.
de: Unterschiedliche Anzahl von Elementen.
es: Número diferente de elementos.
fr: Nombre d'éléments différent.
it: Il numero di elementi è diverso.
ja: 要素数が異なります。
ko: 요소 수가 다릅니다.
pl: Inna liczba elementów.
pt_br: Número diferente de elementos.
ru: Разное число элементов.
tr: Öğe sayıları farklı.
zh_hans: 不同数量的元素。
zh_hant: 項目數目不同。

# ReturnedSubsetValueMessage
source: Element(s) <{0}> is/are not present in the collection.
pt_br: O(s) elemento(s) <{0}> não está/estão presente(s) na coleção.

# StartsWithFail
source: String '{0}' does not start with string '{1}'. {2}
cs: Řetězec „{0}“ nezačíná řetězcem „{1}“. {2}
de: Die Zeichenfolge „{0}“ beginnt nicht mit der Zeichenfolge „{1}“. {2}
es: La cadena "{0}" no empieza con la cadena "{1}". {2}
fr: La chaîne '{0}' ne commence pas par la chaîne '{1}'. {2}
it: La stringa '{0}' non inizia con la stringa '{1}'. {2}
ja: 文字列 '{0}' は文字列 '{1}' で始まりません。{2}
ko: '{0}' 문자열이 '{1}' 문자열로 시작되지 않습니다. {2}
pl: Ciąg „{0}” nie rozpoczyna się od ciągu „{1}”. {2}
pt_br: A cadeia de caracteres “{0}” não começa com a cadeia de caracteres “{1}”. {2}
ru: Строка "{0}" не начинается со строки "{1}". {2}
tr: '{0}' dizesi, '{1}' dizesi ile başlamıyor. {2}

# InvalidPropertyType
source: The property {0} has type {1}; expected type {2}.
cs: Vlastnost {0} je typu {1}; očekávaný typ {2}.
de: Die {0}-Eigenschaft weist den Typ "{1}" auf; Typ "{2}" wird erwartet.
es: La propiedad {0} tiene el tipo {1}; se esperaba el tipo {2}.
fr: La propriété {0} possède le type {1} ; type attendu {2}.
it: Il tipo della proprietà {0} è {1}, ma quello previsto è {2}.
ja: プロパティ {0} は型 {1} を含んでいますが、型 {2} が必要です。
ko: {0} 속성의 형식은 {2}이어야 하는데 실제로는 {1}입니다.
pl: Właściwość {0} jest typu {1}; oczekiwano typu {2}.
pt_br: A propriedade {0} é do tipo {1}; o tipo esperado era {2}.
ru: Свойство {0} имеет тип {1}. Ожидается тип {2}.
tr: {0} özelliği, {1} türüne sahip; beklenen tür {2}.
zh_hans: 属性 {0} 的类型为 {1}；类型应为 {2}。
zh_hant: 屬性 {0} 具有類型 {1}; 預期為類型 {2}。

# Common_NullInMessages
source: (null)
pt_br: (nulo)

# Common_ObjectString
source: (object)
cs: (objekt)
de: (Objekt)
es: (objeto)
fr: (objet)
it: (oggetto)
ja: (オブジェクト)
ko: (개체)
pl: (obiekt)
pt_br: (objeto)
ru: (объект)
tr: (nesne)
zh_hans: (对象)
zh_hant: (物件)

# UTF_FailedToGetExceptionMessage
source: (Failed to get the message for an exception of type {0} due to an exception.)
cs: (Z důvodu výjimky se nepodařilo získat zprávu o výjimce typu {0}.)
de: (Fehler beim Abrufen der Meldung für eine Ausnahme vom Typ "{0}" aufgrund einer Ausnahme.)
es: (No se pudo obtener el mensaje para una excepción del tipo {0} debido a una excepción.)
fr: (Échec de la réception du message pour une exception de type {0} en raison d'une exception.)
it: Non è stato possibile ottenere il messaggio per un'eccezione di tipo {0} a causa di un'eccezione.
ja: (例外が発生したため、型 {0} の例外のメッセージを取得できませんでした。)
ko: (예외로 인해 {0} 형식의 예외에 대한 메시지를 가져오지 못했습니다.)
pl: (Nie można pobrać komunikatu dotyczącego wyjątku typu {0} z powodu wyjątku).
pt_br: (Falha ao obter a mensagem para uma exceção do tipo {0} devido a uma exceção.)
ru: (Не удалось получить сообщение для исключения с типом {0} в связи с возникновением исключения.)
tr: (Bir özel durum nedeniyle, {0} türündeki özel durum iletisi alınamadı.)
zh_hans: (因异常而未能获取类型为 {0} 的异常的消息。)
zh_hant: (因為發生例外狀況，所以無法取得類型 {0} 之例外狀況的訊息。)
