Repository: microsoft/testfx
Catalog: src/TestFramework/TestFramework/Resources/xlf/FrameworkMessages.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UTF_TestMethodNoExceptionDefault
source: Test method did not throw an exception. An exception was expected by attribute {0} defined on the test method.
cs: Testovací metoda nevyvolala výjimku. Atribut {0} definovaný u testovací metody výjimku očekával.
de: Die Testmethode hat keine Ausnahme ausgelöst. Eine Ausnahme wurde vom Attribut "{0}" erwartet, das für die Testmethode definiert wurde.
es: El método de prueba no inició una excepción. El atributo {0} definido en el método de prueba esperaba una excepción.
fr: La méthode de test n'a pas levé d'exception. Une exception était attendue par l'attribut {0} défini sur la méthode de test.
it: Il metodo di test non ha generato un'eccezione. È prevista un'eccezione dall'attributo {0} definito nel metodo di test.
ja: テスト メソッドは例外をスローしませんでした。テスト メソッドで定義されている属性 {0} で例外が予期されていました。
ko: 테스트 메서드에서 예외를 throw하지 않았습니다. 예외는 테스트 메서드에 정의된 {0} 특성에 의해 예상되었습니다.
pl: Metoda testowa nie zgłosiła wyjątku. Oczekiwano zgłoszenia wyjątku przez atrybut {0} zdefiniowany dla metody testowej.
ru: Метод теста не создал исключение. Исключение ожидалось атрибутом {0}, определенным в методе теста.
tr: Test metodu bir özel durum oluşturmadı. Test metodunda tanımlanan {0} özniteliği tarafından bir özel durum bekleniyordu.
zh_hans: 测试方法未引发异常。预期会因测试方法上定义的属性 {0} 引发一个异常。
zh_hant: 測試方法未擲回例外狀況。測試方法上定義的屬性 {0} 需要例外狀況。

# UTF_TestMethodNoException
source: Test method did not throw expected exception {0}. {1}
cs: Testovací metoda nevyvolala očekávanou výjimku {0}. {1}
de: Die Testmethode hat die erwartete Ausnahme "{0}" nicht ausgelöst. {1}
es: El método de prueba no inició la excepción esperada {0}. {1}
fr: La méthode de test n'a pas levé l'exception attendue {0}. {1}
it: Il metodo di test non ha generato l'eccezione prevista {0}. {1}
ja: テスト メソッドは例外 {0} をスローしませんでした。{1}
ko: 테스트 메서드에서 예상 예외 {0}을(를) throw하지 않았습니다. {1}
pl: Metoda testowa nie zgłosiła oczekiwanego wyjątku {0}. {1}
ru: Метод теста не создал ожидаемое исключение ({0}). {1}
tr: Test yöntemi beklenen {0} özel durumunu oluşturmadı. {1}
zh_hans: 测试方法未引发预期异常 {0}. {1}
zh_hant: 測試方法未擲回預期的例外狀況 {0}。{1}

# UTF_TestMethodWrongException
source: Test method threw exception {0}, but exception {1} was expected. Exception message: {2}
cs: Testovací metoda vyvolala výjimku {0}, ale očekávala se výjimka {1}. Zpráva o výjimce: {2}
de: Die Testmethode hat die Ausnahme "{0}" ausgelöst, aber die Ausnahme "{1}" wurde erwartet. Ausnahmemeldung: {2}
es: El método de prueba inició la excepción {0}, pero se esperaba la excepción {1}. Mensaje de la excepción: {2}
fr: La méthode de test a levé l'exception {0}, mais l'exception {1} était attendue. Message d'exception : {2}
it: Il metodo di test ha generato l'eccezione {0}, ma era prevista l'eccezione {1}. Messaggio dell'eccezione: {2}
ja: テスト メソッドは、例外 {0} をスローしましたが、例外 {1} が予期されていました。例外メッセージ: {2}
ko: 테스트 메서드에서 {0} 예외를 throw했지만 {1} 예외를 예상했습니다. 예외 메시지: {2}
pl: Metoda testowa zgłosiła wyjątek {0}, lecz oczekiwano wyjątku {1}. Komunikat wyjątku: {2}
ru: Метод теста создал исключение "{0}", а ожидалось исключение "{1}". Сообщение исключения: "{2}".
tr: Test yöntemi {0} özel durumunu oluşturdu, ancak {1} özel durumu bekleniyordu. Özel durum iletisi: {2}
zh_hans: 测试方法引发异常 {0}，但预期异常是 {1}。异常消息: {2}
zh_hant: 測試方法擲回例外狀況 {0}，但需要的是例外狀況 {1}。例外狀況訊息: {2}

# UTF_TestMethodWrongExceptionDerivedAllowed
source: Test method threw exception {0}, but exception {1} or a type derived from it was expected. Exception message: {2}
cs: Testovací metoda vyvolala výjimku {0}, ale očekávala se výjimka {1} nebo od ní odvozený typ. Zpráva o výjimce: {2}
de: Die Testmethode hat die Ausnahme "{0}" ausgelöst, aber die Ausnahme "{1}" oder ein davon abgeleiteter Typ wurde erwartet. Ausnahmemeldung: {2}
es: El método de prueba inició la excepción {0}, pero se esperaba la excepción {1} o un tipo derivado de ella. Mensaje de la excepción: {2}
fr: La méthode de test a levé l'exception {0}, mais l'exception {1} (ou un type dérivé de cette dernière) était attendue. Message d'exception : {2}
it: Il metodo di test ha generato l'eccezione {0}, ma era prevista l'eccezione {1} o un tipo derivato da essa. Messaggio dell'eccezione: {2}
ja: テスト メソッドは、例外 {0} をスローしましたが、例外 {1} またはその派生型が予期されていました。例外メッセージ: {2}
ko: 테스트 메서드에서 {0} 예외를 throw했지만 {1} 예외 또는 해당 예외에서 파생된 형식을 예상했습니다. 예외 메시지: {2}
pl: Metoda testowa zgłosiła wyjątek {0}, lecz oczekiwano wyjątku typu {1} lub jego typu pochodnego. Komunikat wyjątku: {2}
ru: Метод теста создал исключение "{0}", а ожидалось исключение "{1}" или производный от него тип. Сообщение исключения: "{2}".
tr: Test yöntemi {0} özel durumunu oluşturdu, ancak {1} özel durumu veya ondan türetilmiş bir tür bekleniyordu. Özel durum iletisi: {2}
zh_hans: 测试方法引发异常 {0}，但预期异常是 {1} 或其派生类型。异常消息: {2}
zh_hant: 測試方法擲回例外狀況 {0}，但需要的是例外狀況 {1} 或是衍生自其的類型。例外狀況訊息: {2}

# DynamicDataInvalidMethodLayout
source: Dynamic data method '{0}' should be static, parameterless and non-generic.
zh_hans: 动态数据方法“{0}”应为静态、无参数和非泛型。
zh_hant: 動態資料方法 '{0}' 應為靜態、無參數及非泛型。

# DynamicDataSourceShouldExistAndBeValid
source: The dynamic data source '{0}' in type '{1}' should exist and be a property or a method.
zh_hans: 类型 '{1}' 中的动态数据源 '{0}' 应存在，并且应为属性或方法。
zh_hant: 類型 '{1}' 中的動態數據源 '{0}' 應該存在，而且必須是屬性或方法。

# AsyncUITestMethodNotSupported
source: async TestMethod with UITestMethodAttribute are not supported. Either remove async or use TestMethodAttribute.
zh_hans: 不支持具有 UITestMethodAttribute 的异步 TestMethod。请删除异步或使用 TestMethodAttribute。
zh_hant: 不支援有 UITestMethodAttribute 的 async TestMethod。請移除 async 或使用 TestMethodAttribute。

# AsyncUITestMethodWithNoDispatcherQueue
source: UITestMethodAttribute.DispatcherQueue should not be null. To use UITestMethodAttribute within a WinUI Desktop App, remember to set the static UITestMethodAttribute.DispatcherQueue during the test initialization.
zh_hans: UITestMethodAttribute.DispatcherQueue 不应为 null。若要在 WinUI 桌面应用中使用 UITestMethodAttribute，请在测试初始化期间设置静态 UITestMethodAttribute.DispatcherQueue。
zh_hant: UITestMethodAttribute.DispatcherQueue 不應為 Null。若要在 WinUI 傳統型應用程式內使用 UITestMethodAttribute，請記得在測試初始化期間設定靜態 UITestMethodAttribute.DispatcherQueue。

# ArgumentXMustDeriveFromClassY
source: Type '{0}' is not assignable to '{1}'.
zh_hans: 类型“{0}”不能分配给“{1}”。
zh_hant: 無法將類型 '{0}' {0} 指派給 '{1}。
