Repository: microsoft/testfx
Catalog: src/TestFramework/TestFramework/Resources/xlf/FrameworkMessages.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NoExceptionThrown
source: Expected exception type:<{1}> but no exception was thrown. {0}
cs: Byl očekáván typ výjimky: <{1}>, ale nebyla vyvolána žádná výjimka. {0}
de: Erwarteter Ausnahmetyp:<{1}>, aber es wurde keine Ausnahme ausgelöst. {0}
es: Tipo de excepción esperada:<{1}> pero no se lanzó ninguna excepción. {0}
fr: Type d’exception attendu :<{1}> mais aucune exception n’a été levée. {0}
it: È previsto il tipo di eccezione: <{1}> ma non è stata generata alcuna eccezione. {0}
ja: 例外の種類: <{1}> が予期されますが、例外はスローされませんでした。{0}
ko: 예상 예외 형식:<{1}> 하지만 예외가 발생하지 않음. {0}
pl: Oczekiwano typu wyjątku:<{1}>, ale nie zgłoszono wyjątku. {0}
pt_br: Tipo de exceção esperado:<{1}> mas nenhuma exceção foi lançada. {0}
ru: Ожидаемый тип исключения:<{1}> но исключение не создано. {0}
tr: Beklenen özel durum türü:<{1}> ancak hiçbir özel durum oluşmadı. {0}
zh_hans: 预期异常类型:<{1}>，但未引发异常。{0}
zh_hant: 預期的例外狀況類型：<{1}>，但未擲回任何例外狀況。{0}

# WrongExceptionThrown
source: Expected exception type:<{1}>. Actual exception type:<{2}>. {0}
cs: Očekávaný typ výjimky: <{1}> Skutečný typ výjimky: <{2}>. {0}
de: Erwarteter Ausnahmetyp:<{1}>. Tatsächlicher Ausnahmetyp:<{2}>. {0}
es: Tipo de excepción esperada:<{1}>. Tipo de excepción actual: <{2}>. {0}
fr: Type d’exception attendu :<{1}>. Type d’exception réel :<{2}>. {0}
it: Tipo di eccezione previsto:<{1}>. Tipo di eccezione effettivo: <{2}>. {0}
ja: 予期される例外の種類: <{1}>。実際の例外の種類: <{2}>。{0}
ko: 예상 예외 형식:<{1}>. 실제 예상 형식:<{2}>. {0}
pl: Oczekiwano typu wyjątku:<{1}>. Rzeczywisty typ wyjątku:<{2}>. {0}
pt_br: Tipo de exceção esperado:<{1}>. Tipo de exceção real:<{2}>. {0}
ru: Ожидаемый тип исключения:<{1}>. Фактический тип исключения:<{2}>. {0}
tr: Beklenen özel durum türü:<{1}>. Gerçek özel durum türü:<{2}>. {0}
zh_hans: 预期异常类型:<{1}>。实际异常类型:<{2}>。{0}
zh_hant: 預期的例外狀況類型：<{1}>。實際的例外狀況類型：<{2}>。{0}

# DynamicDataIEnumerableNull
source: Property or method {0} on {1} return type is not assignable to 'IEnumerable'.
cs: Vlastnost nebo metoda {0} na návratovém typu {1} se nedá přiřadit k „IEnumerable“.
de: Eigenschaft oder Methode {0} für {1} Rückgabetyp kann „IEnumerable“ nicht zugewiesen werden.
es: La propiedad o el método {0} en el tipo de retorno {1} no se puede asignar a "IEnumerable".
fr: La propriété ou la méthode {0} sur le type de retour {1} ne peut pas être attribuée à « IEnumerable ».
it: La proprietà o il metodo {0} su {1} tipo restituito non è assegnabile a 'IEnumerable'.
ja: {1} 戻り値の型のプロパティまたはメソッド {0} は、'IEnumerable' に割り当てできません。
ko: {1} 반환 형식의 속성 또는 메서드 {0}은(는) 'IEnumerable'에 할당할 수 없습니다.
pl: Właściwości lub metody {0} dla zwracanego typu {1} nie można przypisać do elementu „IEnumerable”.
pt_br: A propriedade ou o método {0} no tipo de retorno {1} não podem ser atribuídos a "IEnumerable".
ru: Свойство или метод {0} в {1} тип возвращаемого значения не может быть назначен "IEnumerable".
tr: {1} dönüş türündeki {0} özelliği veya yöntemi 'IEnumerable' öğesine atanamaz.
zh_hans: {1} 返回类型上的属性或方法 {0} 不能分配给 "IEnumerable"。
zh_hant: {1} 傳回類型上的屬性或方法 {0} 無法指派給 'IEnumerable'。

# DynamicDataValueNull
source: Value returned by property or method {0} shouldn't be null.
cs: Hodnota vrácená vlastností nebo metodou {0} by neměla být null.
de: Der von der Eigenschaft oder Methode "{0}" zurückgegebene Wert darf nicht NULL sein.
es: El valor devuelto por la propiedad o el método {0} no debe ser nulo.
fr: La valeur retournée par la propriété ou la méthode {0} ne doit pas être Null.
it: Il valore restituito dalla proprietà o dal metodo {0} non deve essere Null.
ja: プロパティやメソッド {0} によって返される値を null にすることはできません。
ko: 속성 또는 메서드 {0}에 의해 반환된 값은 null일 수 없습니다.
pl: Wartość zwracana przez właściwość lub metodę {0} nie powinna być równa null.
pt_br: O valor retornado pela propriedade ou o método {0} não deve ser nulo null.
ru: Значение, возвращаемое свойством или методом {0}, не должно быть равно NULL.
tr: {0} özelliği veya metodu tarafından döndürülen değer null olamaz.
zh_hans: 属性或方法 {0} 返回的值不能为 null。
zh_hant: 屬性或方法 {0} 傳回的值不可為 null。

# DynamicDataDisplayName
source: Method {0} must match the expected signature: public static {1} {0}({2}).
cs: Metoda {0} musí odpovídat očekávanému podpisu: public static {1} {0}({2}).
de: Die Methode "{0}" muss der erwarteten Signatur entsprechen: public static {1} {0}({2}).
es: El método {0} debe coincidir con la signatura esperada: {1} {0}({2}) estática pública.
fr: La méthode {0} doit correspondre à la signature attendue : public static {1} {0}({2}).
it: Il metodo {0} deve corrispondere alla firma prevista: public static {1} {0}({2}).
ja: メソッド {0} は必要なシグネチャと一致しなければなりません: public static {1} {0}({2})。
ko: 메서드 {0}은(는) 다음 예상 시그니처와 일치해야 합니다. 공용 정적 {1} {0}({2}).
pl: Metoda {0} musi być zgodna z oczekiwaną sygnaturą: public static {1} {0}({2}).
pt_br: O método {0} deve corresponder à assinatura esperada: public static {1} {0}({2}).
ru: Метод {0} должен соответствовать ожидаемой сигнатуре: public static {1} {0}({2}).
tr: {0} metodu, beklenen imzayla eşleşmelidir: public static {1} {0}({2}).
zh_hans: 方法 {0} 必须匹配预期签名: public static {1} {0}({2})。
zh_hant: 方法 {0} 必須與正確的簽章相符: public static {1} {0}({2})。

# DynamicDataIEnumerableEmpty
source: Property or method {0} on {1} returns empty IEnumerable<object[]>.
cs: Vlastnost nebo metoda {0} ve třídě {1} vrací prázdné IEnumerable<object[]>.
de: Eigenschaft oder Methode "{0}" in "{1}" gibt leeres IEnumerable<object[]> zurück.
es: La propiedad o el método {0} en {1} devuelve un elemento IEnumerable<object[]> vacío.
fr: La propriété ou la méthode {0} sur {1} retourne un IEnumerable<object[]> vide.
it: La proprietà o il metodo {0} nella classe {1} restituisce un elemento IEnumerable<object[]> vuoto.
ja: {1} 上のプロパティまたはメソッド {0} は空の IEnumerable<object[]> を返します。
ko: {1}의 속성 또는 메서드 {0}이(가) 빈 IEnumerable<object[]>를 반환합니다.
pl: Właściwość lub metoda {0} w elemencie {1} zwraca pusty interfejs IEnumerable<object[]>.
pt_br: A propriedade ou o método {0} em {1} retorna um IEnumerable<object[]> vazio.
ru: Свойство или метод {0} класса {1} возвращает пустой IEnumerable<object[]>.
tr: {1} üzerindeki {0} özelliği veya metodu boş IEnumerable<object[]> döndürür.
zh_hans: {1} 上的属性或方法 {0} 返回空 IEnumerable<object[]>。
zh_hant: {1} 上的屬性或方法 {0} 傳回空的 IEnumerable<object[]>。

# IsGreaterThanFailMsg
source: Actual value <{2}> is not greater than expected value <{1}>. {0}
cs: Skutečná hodnota <{2}> není větší než očekávaná hodnota <{1}>. {0}
de: Der tatsächliche Wert <{2}> ist nicht größer als der erwartete Wert <{1}>. {0}
es: El valor real <{2}> no es mayor que el valor esperado <{1}>. {0}
fr: La valeur réelle <{2}> n’est pas supérieure à la valeur attendue <{1}>. {0}
it: Il valore effettivo <{2}> non è maggiore del valore previsto <{1}>. {0}
ja: 実際の値 <{2}> は、予期された値 <{1}> より大きくありません。{0}
ko: 실제 값 <{2}>은(는)는 예상 값 <{1}>보다 크지 않습니다. {0}
pl: Wartość rzeczywista <{2}> nie jest większa niż oczekiwana wartość <{1}>. {0}
pt_br: O valor <{2}> real não é maior que o valor esperado <{1}>. {0}
ru: Действительное значение <{2}> не больше ожидаемого значения <{1}>. {0}
tr: Geçerli <{2}> değeri, beklenen <{1}> değerinden daha büyük değil. {0}

# IsGreaterThanOrEqualToFailMsg
source: Actual value <{2}> is not greater than or equal to expected value <{1}>. {0}
cs: Skutečná hodnota <{2}> není větší nebo rovna očekávané hodnotě <{1}>. {0}
de: Der tatsächliche Wert <{2}> ist nicht größer oder gleich dem erwarteten Wert <{1}>. {0}
es: El valor real <{2}> no es mayor o igual que el valor esperado <{1}>. {0}
fr: La valeur réelle <{2}> n’est pas supérieure ou égale à la valeur attendue <{1}>. {0}
it: Il valore effettivo <{2}> non è maggiore o uguale al valore previsto <{1}>. {0}
ja: 実際の値 <{2}> は、予期された値 <{1}> 以上ではありません。{0}
ko: 실제 값 <{2}>은(는)는 예상 값 <{1}>보다 크거나 같지 않습니다. {0}
pl: Wartość rzeczywista <{2}> nie jest większa lub równa oczekiwanej wartości <{1}>. {0}
pt_br: O valor <{2}> real não é maior ou igual ao valor esperado <{1}>. {0}
ru: Действительное значение <{2}> не больше или не равно ожидаемому значению <{1}>. {0}
tr: Geçerli <{2}> değeri, beklenen <{1}> değerinden büyük veya bu değere eşit değil. {0}

# IsLessThanFailMsg
source: Actual value <{2}> is not less than expected value <{1}>. {0}
cs: Skutečná hodnota <{2}> není menší než očekávaná hodnota <{1}>. {0}
de: Der tatsächliche Wert <{2}> ist nicht kleiner als der erwartete Wert <{1}>. {0}
es: El valor real <{2}> no es menor que el valor esperado <{1}>. {0}
fr: La valeur réelle <{2}> n’est pas inférieure à la valeur attendue <{1}>. {0}
it: Il valore effettivo <{2}> non è minore del valore previsto <{1}>. {0}
ja: 実際の値 <{2}> は、予期された値 <{1}> より小さくありません。{0}
ko: 실제 값 <{2}>은(는)는 예상 값 <{1}>보다 작지 않습니다. {0}
pl: Wartość rzeczywista <{2}> nie jest mniejsza niż oczekiwana wartość <{1}>. {0}
pt_br: O valor <{2}> real não é menor que o valor esperado <{1}>. {0}
ru: Действительное значение <{2}> не меньше ожидаемого значения <{1}>. {0}
tr: Geçerli <{2}> değeri, beklenen <{1}> değerinden daha küçük değil. {0}

# IsLessThanOrEqualToFailMsg
source: Actual value <{2}> is not less than or equal to expected value <{1}>. {0}
cs: Skutečná hodnota <{2}> není menší nebo rovna očekávané hodnotě <{1}>. {0}
de: Der tatsächliche Wert <{2}> ist nicht kleiner oder gleich dem erwarteten Wert <{1}>. {0}
es: El valor real <{2}> no es menor o igual que el valor esperado <{1}>. {0}
fr: La valeur réelle <{2}> n’est pas inférieure ou égale à la valeur attendue <{1}>. {0}
it: Il valore effettivo <{2}> non è minore o uguale al valore previsto <{1}>. {0}
ja: 実際の値 <{2}> は、予期された値 <{1}> 以下ではありません。{0}
ko: 실제 값 <{2}>은(는)는 예상 값 <{1}>보다 작거나 같지 않습니다. {0}
pl: Wartość rzeczywista <{2}> nie jest mniejsza lub równa oczekiwanej wartości <{1}>. {0}
pt_br: O valor <{2}> real não é menor ou igual ao valor esperado <{1}>. {0}
ru: Действительное значение <{2}> не меньше или не равно ожидаемому значению <{1}>. {0}
tr: Geçerli <{2}> değeri, beklenen <{1}> değerinden küçük veya bu değere eşit değil. {0}

# IsPositiveFailMsg
source: Expected value <{1}> to be positive. {0}
cs: Očekávaná hodnota <{1}> má být kladná. {0}
de: Es wurde erwartet, dass der Wert <{1}> positiv ist. {0}
es: Se esperaba que el valor <{1}> ser positivo. {0}
fr: La valeur attendue <{1}> doit être positive. {0}
it: Il valore <{1}{0}> dovrebbe essere positivo.
ja: 正の値 <{1}> が必要です。{0}
ko: 예상 값 <{1}>은(는) 양수일 것으로 예상합니다. {0}
pl: Oczekiwana wartość <{1}> powinna być dodatnia. {0}
pt_br: O valor <{1}> esperado deve ser positivo. {0}
ru: Ожидалось, что значение <{1}> будет положительным. {0}
tr: Beklenen <{1}> değeri pozitif olmalıdır. {0}

# IsNegativeFailMsg
source: Expected value <{1}> to be negative. {0}
cs: Očekávaná hodnota <{1}> má být záporná. {0}
de: Es wurde erwartet, dass der Wert <{1}> negativ ist. {0}
es: Se esperaba que el valor <{1}> ser negativo. {0}
fr: La valeur attendue <{1}> doit être négative. {0}
it: Il valore <{1}{0}> dovrebbe essere negativo.
ja: 負の値 <{1}> が必要です。{0}
ko: 예상 값 <{1}>은(는) 음수일 것으로 예상합니다. {0}
pl: Oczekiwana wartość <{1}> powinna być negatywna. {0}
pt_br: O valor <{1}> esperado deve ser negativo. {0}
ru: Ожидалось, что значение <{1}> будет отрицательным. {0}
tr: Beklenen <{1}> değeri negatif olmalıdır. {0}

# DoNotUseAssertEquals
source: Assert.Equals should not be used for Assertions. Please use Assert.AreEqual & overloads instead.
cs: Assert.Equals by neměla být pro kontrolní výrazy používána. Použijte prosím místo toho Assert.AreEqual a její přetížení.
de: Assert.Equals sollte nicht für Assertions verwendet werden. Verwenden Sie stattdessen Assert.AreEqual und Überladungen.
es: No se debe usar Assert.Equals para aserciones. Use Assert.AreEqual y Overloads en su lugar.
fr: Assert.Equals ne doit pas être utilisé pour les assertions. Utilisez Assert.AreEqual & overloads à la place.
it: Non è possibile usare Assert.Equals per le asserzioni. Usare Assert.AreEqual e gli overload.
ja: アサーションには Assert.Equals を使用せずに、Assert.AreEqual とオーバーロードを使用してください。(& )
ko: 어설션에 Assert.Equals를 사용할 수 없습니다. 대신 Assert.AreEqual 및 오버로드를 사용하세요.
pl: Assert.Equals nie powinno być używane do potwierdzania. Zamiast tego użyj Assert.AreEqual i przeciążeń.
pt_br: Assert.Equals não deveria ser usado para Declarações. Use Assert.AreEqual e sobrecargas em seu lugar.
ru: Нельзя использовать Assert.Equals для Assertions. Вместо этого используйте Assert.AreEqual и перегрузки.
tr: Assert.Equals, Onaylama için kullanılmamalı. Lütfen yerine Assert.AreEqual & aşırı yüklemeleri kullanın.
zh_hans: Assert.Equals 不应用于断言。请改用 Assert.AreEqual 和重载。
zh_hant: Assert.Equals 不應使用於判斷提示。請改用 Assert.AreEqual 及多載。

# DoNotUseAssertReferenceEquals
source: Assert.ReferenceEquals should not be used for Assertions. Please use Assert.AreSame & overloads instead.
cs: Assert.ReferenceEquals se nemá používat pro kontrolní výrazy. Použijte prosím místo toho Assert.AreEqual & overloads.
de: Assert.ReferenceEquals sollte nicht für Assertions verwendet werden. Verwenden Sie stattdessen Assert.AreSame und Überladungen.
es: Assert.ReferenceEquals no se debe usar para las aserciones. Use Assert.AreSame & sobrecargas en su lugar.
fr: Assert.ReferenceEquals ne doit pas être utilisé pour les assertions. Utilisez Assert.AreEqual & overloads à la place.
it: Non è possibile usare Assert.ReferenceEquals per le asserzioni. In alternativa, usare Assert.AreSame e gli overload.
ja: アサーションには Assert.ReferenceEquals を使用しないでください。Assert.AreSame およびオーバーロードを使用してください。
ko: 어설션에 Assert.ReferenceEquals를 사용할 수 없습니다. 대신 Assert.AreSame 및 오버로드를 사용하세요.
pl: Element Assert.ReferenceEquals nie powinien być używany dla asercji. Zamiast tego użyj metody Assert.AreSame i przeciążeń.
pt_br: Assert.ReferenceEquals não deve ser usado com as Declarações. Em vez disso, use Assert.AreSame e as sobrecargas.
ru: Нельзя использовать Assert.ReferenceEquals для Assertions. Вместо этого используйте Assert.AreSame и перегрузки.
tr: Assert.ReferenceEquals, Onaylama için kullanılmamalı. Lütfen yerine Assert.AreSame & aşırı yüklemeleri kullanın.

# DoNotUseStringAssertEquals
source: StringAssert.Equals should not be used for Assertions. Please use StringAssert methods or Assert.AreEqual & overloads instead.
cs: StringAssert.Equals se nemá používat pro kontrolní výrazy. Místo toho použijte metody StringAssert nebo Assert.AreEqual & overloads.
de: StringAssert.Equals sollte nicht für Assertions verwendet werden. Verwenden Sie stattdessen StringAssert-Methoden oder Assert.AreEqual und Überladungen.
es: StringAssert.Equals no se debe usar para las aserciones. Use los métodos StringAssert o las sobrecargas Assert.AreEqual & en su lugar.
fr: StringAssert.Equals ne doit pas être utilisé pour les assertions. Utilisez plutôt les méthodes StringAssert ou Assert.AreEqual & overloads.
it: Non è possibile usare StringAssert.Equals per le asserzioni. In alternativa, usare i metodi StringAssert o Assert.AreEqual e gli overload.
ja: アサーションには StringAssert.Equals を使用しないでください。代わりに StringAssert メソッドまたは Assert.AreEqual およびオーバーロードを使用してください。
ko: 어설션에 StringAssert.Equals를 사용할 수 없습니다. 대신 StringAssert 메서드 또는 Assert.AreEqual 및 오버로드를 사용하세요.
pl: Element StringAssert.Equals nie powinien być używany dla asercji. Zamiast tego użyj metod StringAssert lub Assert.AreEqual i przeciążeń.
pt_br: StringAssert.Equals não deve ser usado com as Declarações. Em vez disso, use os métodos StringAssert ou Assert.AreEqual e as sobrecargas.
ru: Нельзя использовать StringAssert.Equals для Assertions. Вместо этого используйте методы StringAssert или Assert.AreEqual и перегрузки.
tr: StringAssert.Equals, Onaylama için kullanılmamalı. Lütfen bunun yerine StringAssert yöntemlerini veya Assert.AreEqual & aşırı yüklemelerini kullanın.

# DoNotUseStringAssertReferenceEquals
source: StringAssert.ReferenceEquals should not be used for Assertions. Please use StringAssert methods or Assert.AreSame & overloads instead.
cs: StringAssert.ReferenceEquals se nemá používat pro kontrolní výrazy. Místo toho použijte metody StringAssert nebo Assert.AreSame & overloads.
de: StringAssert.ReferenceEquals darf nicht für Assertions verwendet werden. Verwenden Sie stattdessen StringAssert-Methoden oder Assert.AreSame und Überladungen.
es: StringAssert.ReferenceEquals no se debe usar para las aserciones. Use los métodos StringAssert o las sobrecargas Assert.AreSame & en su lugar.
fr: StringAssert.ReferenceEquals ne doit pas être utilisé pour les assertions. Utilisez plutôt les méthodes StringAssert ou Assert.AreSame & overloads.
it: Non è possibile usare StringAssert.ReferenceEquals per le asserzioni. In alternativa, usare i metodi StringAssert o Assert.AreSame e gli overload.
ja: アサーションには StringAssert.ReferenceEquals を使用しないでください。代わりに StringAssert メソッドまたは Assert.AreSame およびオーバーロードを使用してください。
ko: StringAssert.ReferenceEquals는 Assertions에 사용할 수 없습니다. 대신 StringAssert 메서드 또는 Assert.AreSame 및 오버로드를 사용하세요.
pl: Element StringAssert.ReferenceEquals nie powinien być używany dla asercji. Zamiast tego użyj metod StringAssert lub Assert.AreSame i obciążeń.
pt_br: StringAssert.ReferenceEquals não deve ser usado com as Declarações. Em vez disso, use os métodos StringAssert ou Assert.AreSame e as sobrecargas.
ru: Нельзя использовать StringAssert.ReferenceEquals для Assertions. Вместо этого используйте методы StringAssert или Assert.AreSame и перегрузки.
tr: StringAssert.ReferenceEquals, Onaylama için kullanılmamalı. Lütfen bunun yerine StringAssert yöntemlerini veya Assert.AreSame & aşırı yüklemelerini kullanın.

# DoNotUseCollectionAssertEquals
source: CollectionAssert.Equals should not be used for Assertions. Please use CollectionAssert.AreEqual & overloads instead.
cs: CollectionAssert.Equals se nemá používat pro kontrolní výrazy. Místo toho použijte CollectionAssert.AreEqual & overloads.
de: CollectionAssert.Equals sollte nicht für Assertions verwendet werden. Verwenden Sie stattdessen CollectionAssert.AreEqual und Überladungen.
es: CollectionAssert.Equals no se debe usar para las aserciones. Use CollectionAssert.AreEqual y sobrecargas en su lugar.
fr: Assert.Equals ne doit pas être utilisé pour les assertions. Utilisez plutôt CollectionAssert.AreEqual & overloads.
it: Non è possibile usare CollectionAssert.Equals per le asserzioni. In alternativa, usare CollectionAssert.AreEqual e gli overload.
ja: アサーションには CollectionAssert.Equals を使用しないでください。代わりに CollectionAssert.AreEqual およびオーバーロードを使用してください。
ko: 어설션에 CollectionAssert.Equals를 사용할 수 없습니다. 대신 CollectionAssert.AreEqual 및 오버로드를 사용하세요.
pl: Element CollectionAssert.Equals nie powinien być używany dla asercji. Zamiast tego użyj metody CollectionAssert.AreEqual i przeciążeń.
pt_br: CollectionAssert.Equals não deve ser usado com as Declarações. Em vez disso, use CollectionAssert.AreEqual e as sobrecargas.
ru: Нельзя использовать CollectionAssert.Equals для Assertions. Вместо этого используйте CollectionAssert.AreEqual и перегрузки.
tr: CollectionAssert.Equals, Onaylama için kullanılmamalı. Lütfen yerine CollectionAssert.AreEqual & aşırı yüklemeleri kullanın.

# DoNotUseCollectionAssertReferenceEquals
source: CollectionAssert.ReferenceEquals should not be used for Assertions. Please use CollectionAssert methods or Assert.AreSame & overloads instead.
cs: CollectionAssert.ReferenceEquals se nemá používat pro kontrolní výrazy. Místo toho použijte metody CollectionAssert nebo Assert.AreSame & overloads.
de: CollectionAssert.ReferenceEquals darf nicht für Assertions verwendet werden. Verwenden Sie stattdessen CollectionAssert-Methoden oder Assert.AreSame und Überladungen.
es: CollectionAssert.ReferenceEquals no se debe usar para las aserciones. Use los métodos CollectionAssert o las sobrecargas Assert.AreSame & en su lugar.
fr: CollectionAssert.ReferenceEquals ne doit pas être utilisé pour les assertions. Utilisez plutôt les méthodes CollectionAssert ou Assert.AreSame & overloads.
it: Non è possibile usare CollectionAssert.ReferenceEquals per le asserzioni. In alternativa, usare i metodi CollectionAssert o Assert.AreSame e gli overload.
ja: アサーションには CollectionAssert.ReferenceEquals を使用しないでください。代わりに CollectionAssert メソッドまたは Assert.AreSame およびオーバーロードを使用してください。
ko: CollectionAssert.ReferenceEquals는 Assertions에 사용할 수 없습니다. 대신 CollectionAssert 메서드 또는 Assert.AreSame 및 오버로드를 사용하세요.
pl: Element Assert.ReferenceEquals nie powinien być używany dla asercji. Zamiast tego użyj metod CollectionAssert lub Assert.AreSame oraz ich przeciążeń.
pt_br: CollectionAssert.ReferenceEquals não deve ser usado com as Declarações. Em vez disso, use os métodos CollectionAssert ou Assert.AreSame e as sobrecargas.
ru: Нельзя использовать CollectionAssert.ReferenceEquals для Assertions. Вместо этого используйте методы CollectionAssert или Assert.AreSame и перегрузки.
tr: CollectionAssert.ReferenceEquals, Onaylama için kullanılmamalı. Lütfen bunun yerine CollectionAssert yöntemlerini veya Assert.AreSame & aşırı yüklemelerini kullanın.

# IsInRangeFail
source: Value '{0}' is not within the expected range [{1}, {2}]. {3}
cs: Hodnota {0} není v očekávaném rozsahu [{1}, {2}]. {3}
de: Der Wert „{0}“ liegt nicht im erwarteten Bereich [{1}, {2}]. {3}
es: El valor "{0}" no está dentro del rango esperado [{1}, {2}]. {3}
fr: La valeur « {0} » n'est pas dans la plage attendue [{1}, {2}]. {3}
it: Il valore '{0}' non è compreso nell'intervallo previsto [{1}, {2}]. {3}
ja: 値 '{0}' は予期される範囲 [{1}, {2}] にありません。 {3}
ko: '{0}' 값이 예상 범위 [{1}, {2}] 내에 있지 않습니다. {3}
pl: Wartość „{0}” nie mieści się w oczekiwanym zakresie [{1}, {2}]. {3}
ru: Значение "{0}" не находится в пределах ожидаемого диапазона [{1}, {2}]. {3}
tr: '{0}' değeri beklenen aralıkta [{1}, {2}] değil. {3}
zh_hans: 值“{0}”不在预期范围 [{1}, {2}] 内。{3}
zh_hant: 值 '{0}' 不在預期的範圍 [{1}, {2}] 內。{3}

# UTF_ExpectedExceptionTypeMustDeriveFromException
source: The expected exception type must be System.Exception or a type derived from System.Exception.
cs: Typ očekávané výjimky musí být typu System.Exception nebo z něj odvozený.
de: Der erwartete Ausnahmentyp muss System.Exception sein oder von System.Exception abgeleitet werden.
es: El tipo de excepción esperado debe ser System.Exception o un tipo derivado de System.Exception.
fr: Le type de l'exception attendue doit être System.Exception ou un type dérivé de System.Exception.
it: Il tipo di eccezione previsto deve essere System.Exception o un tipo derivato da System.Exception.
ja: 予期される例外の型は System.Exception または System.Exception の派生型である必要があります。
ko: 예상 예외 형식은 System.Exception이거나 System.Exception에서 파생된 형식이어야 합니다.
pl: Oczekiwanym typem wyjątku musi być typ System.Exception lub typ pochodzący od typu System.Exception.
ru: Тип ожидаемого исключения должен быть System.Exception или производным от System.Exception.
tr: Beklenen özel durum türü, System.Exception türü veya System.Exception'dan türetilmiş bir tür olmalıdır.
zh_hans: 预期的异常类型必须为 System.Exception 或从 System.Exception 派生的类型。
zh_hant: 預期的例外狀況類型必須是 System.Exception 或衍生自 System.Exception 的類型。
